["<strong>Сьвятыя бескарысьлівыя лекары Кузьма і Дзям’ян<\/strong><p>\nБылі роднымі братамі, паходзілі з Арабіі. Паводле прафесіі былі лекарамі. Падчас сваёй лекарскай службы ня бралі заплаты з бедных. Былі замучаныя і пакараныя сьмерцю за адмову адрачыся ад Хрыста. Верагодным годам іхняй сьмерці ўважаецца 303 г.<p><p><strong>Вялебны Пётра Канстанцінопальскі<\/strong><p>\nВялебны Пётра нарадзіўся ў часы рэгенцтва імператрыцы Ірыны (780-802) у Канстанцінопалі ў сям'і патрыцыя. З раньняга дзяцінства Пётра старанна вучыўся і, падобна працавітай пчале, зьбіраў у душы лепшае з таго, што знаходзіў у філасофіі і літаратуры. У валадараньне візантыйскага імператара Нічыпара (802-811) Пётра быў прызначаны вайскаводам і ўдзельнічаў у многіх пасьпяховых паходах візантыйскага войска супраць Баўгарыі. 26 ліпеня 811 г., у адной з бітваў з войскам баўгарскага хана Крума, які сабраў разам усіх баўгараў, авараў і славянаў, візантыйцы пацярпелі вялікую паразу. Імператар быў сьмяротна паранены, а Пётра сярод многіх іншых ваяроў патрапіў у палон.<p><p>\n\nАднойчы ўначы, падчас руплівай малітвы ў вязьніцы, яму зьявіўся ў відзежы сьвяты евангеліст Ян Багаслоў, які вызваліў з палону і прывёў у Рым. Вярнуўшыся ў Канстанцінопаль, сьвяты Пётра пакінуў сьвецкае жыцьцё і сышоў у манастыр на гару Алімп (Малая Азія), дзе стаў манахам. Там у малітвах ён правёў 34 гады пад кіраўніцтвам вялебнага Анікея Вялікага (памяць 4 лістапада). Увесь час свайго манаскага жыцьця вялебны Пётра трымаў строгі пост і малітоўнае чуваньне, насіў калючую валасяніцу і хадзіў без абутку. Апошнія 8 гадоў ён жыў у Канстанцінопалі, дзе стварыў храм і манастыр сьвятога Эвандра.\n\nВялебны Пётра спачыў на сямідзясятым годзе жыцьця (854 г.) і быў пахаваны ў сваім манастыры.","<strong>Пакладаньне рызы Найсьвяцейшай Багародзіцы ў Блахерне<\/strong><p>\t\nУ знакамітай сьвятыні Багародзіцы ў Блахерне, што некалі была ў паўночна-заходнім прадмесьці Канстанцінопаля, з 458 г. знаходзілася рыза Найсьвяцейшай Багародзіцы, а пазьней у каўчэг з ёй паклалі таксама покрыва (мафор) і частку пояса Багародзіцы. Паводле паданьня рызу Багародзіцы перадаў з Палестыны ў Канстанцінопаль для імператрыцы Пульхерыі патрыярх Ерусалімскі Ювенал.<p><p>\n\nХрамавы комплекс у Блахерне быў вядомы таксама з вельмі шанаванай у Канстанцінопалі Блахернскай іконы Маці Божай. Сьвятыня Багародзіцы з цудатворным абразом знаходзілася каля імператарскага палацу ў канстанцінопальскім прадмесьці Блахерна.<p><p>\n\nХрам пачала будаваць яшчэ імператрыца Пульхерыя, працягваў пасьля яе сьмерці яе муж імператар Маркіян, а закончыў пабудову імператар Леў I (457-474). Пазьней наступныя імператары ня раз яшчэ перабудоўвалі і рэстаўравалі санктуарыюм Маці Божай. Храмавы комплекс складаўся з трох асобных збудаваньняў: базылікальнай царквы (90 х 36 м), капліцы для сьвятых рэліквіяў Найсьвяцейшай Багародзіцы, якую ўзьвёў імператар Леў I, і залі для сьвятой крыніцы з басейнам у цэнтры і купалам над ёй. З паўднёвага боку санктуарыюма ў эпоху Комнінаў збудавалі комплекс будынкаў імператарскага палацу, а каля царквы імператар Іраклі I (610-641) узьвёў абаронны мур. У алтарнай частцы храму, верагодна, знаходзілася Блахернская ікона Маці Божай.<p><p>\n\nБлахерна была ня толькі цэнтрам царкоўнага, але і палітычнага жыцьця Візантыі, мела прывілей і права надаваць прытулак. Менавіта тут каранаваліся візантыйскія імператары. Таксама ў тут адбываліся сіноды. Сьвятыня ў Блахерне адначасова спаўняла функцыю абарончай крэпасьці, дзе малілся падчас аблогі Канстанцінопаля. Ня раз дзякавалі цудоўнаму заступніцтву Багародзіцы за ўратаваньне падчас шматлкіх нашэсьцяў і аблогі Канстанцінопаля ворагам. Уласна ў гэтым храме падчас адной з аблогаў адбылося знакамітае зьяўленьне Багародзіцы вернікам, што маліліся з храме, якая пакрыла ўсіх сваім мафорам і ўратавала Канстанцінопаль. У памяць пра гэтую падзею Царква на Русі з XII стагоддзя ўстанавіла сьвята Покрыва Найсьвяцейшай Багародзіцы. У 1285 г. у Блахерне былі падпісаныя ўхвалы II Ліёнскага сабору, якія датычылі царкоўнай уніі. Да 1204 г. тут знаходзілася Турынская плашчаніца.<p><p>\n\n29 лютага 1434 г. царква ў Блахерне загарэлася і абрынулася. Грошай на яе аднаўленьне ў Палеолагаў не было, і да сярэдзіны XIX стагоддзя навакол сьвятой крыніцы было пуста. Толькі ў 1867 г. месца блахернскай крыніцы было адзначана сьціплай грэцкай капліцай. Пасьля пажару 1434 г., які зьнішчыў блахернскую царкву, месцазнаходжаньне рызы губляецца. Вядома пра знаходжаньне яе частак у розных месцах: у Расеі ў каўчэзе Дыянісія Суздальскага, што захоўваўся ў Дабравешчанскай царкве маскоўскага Крамля, у Латэранскай базыліцы ў Рыме, у Блахернскай царкве ў Зугдзідзі і ў шэрагу іншых месцаў.\n<p><p><strong>Ювенал, патрыярх Ерусалімскі<\/strong><p>\n Сьвяты каталіцкай і праваслаўнай Царквы. Ювенал з Ерусаліму быў сябрам сьв. Яўхіма Вялікага. У 420 або 422 годзе ён стаў біскупам Ерусаліму. Падчас Эфэскага сабору ён распачаў намаганьні, каб падняць статус Ерусалім да патрыярхату, але тады гэта не дало выніку. На гэтым Саборы ён падтрымаў Александрыйскага патрыярха Кірылу супраць ерасі нестарыянства. У 451 г. ён удзельнічаў у Халкідонскім саборы, які асудзіў монафізітаў. Падчас гэтага Сабору яму ўдалося схіліць айцоў Сабору, каб падвысіць пасад у Ерусаліме да патрыярхату. Ювенал стаў першым патрыярхам Ерусалімскім. Памёр у 458 г. у Ерусаліме. \n\n<p><p><strong>Будслаўская ікона Маці Божай<\/strong><p>\nБудслаўская ікона Маці Божай здаўна вядомая сваімі цудамі і ласкамі, якія сплываюць за пасярэдніцтвам Маці Божай пры малітве каля яе абраза ў Будславе. Дзякуючы вялікай пашане, якою атачаюць будслаўскую сьвятыню вернікі, Сьвяты Айцец Ян Павел ІІ абвясьціў касьцёл у Будславе малой базылікай. Будслаўская сьвятыня таксама зьяўляецца Нацыянальным санктуарыюмам католікаў Беларусі.","<strong>Мучанік Гіяцынт<\/strong><p>\nМучанік Гіяцынт быў пакаёвым служкам у рымскага імператара Траяна (98-117). Паходзіў з Кесарыі Кападакійскай (сёньня г. Кайсэры ў Турцыі), выхоўваўся ў хрысьціянскай сям’і.\n<p><p>Аднаго разу, калі Траян сьвяткаваў паганскае сьвята, і, адпаведна еў ахвярнае мяса, яго служка Гіяцынт зачыніўся ў сваім пакойчыку і маліўся. Словы малітвы пачуў іншы служка і данёс імператару. Узлаваны імператар загадаў прывесьці Гіяцынта і прапанаваў яму зьесьці мяса з ахвяраў. Гіяцынт адмовіўся і сказаў, што зьяўляецца хрысьціянінам. На загад імператара быў зьбіты і ўвязьнены, яго мучылі голадам і смагай пакуль ня згодзіцца зьесьці ахвярнага мяса. На трыццаць восьмы дзень адзін з вартавых, які прынёс яму мяса, пабачыў як анёлы апранаюць на Гіяцынта белы хітон, а на галаву — вянец. Калі прыйшлі каты, каб зноў працягваць свае катаваньні, яны ўбачылі, што 20-гадовы сьвяты мучанік быў ужо мёртвы. Ягоныя мошчы былі перанесеныя пазьней у Кесарыю.","<strong>Сьв. Андрэй, архібіскуп Крыцкі<\/strong><p>\r\nСьв. Андрэй, архібіскуп Крыцкі, нарадзіўся каля 660 г. у Дамаску, памёр у 740 г. у Мітылене на высьпе Лесбос (Грэцыя). Быў вялікім царкоўным паэтам і прапаведнікам.\r\n<p>Бацькі яго былі хрысьціянамі. Паводле агіёграфаў, ад нараджэньня і да 7 гадоў не размаўляў і загаварыў толькі пасьля таго як прычасьціўся сьв. Тайнаў. Пачатковую адукацыю атрымаў у Дамаску, дзе вывучыў асновы граматыкі, рыторыкі і філасофіі і Сьвятое Пісьмо. Пасьля таго як споўнілася 14 гадоў, Андрэй Крыцкі паступіў у брацтва пры храме Ўваскрасеньня ў Ерусаліме, дзе быў пастрыжаны ў манахі, пасьвячаны на чытальніка, а затым прызначаны натаром і эканомам.\r\n\r\n<p>Увосень 685 г., пасьля таго як акты VI Сусьветнага сабору былі дасланыя ў Ерусалім і прынятыя Ерусалімскай Царквой, Андрэй Крыцкі разам з 2 манахамі па даручэньні ерусалімскага біскупа Тэадора даставіў іх у Канстанцінопаль імператару Канстанціну IV. Пасьля выкананьня сваёй місіі застаўся ў адным з манастыроў Канстанцінопаля, быў высьвечаны на дыякана і кіраваў дзіцячым прытулкам і домам для састарэлых. У 692 г. быў прызначаны на пасаду біскупа Гартыніі на Крыце.\r\n\r\n<p>Некаторы час быў прыхільнікам монатэлітаў, але потым вярнуўся да навукі Царквы. Паводле сьведчаньня сьв. Тэафана Вызнаўцы, на саборы, скліканым імператарам Філіпікам для аднаўленьня монатэліцтва (712 г.), Андрэй Крыцкі разам з біскупам Кізіцкім сьвяціцелем Германам, будучым патрыярхам Канстанцінопальскім, быў у ліку тых, хто падпісаў анафему VI Сусьветнаму сабору. Пасьля Андрэй Крыцкі раскаяўся ў тым, што падпісаў ерэтычнае вызначэньне. Традыцыя зьвязае з гэтай падзеяй складаньне ім знакамітага Вялікага пакаяннага канону. Пасьля зьвяржэньня імператара ў 713 г. прававернасьць была адноўленая, а сьпісы актаў VI Сусьветнага сабору нанова былі разасланыя, прынятыя і падпісаныя ўсімі былымі ўдзельнікамі сабору 712 г.\r\n\r\n<p>Падчас кіраваньня імператара Льва ІІІ Ісаўрскага, які змагаўся з шанаваньнем іконаў, Андрэй Крыцкі выступаў у абарону сьвятых абразоў. На Крыце Андрэй Крыцкі будаваў цэрквы, у тым ліку паводле выявы Блахернскай сьвятыні ў Канстанцінопалі, уладкоўваў прытулкі і багадзельні. Пасьля яго малітваў зьдзяйсняліся шматлікія цуды. Некалькі разоў Андрэй Крыцкі зьдзяйсьняў падарожжы ў Канстанцінопаль. У 740 г. па шляху на Крыт ён захварэў і памёр на высьпе Лесбас, дзе яго мошчы былі пакладзены ў храме мучаніцы Анастасіі (цяпер — царква сьв. Андрэя Крыцкага).\r\n\r\n<p>Андрэй Крыцкі зьяўляецца аўтарам Вялікага канону — пакаяннай песьні, якая сьпяваецца на пачатку і ў чацьвер 5-га тыдня Вялікага посту. Заклаў сам жанр канону як формы рэлігійнай паэзіі. Быў таксама аўтарам кандакоў, з якіх самы вядомы — на Раство Хрыстовае.<p>\r\n<strong>Вялебная Марта<\/strong><p>\r\nВялебная Марта, маці Сямёна Дзіўнагорцы, жыла ў VI стагоддзі ў Антыёхіі. Усё жыцьцё хацела пайсьці ў манастыр, але яе бацькі намовілі пайсьці замуж. Пасьля хуткай сьмерці мужа ўсе сілы паклала на выхаваньне сына, будучага вялікага аскета і сьвятога Сямёна Дзіўнагорцы. Памерла ў 551 годзе. Яе пахавалі на Дзіўнай гары, месцы аскетычных подзьвігаў ейнага сына.\r\n","<strong>Вялебны Апанас Афонскі<\/strong><p>\nВялебны Апанас Афонскі нарадзіўся каля 925-930 гадоў у Трапезундзе, а памёр каля 1002 на Афоне.\n\n<p><p>Быў настаўнікам у Канстанцінопалі, потым пайшоў у манастыр Кімінас у Бітыніі. Каб пазьбегнуць выбару яго на ігумена перасяліўся на Афон. Там з дапамогай аднаго з вайсковых начальнікаў будаваў Вялікую лаўру і галоўную царкву ў гонар Маці Божай. Распачаў аднову манаскага жыцьця на Афоне, увёў правілы супольнага жыцьця, заснаваныя на ўставе сьв. Тэадора Студыта.","<strong>Вялебны Сысой Вялікі<\/strong><p>\nВялебны Сысой Вялікі паходзіў з Ягіпту. Шэсьцьдзясят гадоў жыў на гары, на якой вёў сваё аскетычнае жыцьцё сьв. Антон Вялікі. Памёр каля 429 году. Атрымаў ад Бога дар уваскрашэньня мёртвых.","<strong>Вялебны Тамаш<\/strong><p>\nВялебны Тамаш з гары Малеі быў жаўнерам. Дзеля любові да Хрыста стаў манахам і выправіўся на гару Малея на Пелапанэсе. Памёр пад канец Х стагоддзя.\n<p><p><strong>Вялебны Акакій<\/strong><p>\nЖыў у першай палове VI ст. Пра яго вядома з «Лесьвіцы» сьв. Яна Лесьвічніка. Вялебны Акакій быў паслушнікам у аднаго суворага і жорсткага старца ў Сінайскім манастыры. Старац прымушаў яго працаваць да зьнясіленьня, трымаў галодным, біў. Ня вытрываўшы такога стаўленьня, Акакій памёр. Пасьля сьмерці Акакія старац пакаяўся, жыў каля магілы вучня і памёр ў малітвах.","<strong>Вялікамучанік Пракоп<\/strong><p>\nВялікамучанік Пракоп быў вельмі адукаваным чалавекам і хутка прасоўваўся па службовай лесьвіцы. Цэзар Дыяклетыян даручаў яму важныя заданьні, сярод якіх было і зьнішчэньне хрысьціянаў у Александрыі. Па дарозе ў Алкександрыю ў сірыйскай Апамэі Пракоп пабачыў вялізны крыж на небе, і меў дыялог з Хрыстом, падобна да дыялогу Хрыста з Паўлам непадалёку ад Дамаску. Пасьля гэтага ён становіцца дзейным хрысьціянінам, чытальнікам, перакладчыкам з сірыйскай мовы і экзарцыстам. Маці-язычніца данесла на яго і ён быў увязьнены ў Кесарыі Палестынскай. Ён адмовіўся прыносіць ахвяру паганскім багам і ў гэтым падпарадкавацца імператарам (у рымскай імперыі, падзеленай на некалькі частак, у той час кіравалі чатыры імператары), працытаваўшы з «Іліяды» Гамэра, які гаварыў, што лепш мець аднаго імператара. Пракоп намякаў тут на аднаго Ўладара Хрыста. Пракоп памёр, засечаны мечам, каля 303 году.","<strong>Сьвятамучанік Панкрат, біскуп Таўрамянійскі<\/strong><p>\nСьвятамучанік Панкрат, біскуп Таўрамянійскі, паходзіў з ваколіцаў Антыёхіі. Разам з сваімі бацькамі прыняў хрост у Ерусаліме. Пасьля таго як бацькі памерлі, пакінуў сваю маёмасьць і аддаліўся да нейкага гроту ў рэгіёне Понту. Там ён спаткаў апостала Пятра, разам з якім яны прышлі ў Антыёхію, а потым у Кілікію. Там сьв. Панкрат спаткаў апостала Паўла, які высьвяціў яго на біскупа і паслаў абвяшчаць Добрую Вестку на Сіцылію ў Таўраменій (сёньня — Таарміна). Там яго схапілі язычнікі і зацягнулі ў сваю сьвятыню, дзе задушылі.","<strong>Вялебны Антон Пячорскі<\/strong><p>\r\nВялебны Антон Пячорскі нарадзіўся ў 983 годзе ў Любечы, што месьціўся на поўнач ад Кіева. У юнацтве ён вырашыў выправіцца на Ўсход, каб бліжэй пазнаёміцца з манаскім жыцьцём. Патрапіў на Афон, дзе пэўны час жыў. Адтуль вярнуўся на Русь і пасяліўся паблізу Кіева ў пячоры. Вёў у пячоры жыцьцё пустэльніка. Вакол яго пачалі гуртавацца іншыя людзі, якія шукалі манаскага жыцьця. З дапамогай іх ён пашырыў пячоры і збудуваў царкву. Калі пабачыў, што манастыр можа існаваць і без яго, выбраў на ігумена Варлама, а пасьля Тэадосія. Сам пасяліўся ў пячоры, дзе пражыў сорак гадоў. У старасьці заснаваў яшчэ адзін манастыр у Чарнігаве. Памёр у Пячорскай лаўры 10 ліпеня 1073 г.<p>\r\n<strong>45 мучанікаў з Нікапаля<\/strong><p>\r\n45 мучанікаў з Нікапаля Армянскага прынялі сьмерць за Хрыста ў распаленай печы каля 319 году, калі імператарамі адначасова былі Ліцыній і Канстанцін Вялікі, а зьверхнікам правінцыі — Лісій.\r\n<p>Ліцыній жорстка перасьледаваў хрысьціянаў. У сваёй усходняй вобласьці імперыі ён выдаў загад аддаваць на мукі і сьмерць усіх, хто ня згодны вярнуцца да паганства. Калі пачаліся перасьледаваньні ў Нікапалі, больш за сорак пасьлядоўнікаў Хрыста вырашылі дабраахвотна зьявіцца да ганіцеляў, адкрыта вызнаць веру ў Сына Божага і прыняць мукі. Сьвятых вызнаўцаў узначальвалі Лявонці, Маўрыкій, Даніла, Антон, Аляксандар, якія вылучаліся сваім дабрадзейным жыцьцём.\r\n\r\n<p>Чыноўнік, да якога прыйшлі сьвятыя вызнаўцы, быў зьдзіўлены аднадушнасьцю і мужнасьцю людзей, якія дабраахвотна выракалі сябе на мукі і сьмерць. Ён імкнуўся пераканаць іх адрачыся ад Хрыста і прынесьці ахвяру паганскім багам, але сьвятыя былі непахісныя. Тады чыноўнік загадаў кідаць у твары хрысьціянам камянямі, а потым закаваць і кінуць у цямніцу.\r\n\r\n<p>Калі сьвятыя мучанікі апоўначы сьпявалі псалмы, нечакана зьявіўся ім анёл Гасподні, і сьвятло асьвятліла цямніцу. Анёл абвясьціў вязьням, што іх подзьвіг набліжаецца да канца, а іх імёны ўжо запісаныя на нябёсах. Двое вартаўнікоў вязьніцы, Менэй і Вірылад, якія бачылі ўсё, што адбывалася, паверылі ў Хрыста. На наступную раніцу Ліцыній вырашыў аддаць на сьмерць Хрыстовых вызнаўцаў. Пасьля нечалавечых катаваньняў іх спалілі ў печы, а косткі кінулі ў раку. Пабожныя людзі знайшлі іх, сабралі і захавалі. Пазьней, калі была дадзеная свабода Царкве Хрыстовай, на тым месцы быў узьведзены храм у гонар сьвятых 45-ці мучанікаў.\r\n","<strong>Мучаніца  Яўхімія ўсяхвальная<\/strong><p>    \nСьвятая Яўхімія нарадзілася ў сям’і багатых і пабожных хрысьціянаў. Жыла ў горадзе Халкідоне. Зямныя радасьці ня цешылі яе, таму ўсёй душой яна была скіраваная да Бога. Калі Яўхімія не пагадзілася ўдзельнічаць ва ўрачыстасьцях у гонар паганскага бажка, жорсткі стараста загадаў яе бязьлітасна мучыць, а потым яе кінулі на разарваньне мядзьведзю. Адбылося гэта ў 307 годзе. Над яе труной у Халкідоне пабудавалі вялікую царкву, у якой у 451 годзе адбыўся IV Сусьветны сабор, які асудзіў ерась монафізітаў. Праз заступніцтва сьв. Яўхіміі дзеяліся шматлікія цуды.\n<p><p><strong>Перастаўленьне блаславёнай Вольгі, княгіні Кіеўскай<\/strong><p>\nЯна прыняла хрост у Канстанцінопалі, стаўшы хроснай дачкой імператара Канстанціна VII Парфірагенета. Запрашала на місію сьвятароў у імператара заходняй Рымскай імперыі Атона І. Паспрыяла пашырэньню хрысьціянства на Русі, але канчаткова хрысьціянства перамагло толькі падчас панаваньня яе ўнука Ўладзіміра. Памерла ў 969 годзе.","<strong>Мучанікі Прокл і Гіляры<\/strong><p>\nМучанікі Прокл і Гіляры былі сваякамі. Нягледзячы на жорсткія мучэньні, не адракліся ад Хрыста. Цярпелі за веру падчас кіраваньня імператара Траяна (98-117)\n<p><p><strong>Вялебны Міхаіл з Малеі<\/strong><p>\nСьвяты Міхаіл з Малеі жыў у X ст. Нарадзіўся ў 894 годзе ў правінцыі Кападокія, быў дзядзькам грэцкага імператара Фокі і сваяком візантыйскага імператара Льва VI Мудрага. Хоць паходзіў з шляхетнага роду, але не любіў сьвецкай раскошы. Пасьля заканчэньня вучобы пакінуў сьвецкае жыцьцё і стаў манахам на гары Малеон, у навакольлі слаўнай пазьней гары Афон ў Грэцыі. Манаскае жыцьцё Міхаіла, які пазьней стаў ігуменам манастыра, было поўнае малітвы, посту, дасканалай любові і цярплівасьці. Адышоў Міхаіл з Малеі да Госпада ў глыбокай старасьці, у 962 годзе, пасьля 50 гадоў аскетычнага манаскага жыцьця.","<strong>Сабор сьвятога арханёла Габрыэля<\/strong><p>\t\nАрханёл Габрыэль — адзін з сямі арханёлаў у традыцыі Царквы, што былі згаданыя па імёнах. Арханёл Габрыэль зьвеставаў Багародзіцы Марыі пра тое, што яна народзіць Збаўцу сьвету.\n<p><p><strong>Вялебны Сьцяпан Саваіт<\/strong><p>\nСьцяпан Саваіт паводле традыцыі быў сваяком Яна з Дамаску. Сваё аскетычнае змаганьне праводзіў у Лаўры сьв. Савы. Ён аўтар шматлікіх царкоўных песьнясьпеваў — канонаў. Пакінуў пасьля сябе апісаньне мучаніцтва 20-ці манахаў манастыра сьв. Савы, забітых у 797 годзе.","<strong>Апостал Акіла з 70-ці<\/strong><p> \nАпостал Акіла з шэрагу сямідзесяці апосталаў паходзіў з Понту, у Рыме навярнуўся ў хрысьціянства. Адзін з блізкіх супрацоўнікаў сьв. Паўла. Разам з жонкай Прысцылай быў выгнаны ў 49 годзе з Рыму дэкрэтам імператара Клаўдзія (Дз 18, 2). Пасяліўся ў Карынце, дзе ў іх жыў апостал Павел, з якім разам яны выраблялі намёты (Дз 18, 3). З 52 году жыў у Эфэсе, дзе прапанаваў свой дом для багаслужбаў. У Эфэсе ён пазнаёміў Апалона з навукай Хрыста (Дз 18, 26). Праз некалькі гадоў зноў вярнуўся ў Рым, дзе ягоны дом стаўся адным з галоўных асяродкаў хрысьціянскага жыцьця (Рым 16, 3-5).","<strong>Сьвяты роўнаапостальны князь Уладзімір<\/strong><p>\nКнязь Уладзімір, князь кіеўскі (каля 960 — 1015) спрычыніўся да афіцыйнага ўвядзеньня хрысьціянства на Русі. Пачаткам яго навертаньня лічыцца шлюб з дачкой візантыйскага імператара Ганнай. Як хрысьціянін ён пакінуў тады сваіх шматлікіх жонак, пачаў весьці хрысьціянскі лад жыцьця. Падчас свайго хросту князь Уладзімір атрымаў хрысьціянскае імя Васіль. Паколькі князь Уладзімір жыў да расколу хрысьціянскай Царквы ў 1054 годзе, ён шануецца і ў Каталіцкай Царкве.\n<p><p><strong>Мучанікі Кірык і Юліта<\/strong><p>\nРаньнехрысьціянскія сьвятыя мучанікі Юліта і яе сын Кірык, якія шануюцца як католікамі, так і праваслаўнымі, паходзілі з Іконіі. Былі замучаныя за часоў Дыяклецыяна (284-305 гг.). Паводле легендарных зьвестак Кірык быў дзіцём у веку трох гадоў, калі ягоную маці Юліту, багатую і заможную хрысьціянку, якая пасьля сьмерці мужа разам з прыслугаю ўцякала ад перасьледаваньняў у Іконіі, схапілі ў Тарсе ў Кілікіі. Падчас суду, адабраўшы ад маці малога Кірыка, зьверхнік правінцыі спрабаваў пяшчотамі дамагчыся ягонай прыхільнасьці. Але малое дзіця падчас свайго плачу і лепятаньня вымавіла імя Хрыста і адпіхнула злачынцу. Разьюшаны кат забіў хлопчыка на вачах маці, кінуўшы яго на зямлю так, што разьбіў яму галаву аб сходы. Маці, якая пачала ўзмоцнена маліцца, яшчэ больш разьюшыла ўладара, які загадаў яе катаваць. Яна адмовілася вызнаваць паганскіх бажкоў, і тады ёй сьцялі галаву. Юліта прыняла мучаніцкую сьмерць разам з сынам Кірыкам і дзясяткамі іншых хрысьціянаў каля 305 году.","<strong>Айцы першых 6-ці Ўсяленскіх сабораў<\/strong><p>\nУ нядзелю, найбліжэйшую да 16 ліпеня (гэта перыяд з 13 да 19 ліпеня), адзначаецца ўспамін айцоў першых шасьці Ўсяленскіх сабораў. Усяленскія саборы мелі вялікае значэньне для зьяўленьня і выпрацоўкі царкоўнай дагматыкі і адстойваньня Хрыстовай Царквой сваёй ідэнтычнасьці ў варунках гістарычнага разьвіцьця, калі было неабходна застацца вернымі Праўдзе Хрыстовай.\n<p><p><strong>Сьвятамучанік Атэнаген і 10 ягоных вучняў<\/strong><p>\nАтэнаген быў біскупам Себасты ў Арменіі. Жыў каля гораду ў невялікім манастыры. Падчас Дыяклецыянавага перасьледаваньня разам з сваімі вучнямі быў схоплены і прымушаны да здрады Хрысту. Адмовіўшыся, большасьць мучанікаў была засечаная мечам. Затым пачалі катаваць і іх пастыра, але Атэнаген з годнасьцю ўсё вытрымаў усе зьдзекі і быў забіты. Паводле заходняй традыцыі біскуп Атэнаген верагодна быў спалены.","<strong>Вялікамучаніца Марына<\/strong><p>\nВялікамучаніца Марына была дачкой паганскага сьвятара. Была замучана падчас кіраваньня імператара Клаўдзія ІІ Гота (268-269). Пасьля сьмерці маці была аддадзеная на выхаваньне адной жанчыне, якая была хрысьціянкай. Калі мела 15 гадоў была арыштаваная і прыведзеная да зьверхніка Антыёхіі Пісідыйскай Алімбрыяса. Калі яе запыталі пра веру, адказала, што заклікае імя Госпада Ісуса Хрыста. Была закаваная ў кайданы, пасаджаная ў вязьніцу, бічаваная і засечаная мечам.\n<p><p><strong>Сьвятамучанік Павел (Гойдыч), біскуп Прэшаўскі<\/strong><p>\nПрэшаўскі грэка-кататаліцкі біскуп Павел Гойдыч не адступіў ад Царквы ў часы камуністычнага перасьледу ў Чэхаславакіі. Прайшоўшы турму, розныя катаваньні — фізічныя і псіхалагічныя, памёр у вязьніцы, як мужны сьведка Хрыста.<p><p>\n\nПётр Гойдыч нарадзіўся 17 ліпеня 1888 году ў сям’і грэка-каталіцкага сьвятара Стэфана Гойдыча і Ганны (Гэрбэры) у вёсцы Руске Пэкляны ва ўсходняй Славакіі.<p><p>\nВучыўся ў семінарыі ў Прэшаве і Будапешце. Сьвятарскія сьвячаньні прыняў з рук біскупа Яна Вальі 27 жніўня 1911 году. Адразу пасьля сьвячаньняў ён працаваў у парафіі свайго бацькі вікарыем. Праз год атрымаў пасаду прэфекта ў епархіяльным інтэрнаце для моладзі. Адначасова выкладаў рэлігію ў школах Прэшава. Пазьней працаваў таксама ў епархіяльным архіве, быў вікарыем у прэшаўскай парафіі, адміністратарам парафіі ў Сабінаве, недалёка ад Прэшава, быў таксама дырэктарам біскупскай канцылярыі.<p><p>\n\nУсё сваё жыцьцё ён хацеў прысьвяціць толькі Богу і малітве, і таму 20 ліпеня 1922 году ўступіў у манастыр Закону Айцоў Базыльянаў на Чарнечай Гары каля Мукачава (Закарпацьце), якая ў тыя часы была часткай Чэха-Славакіі. 27 студзеня 1923 году ён быў дапушчаны да навіцыяту і прыняў імя Павел. Ягоныя мары пра жыцьцё ў манаскай супольнасьці аднак ня споўніліся. 14 верасьня 1926 году Сьвятая Сталіца намінавала яго Апостальскім адміністратарам Прэшаўскай япархіі.<p><p>\n\nУжо 7 сакавіка 1927 году папа Пій XI менаваў яго тытулярным біскупам Гарпаскім, адначасова Павел Гойдыч заставаўся на пасадзе Адміністратара Прэшаўскай япархіі. Біскупскую сакру ён атрымаў у царкве сьв. Клімента ў Рыме 25 сакавіка 1927 году з рук біскупаў: Дыянісія Ньірадзі — Крыжавацкага біскупа з Югаславіі, Язафата Кацылоўскага —- біскупа з Перамышля, што ў Польшчы, і Канстанціна Багаціўскага — Філадэльфійскага біскупа са Злучаных Штатаў Амерыкі. Яго біскупскім дэвізам сталі словы: «Бог ёсьць любоў, будзем любіць Яго!»<p><p>\n\nНа пасадзе біскупа Павел Гойдыч шмат зрабіў у розных жыцьцёвых накірунках: як літургічным, так у душпастырскім ды адміністрацыйным. Ён прыклаў намаганьні, каб рознага роду набажэнствы адпраўляліся паводле літургічных рубрык. Біскуп клапаціўся пра заснаваньне новых грэка-каталіцкіх парафіяў, асабліва ў гарадах, такіх, як Прага, Браціслава, каб людзі, якія ў пошуках працы пераязджалі ў вялікія гарады, не згубілі сваёй веры.\n\nУ час ІІ Сусьветнай вайны, з прычыны нязгоды з тагачаснай нацыянальнай палітыкай Славацкай дзяржавы (бо лічыў сябе русінам), ён папрасіў Сьвятую Сталіцу, каб звольніла яго з пасады адміністратара Прэшаўскай япархіі. Ватыкан звольніў яго ад абавязкаў адміністратара, але менаваў яго біскупам Прэшаўскім. Біскуп Павел і надалей шчыра й ахвотна працаваў у справе збаўленьня душаў.<p><p>\n\nАднак у 1950 годзе, 28 красавіка, у дзень, калі камуністы зьнішчылі Грэка-Каталіцкую Царкву ў Чэха-Славакіі, ён быў ізаляваны ад сваёй паствы. Суд прызнаў яго віноўным у шпіянажы для Ватыкану і прысудзіў пажыцьцёвае зьняволеньне ў вязьніцы, пазьней тэрмін быў «скарочаны» да 25 гадоў. Не дачакаўшыся, аднак, свабоды, біскуп Павел Гойдыч памёр у вязьніцы 17 ліпеня 1960 году ў дзень, калі яму споўнілася 72 гады. Перад сьмерцю прыступіў да сьв. Тайны споведзі і прыняў Сьвятое Прычасьце з рук рыма-каталіцкага сьвятара Францішка Враны, які таксама быў у вязьніцы, падобна, як і шмат іншых сьвятароў у тыя цяжкія для Царквы ў Славакіі часы.<p><p>\n\nПахаваны біскуп на могілках леапольдаўскай вязьніцы без сьвятара, пад нумарам 861. У 1968 годзе, калі Грэка-Каталіцкая Царква ў Славакіі зноў атрымала права на існаваньне, ягонае цела перазахавалі ў крыпце прэшаўскай катэдры, а з 1990 году біскуп Павел Гойдыч спачывае ў капліцы сьв. Пятра і Паўла прэшаўскай грэка-каталіцкай катэдры. Біскуп Павал Гойдыч асабліва шанаваны сярод славакаў, русінаў і венграў.","<strong>Сьв. Амільлян<\/strong><p>\nСьв. Амільлян жыў падчас панаваньня Юльяна Адступніка. Быў вельмі руплівым хрысьціянінам і ненавідзеў шанаваньне паганскіх ідалаў. Аднаго разу ён узяў малаток і пайшоў у паганскую сьвятыню, разьбіў паганскіх балваноў і выйшаў незаўважаны. Калі пагане адрэстаўравалі сваіх ідалаў, зрабіў гэта паўторна і, аддаўшыся ў рукі ўладзе, быў жорстка бічаваны. Памёр, будучы ўкінуты ў вагонь.","<strong>Вялебная Макрына<\/strong><p>\nВялебная Макрына, была сястрой сьвятога Васіля Вялікага. Была прыгожага выгляду і добрых манераў. Была абяцаная аднаму маладому чалавеку са знакамітай сям’і як жонка. Калі ён загінуў падчас свайго гандлёвага падарожжа, Макрына адкінула ўсе наступныя прапановы пабрацца шлюбам і разам з сваёй маці прысьвяціла сябе выхаваньню сваіх малодшых братоў і сёстраў. Калі дзеці вырасьлі, намовіла маці звольніць слугаў і пайсьці ў манастыр. За імі пасьледавалі і некаторыя служанкі. Памерла ў сьнежні 379 году, да апошніх хвілінаў жыцьця размаўляючы з сваім братам сьв. Рыгорам Ніскім пра душу.","<strong>Прарок Ільля<\/strong><p>\nПрарок Ільля у хрысціянстве зьяўляецца самым шанаваным старазапаветным сьвятым. Паходзіў з Цішбэ ў Галаадзе, што на ўсход ад ракі Ярдан і на поўнач ад Мёртвага мора (сёньня на тэрыторыі Ярданіі). Жыў у ІХ стагоддзі перад Хрыстом у часы цара Ізраіля Ахая і ягонай жонкі Ізабэль. Гэты прарок у Сьвятым Пісьме паказаны як чалавек цалкам адданы Богу. Быў бескампрамісным абаронцам адзінабожжа, які абараняў ізраільскі народ ад рэлігійнага сінкрэтызму. Быў таксама мужам веры і малітвы. На гары Харыў быў абдараваны глыбокім перажываньнем прысутнасьці Бога.","<strong>Вялебныя Сымон бажавольны і Ян<\/strong><p>\nСьвятыя Сымон бажавольны і Ян паходзілі з Эдэсы ў Сірыі. Нежанаты Сымон, які меў 30 гадоў, і жанаты 24-гадовы Ян аднойчы пайшлі на сьвята Ўзвышэньня сьвятога Крыжа ў Ерусалім. Вяртаючыся адтуль, прынялі рашэньне ўступіць у манастыр сьв. Герасіма на Ярдане. Перад тым даведаліся, што маці і жонка Яна памерлі. Апрануўшы манаскую вопратку, 40 гадоў яны жылі ў аскетычным змаганьні ў пустэльні на сьпёцы. Сьв. Ян заставаўся ў гэтым манастыры да канца свайго жыцьця, а сьв. Сымон перабраўся пазьней у Эмезу (сучасны Хомс у заходняй Сірыі), дзе прыняў на сябе стараньне быць бажавольным дзеля Хрыста. Сымон рабіў часта сьмешныя і дзіўныя рэчы, чым выстаўляў сябе на кпіны і зьдзекі, а між тым па-ціху рабіў шмат добрых учынкаў, якія былі выяўленыя толькі пасьля ягонай сьмерці. Сьв. Сымон нарадзіўся каля 522 году, памёр у супакоі ў канцы VI ст.\n<p><p><strong>Сьвяты прарок Езэкіэль<\/strong><p>\nПрарок Езэкіэль — трэці вялікі старазапаветны прарок у Бібліі, належаў да сьвятарскага роду. Імя прарока Езэкіэля, які жыў на мяжы VII-VI стагоддзяў, азначае «Гасподзь умацуе».\n<p><p>\nЖыў часы калі правіў юдэйскі цар Яхонія. Юнацкія гады правёў у Юдэі. У 25-гадовым узросьце Езэкіэль — сын сьвятара Бузіі, быў узяты ў палон падчас першага нашэсьця халдэяў на Ерусалім у 598 г. да н. э., разам з царом Якімам і іншымі шляхетнымі юдэямі. Там на пятым годзе свайго палону, быў пакліканы Богам на прароцкае служэньне, якому аддаў больш за 22 гады свайго жыцьця.\n<p><p>\nБудучы сучасьнікам прарока Ераміі, які застаўся ў Ерусаліме, і сьведкам цяжкіх выпрабаваньняў ізраільскага народу, ён пільна сачыў за жыцьцём палоненых суайчыннікаў у Месапатаміі. Паводле Божага натхненьня ён прыняў на сябе шэраг выпрабаваньняў, каб разьдзяліць цярпеньні і пакуты свайго народу. Дом гэтага прарока ў Тэль-Авіве, як і дамы многіх сьвятароў у палоне, стаў месцам, дзе зьбіраліся выгнаныя юдэі (менавіта з такіх дамоў, дзе адбываліся сходы ў эпоху палону, нарадзілася сінагога). Да людзей, якія да яго прыходзілі, прарок зьвяртаў свае палымяныя казаньні. Сваімі прароцтвамі Езекіэль аблегчаў іх лёс, засьцерагаў ад небясьпекаў жыцьця ў палоне і канчатковай гібелі сярод паганцаў. Езэкіэль, пералічваючы грахі Ізраіля і прадказваючы пакараньне, падкрэсьліваў, што Бог жадае ня гібелі беззаконных, але іх пакаяньня (Ез 18, 23). Ён суцяшаў суайчыньнікаў надзеяй на вызваленьне з палону, умацоўваў іх волю і веру ў надыход лепшых часоў.\n<p><p>\nПаданьне сьцьвярджае, што прарок Езэкіэль быў выдадзены на сьмерць адным з юдейскіх палонных князёў, якога ён выкрываў за ідаласлужэньне і амаральнае жыцьцё. Памёр каля 571 году да н. э. Магіла прарока Езэкіэля ў Іраку ў Эль-Кіфль, на поўдзень ад Багдаду.","<strong>Сьвятая роўнаапостальная Марыя Магдалена<\/strong><p>\nМіраносіца і роўная апосталам Марыя Магдалена паходзіла з галілейскага гораду Магдала каля Тыберыядзкага возера. Была вызваленая Хрыстом ад сямі дэманаў. З таго часу хадзіла за Настаўнікам і верна Яму служыла, стаўшыся Яго вучаніцай. Разам з Багародзіцаю яна была першай сярод тых, хто ўбачыў уваскрослага Хрыста. Невядома дакладна, чым займалася Марыя Магдалена пасьля Ўшэсьця Госпада, але традыцыя пераказвае, што яна спрычынілася да распаўсюджваньня веры ў Хрыста і таму названая роўнай апосталам.","<strong>Мучанікі Трахім, Тэафіл і інш.<\/strong><p>\nМучанікі Трахім, Тэафіл і іхныя 13 паплечнікаў сталі вызнаўцамі веры праз сваё мучаніцтва падчас панаваньня імператара Дыяклецыяна (284-305). Яны мужна вызналі веру ў Хрыста перад судом і адмовіліся скласьці ахвяру паганскім бажкам. За гэта зьведалі страшэнныя зьдзекі, пасьля чаго ім пераламлі голені і ўкінулі ў агонь. Дзякуючы Божай моцы, выйшлі з яго бяз шкоды здароўю, чым яшчэ больш праславілі Бога. Пасьля гэтага мучыцелі, зразумеўшы, што ня здолеюць зламаць іх веру ў Хрыста, паадсякалі ім галовы.\n<p><p><strong>Пачаеўская ікона Маці Божай<\/strong><p>\nПачаеўская ікона Маці Божай вядомая шматлікімі цудамі, сярод якіх захаваньне Багародзіцай Пачаева (цяпер Тарнопальская вобласьць, Украіна) ад нашэсьця татараў. Гэтая цудатворная ікона Багародзіцы набыла асаблівую славу ў час, калі ва Ўсьпенскай пачаеўскай лаўры несьлі служэньне базыльяне, якія збудавалі велічны манастырскі комплекс. З 1713 па 1833 гг. гэта быў адзін з найбольш значных цэнтраў базыльянаў, тут з 1730 году дзейнічала друкарня, у якой выдадзена 187 кніг. З тых часоў цудатворную ікону Маці Божай ушаноўваюць ня толькі праваслаўныя, але і грэка- і рыма-католікі. У гэты перыяд у манастырскай хроніцы занатаваныя 539 выпадкаў ацаленьня. У 1773 годзе ікона была каранаваная залатымі папскімі каронамі. Пачаеўская ікона Багародзіцы здаўна вядомая і шанаваная вернікамі ў Беларусі.","<strong>Мучанікі Барыс і Глеб<\/strong><p>\nМучанікі Барыс і Глеб былі першымі праслаўленымі сьвятымі на тэрыторыі старажытнай Русі. Былі малодшымі сынамі вялікага князя Ўладзіміра Вялікага. Былі забітыя, паводле дайшоўшай да нас гістарычнай традыцыі, з прычыны барацьбы за ўладу нібыта на загад іх брата Сьвятаполка. Прынялі сьмерць па-хрысьціянску, дабравольна, насьледуючы Хрыста. Таму па-славянску называюцца «страстотерпцамі» (пакутнікамі).\n<p><p><strong>Мучаніца Хрысьціна<\/strong><p>\nСьвятая Хрысьціна прыняла мучаніцкую сьмерць у Тыры (Фінікія) каля 220 году. Заможны бацька рыхтаваў яе да пасьвячэньня ў паганскія жрыцы, наладзіў у сваім доме невялікі храм ды ізаляваў яе ад сьвету, каб захаваць яе чысьціню. У гэтых умовах, паводле паданьня, сьв. Хрысьціна, разважаючы пра веру і зьвяртаючыся з малітвай да ідалаў, у 11 гадоў перажыла прасьвятленьне і адкрыла веру ў адзінага Бога-Творцу. Даведаўшыся пра мужную вызнаньне веры хрысьціянамі, яна сама прыняла Хрыста і выкінула з свайго дому ідалаў. Бацька намаўляў яе адкінуць хрысьціянскую веру, яе пачалі жорстка караць, але ўсё было марна. Існуе шмат версіяў таго, якія кары зьведала маладая дзяўчына і як яна загінула: білі розгамі, кідалі ў лёхі, выпрабоўвалі агнём і жалезам, круцілі ў коле, палівалі гарачым алеем, прывязвалі да слупа і стралялі па ёй з лука, і нарэшце да яе шыі быў прывязаны камень і так яе ўтапілі. Невядома, ці гэта было так, ці яна загінула ад меча або ад стрэлаў з лука, але Хрысьціна не адракласяя ад веры ў Хрыста, а яе каты ў рэшце рэшт былі пакараныя Богам.","<strong>*Усьпеньне сьвятой Ганны, маці Найсьвяцейшай Багародзіцы<\/strong><p>\nСьвятая Ганна разам з сваім мужам Якімам — гэта бацькі Найсьвяцейшай Багародзіцы Марыі. Паводле традыцыі Ганна паходзіла з Бэтлеему з сьвятарскай радзіны.","<strong>Вялебная мучаніца Параскева<\/strong><p>\nВялебная мучаніца Параскева нарадзілася ў ваколіцах Рыму, як падае традыцыя ў пятніцу. Адсюль яе імя, якое з грэцкай мовы перакладаецца – пятніца. З дзяцінства сьвятая чытала сьвяттое пісьмо, праводзіла вельмі закрыты вобраз жыцьця. Пасьля сьмерці сваіх бацькоў раздала маёмасьць бедным. Прапаведвала Хрыста паганам і шмат каго зь іх навярнула. Была схоплена і прымушалася да адданьня пашаны паганскім бажкам, але вызнала публічна іх марнасьць і была засечана мечам. Гэта здарылася кал 140 году.","<strong>Вялікамучанік Панцялейман, лекар<\/strong><p>\nСёньня згадваем памяць вялікамучаніка Панцялеймана, лекара. Ён быў вучням сьвятара Ермалая, якога згадвалі ўчора. Быў лекарам і лячыў не толькі сродкамі лекарскімі, але перадусім імем Хрыстовым. Да яго дзейнасьці вельмі пасавала ягонае імя Панцялейман у перакладзе з грэцкай поўны міласэрдзя. Аднагао разу прызываньнем імя Хрыстовага ён адкрыў вочы сьляпому і праз гэта адкрыў яму вочы на сьвятло веры. Прыкліканы на суд сьляпы, запытаны пра акалічнасьці свайго аздараўленьня падаў імя лекара і гісторыю свае хваробы пасьля чаго памёр. Закліканы на суд Панцялейман мужна сьведчыў Хрыста і пасьля жахлівых пакут быў засечаны мечам у 305 годзе за панаваньня імператара Максіміліяна на Ўсходзе.","<strong>Смаленская ікона Маці Божай<\/strong><p>\r\nСмаленская ікона Маці Божай здаўна была праслаўлена шматлікімі цудамі. Яе адзін са спіскаў, які захоўваўся ў Супрасльскім манастыры, праславіўся цудамі і шануецца як Супрасльская ікона Маці Божай;<p>\r\n<strong>Апосталы і дыяканы Прохар, Міканор, Тыман і Пармен<\/strong><p>\r\nАпосталы і дыяканы Прохар, Міканор, Тыман і Пармен належалі да тых дыяканаў, што былі абраныя апосталамі (Дз 6.1-6). Прохар быў біскупам ў Нікамедыі ў Бітыніі і там спакона памёр. Міканор прапаведваў Евангельле і памёр таго самага дня, калі быў укаменаваны сьв. Сцяпан. Пармен паёр на вачах у апосталаў, калі выконваў свае дыяканскія абавязкі.\r\n","<strong>Мучанік Калінік<\/strong><p>\t\nБыў сьвецкім чалавекам. Яму вельмі балела, што шмат людзе ідзе да загібелі з прычына таго, што не знаюць Хрыста. Таму ён хадзіў па гарадах і вёсках, абвяшчаючы Хрыста і шмат людзе ратуючы з паганскага няведаньня праўдзівага Бога. У Анкіры быў пастаўлены перад намесьнікам, адмовіў складаньня ахвяр паганскім бажкам. Быў біты валовымі жыламі, на яго надзелі боты з цьвікамі на падэшве і гналі да Гангра. Там яго спалілі на вогнішчы. Ён памёр, але цела не было пашкоджана. Гэтыя падзеі адбываліся ў часы Дыяклецыяна.","<strong>Апосталы Сіла і Сілуан і інш.<\/strong><p>\nСёньня ўшаноўваем памяць апосталаў Сілы і Сілуана, Крэсцента і Эпінэта з 70 згадкі пра якіх мы можам прачытаць у Дзеях Апосталаў і пасланьнях сьв. Паўла.","<strong>Праведны Еўдакім Кападакійскі<\/strong><p>\nНарадзіўся ад пабожных хрысьціянскіх бацькоў, прыхільных праўдзівай веры. Яны жылі ў Кападокіі і займалі высокае становішчы ў грамадзтве. Еўдакім заставаўся нежанатым праз усё жыцьцё. Быў прывязаны да чытаньня Сьвятога Пісьма, дабрачынства і іншых хрысьціянскім цнот. Памёр у 33 гады."]