package by.carkva_gazeta.resources

/**
 * Created by oleg on 6.12.16.
 */
internal class BibliaParallelChtenia {
    private var res = "+-+"
    fun kniga1(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Пс 88.12-13; 135.5; 145.6; Сир 18.1; Ин 1.3; Деян 14.15; Евр 11.3; Откр 14.7"
                3 -> res = "Пс 32.9"
                6 -> res = "Пс 32.6; 135.5; 148.4; Иер 10.12; 51.15"
                9 -> res = "Пс 32.7; 135.6"
                14 -> res = "Пс 135.7-9"
                16 -> res = "Втор 4.19; Иер 31.35"
                18 -> res = "Пс 103.19-20"
                21 -> res = "Иов 40.20; Пс 103.25"
                22 -> res = "Быт 8.17"
                24 -> res = "Иов 12.7; Сир 16.31"
                26 -> res = "Быт 5.1; Прем 2.23; Сир 17.3"
                27 -> res = "Быт 5.1-2; Мф 19.4; Мк 10.6; 1 Кор 11.7; Кол 3.10"
                28 -> res = "Быт 8.17; 9.1, 7"
                29 -> res = "Быт 9.3"
                31 -> res = "Пс 110.3; Сир 39.21"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Ис 45.12"
                2 -> res = "Исх 20.11; 31.17; Евр 4.4"
                7 -> res = "1 Кор 15.45"
                8 -> res = "Быт 4.16"
                9 -> res = "Откр 2.7; 22.2"
                11 -> res = "Сир 24.27"
                14 -> res = "Дан 10.4"
                17 -> res = "Рим 5.12; 6.23"
                18 -> res = "Еккл 4.8-9"
                22 -> res = "1 Тим 2.13"
                23 -> res = "1 Кор 11.8"
                24 -> res = "Мф 19.5; Мк 10.7-8; 1 Кор 6.16; Еф 5.31"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Прем 2.24"
                4 -> res = "Ин 8.44; 2 Кор 11.3"
                6 -> res = "Сир 25.27; 1 Тим 2.14"
                7 -> res = "Быт 2.25; Откр 3.17"
                8 -> res = "Пс 137.6; Ам 9.2"
                11 -> res = "Быт 2.17"
                13 -> res = "2 Кор 11.3"
                14 -> res = "Пс 71.9"
                15 -> res = "Быт 14.18; Пс 111.1, 2, 4; Зах 6.13; Быт 22.9; Пс 22; Пс 70; Зах 12.10; Ин 3.14"
                16 -> res = "1 Кор 14.34"
                17 -> res = "Быт 4.12; 5.29"
                19 -> res = "Пс 127.2; Еккл 12.7"
                22 -> res = "Быт 1.27; 1 Ин 5.7; Быт 2.9"
            }
        }
        if (glava == 4) {
            when (stih) {
                4 -> res = "Евр 11.4"
                5 -> res = "Притч 15.8; Ис 1.13"
                6 -> res = "Мф 20.15"
                7 -> res = "Рим 6.16"
                8 -> res = "Гал 5.17; Прем 10.3; Мф 23.35; 1 Ин 3.12; Иуд 1.11"
                9 -> res = "Пс 9.13; 115.6"
                10 -> res = "Евр 12.24; Откр 6.10"
                14 -> res = "Быт 9.6"
                19 -> res = "Быт 2.24"
                25 -> res = "Быт 5.3"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "1 Пар 1.1; Быт 1.26-27; 9.6; Прем 2.23; Сир 17.3"
                3 -> res = "Лк 3.38; 1 Кор 15.48-49"
                24 -> res = "Сир 44.15; 49.16; Евр 11.5"
                29 -> res = "1 Пет 3.20; Евр 11.7; Быт 3.17"
                32 -> res = "1 Пар 1.4"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Втор 14.1; 1 Ин 3.1; Мф 24.38"
                3 -> res = "Деян 7.51; Гал 5.16; 1 Пет 3.20"
                5 -> res = "Быт 8.21; Мф 15.19; Мк 7.21"
                6 -> res = "Чис 23.19; 1 Цар 15.11"
                9 -> res = "Сир 44.16"
                13 -> res = "2 Пет 2.5"
                14 -> res = "Евр 11.7"
                17 -> res = "Пс 28.10"
                19 -> res = "Быт 7.9"
                22 -> res = "Быт 7.5"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "1 Пет 3.20"
                5 -> res = "Быт 6.22"
                7 -> res = "Мф 24.38; Лк 17.27; 1 Пет 3.20"
                9 -> res = "Быт 6.19"
                11 -> res = "Иов 38.8; Притч 8.29; 4 Цар 7.2"
                16 -> res = "Быт 6.19-20"
                23 -> res = "Прем 10.4; Мф 24.39"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Пс 111.6"
                2 -> res = "Быт 7.11"
                4 -> res = "Иер 51.27"
                17 -> res = "Быт 1.28; 9.1, 7"
                21 -> res = "Быт 6.5; Мф 15.19; Мк 7.21"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Быт 1.28; 8.17"
                2 -> res = "Быт 1.28"
                4 -> res = "Лев 3.17; 7.26; 17.14"
                6 -> res = "Мф 26.52; Откр 13.10; Быт 1.27"
                7 -> res = "Быт 1.28; 8.17; 9.1"
                11 -> res = "Ис 54.9"
                13 -> res = "Сир 43.12"
                26 -> res = "Нав 16.10; Суд 1.9"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Быт 5.32"
                2 -> res = "1 Пар 1.5"
                4 -> res = "Чис 24.24; Ис 23.1"
                8 -> res = "1 Пар 1.10; Иер 16.16"
                10 -> res = "Ам 6.2"
                14 -> res = "Втор 2.23"
                22 -> res = "1 Пар 1.17"
                25 -> res = "1 Пар 1.19; Быт 11.8"
                30 -> res = "Чис 23.7"
            }
        }
        if (glava == 11) {
            when (stih) {
                4 -> res = "Втор 1.28"
                8 -> res = "Втор 32.8"
                10 -> res = "1 Пар 1.17"
                16 -> res = "1 Пар 1.19"
                26 -> res = "Нав 24.2; 1 Пар 1.26-27"
                31 -> res = "Нав 24.3"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Деян 7.3"
                3 -> res = "Быт 18.18; 22.18; 26.4; Гал 3.8, 16"
                6 -> res = "Быт 18.1; 33.18; 37.12"
                7 -> res = "Быт 13.15; 15.7, 18; 26.3-4; Втор 34.4"
                8 -> res = "Быт 13.3; 28.19"
                13 -> res = "Быт 20.2"
                16 -> res = "Быт 13.2"
                17 -> res = "Пс 104.14"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Пс 104.13"
                2 -> res = "Быт 24.35; Притч 10.22"
                3 -> res = "Быт 12.8; 35.6"
                4 -> res = "Быт 12.7-8"
                6 -> res = "Быт 36.7"
                7 -> res = "Быт 21.25"
                8 -> res = "Пс 33.15; Быт 11.27; 14.12"
                10 -> res = "Быт 2.8; Ис 51.3; Иез 28.13"
                13 -> res = "Быт 18.20; 19.13; Иез 16.49"
                15 -> res = "Быт 12.7; 15.18; 26.4; Втор 34.4"
                16 -> res = "Быт 32.12; Втор 10.22"
                18 -> res = "Чис 13.23"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Быт 10.10; 11.2"
                2 -> res = "Быт 19.22"
                13 -> res = "Быт 17.8; Евр 11.9, 13"
                14 -> res = "Нав 19.47"
                17 -> res = "2 Цар 18.18"
                18 -> res = "Евр 7.1"
                20 -> res = "Евр 7.4"
                24 -> res = "Быт 14.13"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Ис 40.10; 41.10; 43.1"
                2 -> res = "Быт 24.2"
                5 -> res = "Быт 22.17"
                6 -> res = "Рим 4.3; Гал 3.6; Иак 2.23"
                10, 17 -> res = "Иер 34.18"
                13 -> res = "Деян 7.6; Исх 12.40"
                16 -> res = "Исх 12.41"
                18 -> res = "Быт 12.7; 13.15; 26.4; Втор 34.4"
            }
        }
        if (glava == 16) {
            when (stih) {
                14 -> res = "Быт 24.62"
                15 -> res = "Гал 4.22"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Быт 12.7; 24.40; 48.15"
                2 -> res = "Быт 12.2"
                4 -> res = "Сир 44.19-20; Рим 4.17"
                5 -> res = "Ис 51.2"
                6 -> res = "Мф 1.6"
                7 -> res = "Быт 15.18; 4 Цар 13.23; Лев 26.12"
                9 -> res = "Деян 7.8"
                10 -> res = "Лев 12.3; Лк 2.21; Ин 7.22"
                16 -> res = "Гал 4.23; Ис 51.2; Мф 1.6"
                17 -> res = "Быт 18.12; Лк 1.18"
                19 -> res = "Быт 18.10; 21.1-2; Лк 1.55"
                20 -> res = "Быт 25.13-16"
                21 -> res = "Рим 9.9"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "Быт 13.18; 17.1"
                2 -> res = "Евр 13.2"
                4 -> res = "1 Тим 5.10"
                5 -> res = "Пс 103.15"
                6 -> res = "1 Цар 28.24; 3 Цар 17.13"
                10 -> res = "Быт 17.19; 21.1-2; Рим 9.9"
                11 -> res = "Рим 4.19; Евр 11.11"
                12 -> res = "1 Пет 3.6"
                14 -> res = "Иер 32.27; Зах 8.6; Мф 19.26"
                18 -> res = "Быт 12.3; 22.18"
                19 -> res = "Втор 4.9; 6.7"
                20 -> res = "Быт 19.13; Иез 16.48"
                21 -> res = "Быт 11.5"
                25 -> res = "Пс 7.9; Ин 5.27; Деян 17.31"
                27 -> res = "Быт 2.7; Иов 30.19; Еккл 12.7"
                32 -> res = "Иак 5.16"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "Быт 18.2"
                2 -> res = "Евр 13.2; Быт 18.4"
                5 -> res = "Суд 19.22; Рим 1.27"
                7 -> res = "Иез 16.48"
                9 -> res = "2 Пет 2.7-8"
                11 -> res = "Прем 19.16"
                14 -> res = "2 Пар 30.10; Мф 24.38; Лк 17.27-28"
                17 -> res = "Прем 10.6"
                22 -> res = "Исх 32.10; Прем 10.6; Быт 13.10"
                24 -> res = "Втор 29.23; Ис 13.19; Иер 50.40; Иез 16.49; Ам 4.11; Лк 17.29; Иуд 1.7; 2 Пет 2.6"
                26 -> res = "Прем 10.7; Лк 17.32"
                27 -> res = "Быт 18.22"
                32 -> res = "Лев 18.7"
                37 -> res = "Втор 2.9"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "Быт 12.9; 13.18; Евр 11.9"
                2 -> res = "Быт 12.13; 26.1, 9"
                3 -> res = "Пс 104.14"
                4 -> res = "Быт 18.25"
                5 -> res = "Пс 25.6"
                7 -> res = "Пс 104.15; Быт 23.6; Иов 42.8"
                9 -> res = "Быт 26.10"
                12 -> res = "Быт 12.13"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "Быт 17.19; 18.10; Евр 11.11"
                2 -> res = "Гал 4.22"
                3 -> res = "Мф 1.2"
                4 -> res = "Деян 7.8; Быт 17.10-12"
                10 -> res = "Гал 4.30"
                11 -> res = "Быт 17.18"
                12 -> res = "Рим 9.7; Евр 11.18"
                13 -> res = "Быт 16.10; 17.20; 25.16"
                18 -> res = "Быт 17.20"
                21 -> res = "Быт 14.6"
                22 -> res = "Быт 20.2"
                23 -> res = "Быт 26.11"
                25 -> res = "Быт 26.15, 18"
                31 -> res = "Быт 26.33; Нав 15.28; 19.2"
                33 -> res = "Быт 13.4; Ис 57.15"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "Евр 11.17"
                16 -> res = "Пс 104.9; Сир 44.21; 1 Мак 2.52; Лк 1.73; Евр 6.13"
                18 -> res = "Быт 12.3; 18.18; 26.4; Сир 44.22; Деян 3.25; Гал 3.8, 16; Пс 71.17"
            }
        }
        if (glava == 23) {
            if (stih == 16) {
                res = "Быт 25.10; 50.13; Нав 24.3; Деян 7.16"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "Быт 21.5"
                2 -> res = "Быт 47.29"
                3 -> res = "Быт 27.46"
                7 -> res = "Быт 12.7; 13.15; 15.18; 26.3-4"
                15 -> res = "Быт 22.23"
                17 -> res = "Ин 4.7"
                36 -> res = "Быт 21.2; 25.5"
                40 -> res = "Быт 17.1"
                42 -> res = "Быт 24.12"
                62 -> res = "Быт 16.14"
                65 -> res = "1 Пет 3.6"
                67 -> res = "Быт 23.2"
            }
        }
        if (glava == 25) {
            when (stih) {
                2 -> res = "1 Пар 1.32-33"
                5 -> res = "Быт 15.4; 21.10; 24.36"
                8 -> res = "Быт 35.29; Евр 12.23"
                9 -> res = "Быт 49.30-31"
                10 -> res = "Быт 23.16"
                11 -> res = "Быт 16.14; 24.62"
                12 -> res = "Быт 16.15"
                13 -> res = "1 Пар 1.29"
                15 -> res = "Иов 6.19"
                19 -> res = "Быт 21.2; 1 Пар 1.34; Мф 1.2"
                23 -> res = "Рим 9.10-12; Мал 1.2"
                25 -> res = "Быт 27.11"
                26 -> res = "Ос 12.3; Деян 7.8"
                30 -> res = "Быт 36.1, 19"
                33 -> res = "Евр 12.16; Быт 27.36"
            }
        }
        if (glava == 26) {
            when (stih) {
                3 -> res = "Быт 12.7; 13.15; 15.7, 18"
                4 -> res = "Быт 12.3; 18.18; 22.18; 28.13-14; Пс 71.17"
                10 -> res = "Быт 20.9"
                23 -> res = "Быт 46.1"
                24 -> res = "Быт 17.7; Ис 41.10; 43.1"
                26 -> res = "Быт 21.22, 32"
            }
        }
        if (glava == 27) {
            when (stih) {
                1 -> res = "Быт 48.10"
                27, 39 -> res = "Евр 11.20"
                29 -> res = "Чис 22.6; 24.9"
                34, 38 -> res = "Евр 12.17"
                36 -> res = "Быт 25.33"
                40 -> res = "4 Цар 8.20; 2 Пар 21.8"
                41 -> res = "Авд 1.10"
                46 -> res = "Быт 26.34-35"
            }
        }
        if (glava == 28) {
            when (stih) {
                1 -> res = "Быт 24.3"
                2 -> res = "Быт 22.23"
                5 -> res = "Ос 12.12"
                6 -> res = "Быт 26.34"
                9 -> res = "Быт 25.13"
                10 -> res = "Быт 26.23; 27.43"
                11 -> res = "Быт 35.1; 48.3"
                12 -> res = "Ин 1.51"
                13 -> res = "Быт 35.1, 7; 48.3; Сир 44.25"
                14 -> res = "Втор 12.20; 19.8; Быт 26.4"
                15 -> res = "Ис 43.2"
                17 -> res = "Исх 3.5; Нав 5.15"
                18 -> res = "Быт 31.13"
                19 -> res = "Быт 35.6"
                20 -> res = "1 Тим 6.8"
                22 -> res = "Быт 35.7"
            }
        }
        if (glava == 29) {
            when (stih) {
                13 -> res = "Быт 33.4; 45.14"
                14 -> res = "Суд 9.2; 2 Цар 5.1; 19.12"
                20 -> res = "Ос 12.12"
                32 -> res = "Быт 35.23"
                35 -> res = "Мф 1.2"
            }
        }
        if (glava == 30) {
            when (stih) {
                22 -> res = "Быт 25.21"
                43 -> res = "Быт 24.35"
            }
        }
        if (glava == 31) {
            when (stih) {
                13 -> res = "Быт 28.18"
                19 -> res = "1 Цар 19.13"
                29 -> res = "Быт 48.16"
                39 -> res = "Исх 22.12"
                42 -> res = "Быт 28.13; Ис 8.13"
                48 -> res = "Нав 22.27; 24.27"
                53 -> res = "Быт 28.13; Нав 24.2; Быт 26.3; Ис 8.13"
                55 -> res = "Быт 29.11"
            }
        }
        if (glava == 32) {
            when (stih) {
                1 -> res = "Пс 33.8"
                2 -> res = "2 Цар 2.8"
                3 -> res = "Быт 14.6; 36.8; Втор 2.5, 22"
                4 -> res = "Быт 31.38"
                9 -> res = "Быт 28.13; 31.3, 13"
                10 -> res = "2 Цар 7.18"
                12 -> res = "Быт 28.14; Пс 138.18"
                17 -> res = "Быт 33.8"
                20 -> res = "Притч 18.17; 21.14"
                22 -> res = "Чис 21.24; Втор 2.37"
                24 -> res = "Ос 12.3-4"
                28 -> res = "Быт 35.10"
                29 -> res = "Суд 13.18"
                30 -> res = "Суд 8.8; 3 Цар 12.25"
            }
        }
        if (glava == 33) {
            when (stih) {
                8 -> res = "Быт 32.17"
                17 -> res = "Нав 13.27; Суд 8.5"
                19 -> res = "Деян 7.16"
            }
        }
        if (glava == 34) {
            when (stih) {
                1 -> res = "Быт 30.21"
                7 -> res = "Втор 23.17"
                12 -> res = "Исх 22.16"
                14 -> res = "Нав 5.9"
                20, 24 -> res = "Быт 23.10"
                25 -> res = "Быт 49.6"
                30 -> res = "Быт 49.5; Исх 5.21; 1 Цар 13.4"
            }
        }
        if (glava == 35) {
            when (stih) {
                1, 7 -> res = "Быт 28.13"
                2 -> res = "Быт 31.19; Еф 4.22; Кол 3.9"
                4 -> res = "Нав 24.26; Суд 9.6"
                5 -> res = "Исх 23.27; 1 Цар 14.15"
                6 -> res = "Быт 12.8; 28.19"
                8 -> res = "1 Пар 10.12"
                10 -> res = "Быт 32.28"
                11 -> res = "Быт 1.28; 17.1, 6"
                12 -> res = "Быт 12.7"
                13 -> res = "Быт 17.22"
                14 -> res = "Быт 28.18"
                15 -> res = "Быт 28.19"
                17 -> res = "1 Цар 4.20"
                19 -> res = "Быт 48.7"
                20 -> res = "1 Мак 13.27; 1 Цар 10.2"
                21 -> res = "Мих 4.8"
                22 -> res = "Быт 49.4"
                23 -> res = "Быт 46.8; Исх 1.2"
                24 -> res = "Быт 30.23"
                25 -> res = "Быт 30.5"
                26 -> res = "Быт 30.9"
                27 -> res = "Быт 23.2; 14.13"
                29 -> res = "Быт 25.9"
            }
        }
        if (glava == 36) {
            when (stih) {
                1 -> res = "Быт 25.30"
                2 -> res = "Быт 26.34"
                3 -> res = "Быт 28.9"
                4, 10 -> res = "1 Пар 1.35"
                6 -> res = "Нав 24.4; Быт 32.3"
                7 -> res = "Быт 13.6; 26.14"
                8 -> res = "Нав 24.4"
                20 -> res = "Втор 2.11-12; 1 Пар 1.38"
                23 -> res = "1 Пар 1.40 "
                33 -> res = "Ис 34.6; 63.1"
                37 -> res = "Быт 10.11"
                38 -> res = "1 Пар 1.49"
                40 -> res = "1 Пар 1.51"
            }
        }
        if (glava == 37) {
            when (stih) {
                1 -> res = "Быт 35.27; 36.6; Евр 11.13"
                4 -> res = "Деян 7.9"
                11 -> res = "Дан 7.28; Лк 2.19, 51"
                14 -> res = "1 Цар 17.18; Быт 23.2"
                17 -> res = "4 Цар 6.13"
                20 -> res = "Мф 21.38; Пс 40.8"
                21, 22 -> res = "Быт 42.22"
                24 -> res = "Зах 9.11"
                25 -> res = "Быт 31.21; Иер 8.22; 22.6"
                26 -> res = "Иов 16.18"
                28 -> res = "Суд 8.26; Прем 10.13; Пс 104.17"
                29 -> res = "Быт 44.13; Лев 10.6; Чис 14.6"
                33 -> res = "Быт 44.28"
                34 -> res = "1 Цар 4.12; 2 Цар 3.31; 3 Цар 20.32"
                35 -> res = "Тов 10.7; Быт 42.38"
                36 -> res = "Быт 39.1; Пс 104.17"
            }
        }
        if (glava == 38) {
            when (stih) {
                3 -> res = "Быт 46.12; Чис 26.19; 1 Пар 2.3"
                5 -> res = "Чис 26.20"
                7 -> res = "Чис 26.19"
                8 -> res = "Втор 25.5; Мф 22.24; Мк 12.19"
                11 -> res = "Тов 7.11"
                12 -> res = "1 Цар 25.2"
                14 -> res = "Притч 9.14; Иер 3.2"
                15 -> res = "Притч 7.12"
                16 -> res = "Лев 18.15; 20.12"
                24 -> res = "Быт 20.3; Лев 21.9; Втор 22.22"
                27 -> res = "1 Пар 2.4; Мф 1.3 "
                29 -> res = "Быт 46.12; 1 Пар 4.1"
            }
        }
        if (glava == 39) {
            when (stih) {
                1 -> res = "Пс 104.17; Деян 7.9"
                2 -> res = "Деян 7.9"
                3 -> res = "Быт 21.22; Пс 1.3"
                5 -> res = "Быт 30.27; Ис 45.4"
                7 -> res = "Иов 31.1; Притч 7.5; 2 Пет 2.14"
                9 -> res = "Иов 24.15; Сир 23.27; Ис 29.15"
                12 -> res = "2 Цар 13.11"
                14 -> res = "Сир 25.19"
                20 -> res = "Пс 104.18"
                21 -> res = "Прем 10.14; Деян 7.10"
                23 -> res = "Быт 39.3; Пс 1.3"
            }
        }
        if (glava == 40) {
            when (stih) {
                3 -> res = "Быт 39.20"
                5 -> res = "Дан 2.1, 29; Мф 27.19"
                6 -> res = "Быт 41.8"
                8 -> res = "Быт 41.16; Дан 2.27-28"
                12 -> res = "Быт 41.25"
                14 -> res = "Неем 5.19; 13.31; Лк 23.42"
                15 -> res = "Быт 37.28"
                19 -> res = "Быт 41.13"
                20 -> res = "Мк 6.21"
                22 -> res = "Быт 40.19"
                23 -> res = "Ам 6.6"
            }
        }
        if (glava == 41) {
            when (stih) {
                1 -> res = "Дан 2.1"
                6 -> res = "Иез 17.10"
                8 -> res = "Быт 40.7; Дан 2.3; Исх 7.11"
                10 -> res = "Быт 40.3"
                11 -> res = "Быт 40.8"
                13 -> res = "Быт 40.19"
                14 -> res = "Пс 104.20"
                16 -> res = "Дан 2.30; Мф 10.20; 1 Кор 15.10"
                21 -> res = "Быт 41.4"
                25 -> res = "Быт 40.12"
                30 -> res = "4 Цар 8.1"
                40 -> res = "Пс 104.21; 1 Мак 2.53; Деян 7.10"
                41 -> res = "Прем 10.14"
                42 -> res = "Есф 3.10; Иез 16.11; Дан 5.29"
                46 -> res = "Быт 37.2"
                50 -> res = "Быт 46.20; 48.5, 20"
                54 -> res = "Пс 104.16"
                55 -> res = "Ин 2.5"
                56 -> res = "Быт 42.6"
                57 -> res = "Быт 12.10"
            }
        }
        if (glava == 42) {
            when (stih) {
                1 -> res = "Деян 7.12"
                4 -> res = "Быт 43.5"
                6 -> res = "Быт 37.7, 9; 41.40, 56"
                7 -> res = "Быт 43.7; 44.19"
                9 -> res = "Быт 37.5, 9"
                13 -> res = "Быт 37.33; 44.20"
                15 -> res = "Быт 43.5; 44.23"
                20 -> res = "Быт 43.8"
                21 -> res = "Быт 37.25"
                22 -> res = "Быт 37.21-22"
                35 -> res = "Быт 43.18, 21; 44.1"
                36 -> res = "Быт 37.33"
                37 -> res = "Быт 46.9"
                38 -> res = "Быт 37.35; 44.29-31"
            }
        }
        if (glava == 43) {
            when (stih) {
                2 -> res = "Быт 44.25"
                3 -> res = "Быт 42.20"
                5 -> res = "Быт 42.4, 15"
                7 -> res = "Быт 42.7; 44.19"
                9 -> res = "Быт 44.32"
                14 -> res = "Быт 42.24; Руфь 1.8; 2 Цар 2.6"
                21 -> res = "Быт 42.27"
                23 -> res = "Быт 42.25"
                24 -> res = "Быт 18.4; 19.2; Лк 7.44"
                26 -> res = "Быт 37.7, 9"
                29 -> res = "Быт 42.13"
                30 -> res = "Быт 45.2"
                32 -> res = "Исх 8.26; Тов 1.11; Дан 1.8"
                34 -> res = "Пс 103.15; Песн 5.1; Агг 1.6"
            }
        }
        if (glava == 44) {
            when (stih) {
                4 -> res = "Пс 37.21"
                9 -> res = "Быт 31.32"
                13 -> res = "Быт 37.29"
                19 -> res = "Быт 43.7"
                20 -> res = "Быт 42.13"
                23 -> res = "Быт 43.5"
                25 -> res = "Быт 43.2"
                28 -> res = "Быт 37.33"
                29 -> res = "Быт 42.38"
                31 -> res = "Быт 37.35"
                32 -> res = "Быт 43.9"
            }
        }
        if (glava == 45) {
            when (stih) {
                1 -> res = "Деян 7.13; Быт 42.7"
                4 -> res = "Деян 7.13"
                5 -> res = "Быт 50.20"
                8 -> res = "Прем 10.14; Быт 50.20"
                9, 21 -> res = "Деян 7.14"
                10 -> res = "Быт 46.28"
                14 -> res = "Быт 33.4; 46.29"
                15 -> res = "Исх 4.27"
                18 -> res = "Быт 47.6, 11; Пс 144.14; 147.3 "
                28 -> res = "Быт 46.30"
            }
        }
        if (glava == 46) {
            when (stih) {
                1 -> res = "Исх 1.1; Чис 20.15; Втор 10.22"
                4 -> res = "Быт 50.1"
                5 -> res = "Деян 7.15"
                6 -> res = "Нав 24.4; Пс 104.23; Ис 52.4"
                8 -> res = "Исх 1.1-2; 6.14; Чис 26.5; 1 Пар 5.1, 3"
                10 -> res = "1 Пар 4.24"
                11 -> res = "1 Пар 6.1; Исх 6.16; Чис 3.17"
                12 -> res = "Быт 38.2-3; 1 Пар 2.3; 4.1"
                13 -> res = "1 Пар 7.1"
                14 -> res = "Чис 26.26"
                16 -> res = "Чис 26.15"
                17 -> res = "1 Пар 7.30"
                20 -> res = "Быт 41.50-52"
                21 -> res = "1 Пар 7.6; 8.1"
                23 -> res = "Чис 26.42"
                24 -> res = "Чис 26.48; 1 Пар 7.13"
                27 -> res = "Исх 1.5; Втор 10.22; Деян 7.14"
                29 -> res = "Быт 33.4; 45.14"
                30 -> res = "Быт 45.28; Лк 2.29-30"
                31 -> res = "Быт 47.1"
                34 -> res = "Быт 47.6, 27; 43.32"
            }
        }
        if (glava == 47) {
            when (stih) {
                1 -> res = "Быт 46.31; Деян 7.14-15"
                3 -> res = "Быт 46.33-34"
                6 -> res = "Быт 34.10"
                9 -> res = "Пс 118.19; Евр 11.13; 13.14"
                11 -> res = "Исх 1.11"
                12 -> res = "Сир 49.17"
                27 -> res = "Исх 5.5; Пс 104.24"
                29 -> res = "Быт 24.2; 50.5"
                30 -> res = "Быт 23.19; 50.13"
                31 -> res = "Быт 50.5; Евр 11.21"
            }
        }
        if (glava == 48) {
            when (stih) {
                3 -> res = "Быт 28.13"
                4 -> res = "Быт 13.16; 35.11-12; 41.52"
                5 -> res = "Быт 41.50-52"
                7 -> res = "Быт 35.19"
                9 -> res = "Быт 33.5; 27.4"
                10 -> res = "Быт 27.1; 1 Цар 3.2; 4.15"
                14 -> res = "Мф 19.15; Евр 11.21"
                16 -> res = "Быт 31.29"
                19 -> res = "Втор 33.16"
                20 -> res = "Руфь 4.11; Втор 33.17; Иер 31.20"
                22 -> res = "Нав 24.32; Ин 4.5"
            }
        }
        if (glava == 49) {
            when (stih) {
                1 -> res = "Втор 33.1"
                3 -> res = "Быт 29.32; Втор 21.17"
                4 -> res = "Быт 35.22; 1 Пар 5.1"
                5 -> res = "Быт 34.25; Иудифь 9.2"
                6 -> res = "Быт 34.26"
                7 -> res = "Нав 19.1; 21.3"
                8 -> res = "1 Пар 4.27, 38, 41"
                9 -> res = "Чис 24.9"
                10 -> res = "1 Пар 5.2; Ин 1.45; 5.46; Мф 2.6"
                11 -> res = "Ис 63.1-2"
                12 -> res = "Откр 1.14"
                13 -> res = "Нав 19.10"
                14 -> res = "Суд 5.15"
                15 -> res = "Втор 33.18"
                16 -> res = "Суд 13.25"
                17 -> res = "Суд 18.1"
                18 -> res = "Пс 118.166; Лк 2.30"
                19 -> res = "Чис 32.17"
                20 -> res = "Втор 33.24"
                21 -> res = "Суд 4.6"
                22 -> res = "Быт 48.16"
                24 -> res = "Втор 33.17"
                26 -> res = "Втор 33.16"
                27 -> res = "Суд 20.21, 25, 31"
                28 -> res = "Сир 44.26"
                29 -> res = "Быт 25.8; 47.30"
                30 -> res = "Быт 23.16-17; 50.13; Деян 7.16"
                31 -> res = "Быт 25.9; 35.29"
                33 -> res = "Деян 7.15"
            }
        }
        if (glava == 50) {
            when (stih) {
                1 -> res = "Быт 46.4"
                5 -> res = "Быт 47.29"
                10 -> res = "Сир 22.11"
                13 -> res = "Деян 7.16; Быт 23.17"
                17 -> res = "Быт 26.24; 31.42"
                20 -> res = "Быт 45.5"
                22 -> res = "Быт 41.46"
                23 -> res = "Чис 32.39"
                24 -> res = "Евр 11.22"
                25 -> res = "Исх 13.19; Нав 24.32"
            }
        }
        return res
    }

    fun kniga2(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Быт 46.8; Деян 7.15"
                2 -> res = "Быт 46.8; Исх 6.14"
                6 -> res = "Быт 50.26"
                7 -> res = "Деян 7.17; Пс 104.24"
                12 -> res = "Пс 104.24"
                13 -> res = "Втор 26.6; Иудифь 5.11"
                16 -> res = "Прем 18.5"
                21 -> res = "1 Цар 2.35"
                22 -> res = "Прем 18.5; Деян 7.19"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Исх 6.20; Чис 26.59; 1 Пар 23.13; Деян 7.20; Евр 11.23"
                3 -> res = "Прем 18.5"
                5 -> res = "Деян 7.21"
                11 -> res = "Евр 11.24-25"
                12 -> res = "Деян 7.24"
                14 -> res = "Деян 7.27"
                15 -> res = "Деян 7.29; Быт 29.2"
                17 -> res = "Быт 24.13; 29.8, 10"
                18 -> res = "Чис 10.29"
                21 -> res = "Исх 18.2; Чис 12.1"
                22 -> res = "Исх 18.3; 1 Пар 23.15; Деян 7.29"
                23 -> res = "Исх 7.7"
                24 -> res = "Быт 15.16; Лев 26.42"
            }
        }
        if (glava == 3) {
            when (stih) {
                2 -> res = "Деян 7.30"
                4 -> res = "Сир 45.5"
                5 -> res = "Нав 5.15"
                6 -> res = "Мф 22.32; Мк 12.26; Лк 20.37"
                7 -> res = "Чис 20.16"
                10 -> res = "Пс 104.26"
                14 -> res = "Откр 1.4, 8"
                15 -> res = "Ис 42.8; Ос 12.5; Пс 101.13"
                18 -> res = "Исх 5.1, 3; 8.1, 27"
                20 -> res = "Прем 10.15; Пс 104.27"
                21 -> res = "Исх 11.3"
                22 -> res = "Исх 12.35"
            }
        }
        if (glava == 4) {
            when (stih) {
                3 -> res = "Исх 7.10, 15"
                5 -> res = "Исх 3.6, 15-16; 3 Цар 18.36"
                6 -> res = "Чис 12.10"
                9 -> res = "Исх 7.17, 19; Пс 77.44"
                10 -> res = "Исх 6.12; Ис 6.5"
                11 -> res = "Пс 93.9"
                12 -> res = "Мф 10.19-20; Лк 21.15"
                15 -> res = "Исх 7.2; Сир 45.3"
                17 -> res = "Исх 4.3"
                18 -> res = "Быт 30.25"
                19 -> res = "Быт 31.3; Мф 2.20"
                21 -> res = "Рим 9.18"
                22 -> res = "Иер 31.9"
                23 -> res = "Исх 11.5; 12.29"
                25 -> res = "Нав 5.2-3"
                27 -> res = "Исх 3.1"
                29 -> res = "Нав 24.5; Пс 104.26"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Исх 7.16; 8.1, 20"
                2 -> res = "Иов 21.15; Пс 11.5; Дан 3.15"
                3 -> res = "Исх 3.18"
                5 -> res = "Исх 1.7"
                21 -> res = "Быт 34.30; 1 Цар 13.4"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Исх 11.1; 12.33; 13.3"
                2 -> res = "Исх 15.3"
                3 -> res = "Быт 17.1; 26.24; 28.13"
                5 -> res = "Исх 2.24; Лев 26.42"
                7 -> res = "Быт 17.7"
                8 -> res = "Иез 47.14"
                12 -> res = "Исх 4.10; Ис 6.5"
                14 -> res = "Быт 46.9; Чис 26.5; 1 Пар 5.1, 3"
                15 -> res = "1 Пар 4.24"
                16 -> res = "1 Пар 6.1; 23.6; Чис 3.17; 26.57"
                17 -> res = "Чис 3.18; 1 Пар 6.17; 23.7"
                18 -> res = "Чис 3.19"
                19 -> res = "Чис 26.57"
                20 -> res = "Исх 2.1-2; Чис 26.59; 1 Пар 6.3; 23.13; Деян 7.20; Евр 11.23"
                21 -> res = "Чис 16.1"
                22 -> res = "Лев 10.4"
                23 -> res = "Чис 3.2"
                24 -> res = "1 Пар 6.22"
                25 -> res = "Чис 25.7; 1 Пар 6.4"
                26 -> res = "Деян 7.37"
                30 -> res = "Исх 4.10; 6.12"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Исх 4.15-16"
                3 -> res = "Исх 4.21; 14.4"
                4 -> res = "Исх 6.6; 8.15, 19"
                6 -> res = "Нав 24.5"
                8 -> res = "Исх 9.8; 12.1; Втор 4.33"
                9 -> res = "Пс 104.27"
                10 -> res = "Исх 4.3"
                11 -> res = "2 Тим 3.8"
                13 -> res = "1 Цар 6.6; Исх 4.21"
                14 -> res = "1 Цар 6.6"
                16 -> res = "Исх 5.1; 8.1, 20"
                17 -> res = "Исх 4.9"
                19 -> res = "Исх 8.5"
                20 -> res = "Исх 17.5; Пс 77.44"
                22 -> res = "Прем 17.7"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Исх 5.1; 7.16"
                5 -> res = "Исх 7.19"
                6 -> res = "Пс 77.45; 104.30"
                7 -> res = "Прем 17.7"
                8 -> res = "Исх 10.16; 3 Цар 13.6"
                10 -> res = "Исх 9.14; 15.11"
                15 -> res = "Рим 2.4-5; Исх 4.21"
                17 -> res = "Пс 104.31"
                19 -> res = "Пс 63.10; Мф 12.28; Лк 11.20"
                22 -> res = "Исх 9.26"
                24 -> res = "Пс 104.31; Прем 16.9"
                26 -> res = "Быт 43.32; 46.34"
                27 -> res = "Исх 3.18"
                28 -> res = "2 Цар 13.6; Деян 8.24"
                31 -> res = "Исх 10.19; 14.28"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Исх 5.1; 7.16; 10.3"
                3 -> res = "Втор 2.15; Пс 77.50"
                7 -> res = "Исх 7.14; 8.15, 32"
                8 -> res = "Исх 7.8"
                11 -> res = "Прем 17.7"
                12 -> res = "Исх 4.21; 8.15"
                16 -> res = "Рим 9.17"
                23 -> res = "Пс 77.47-48; 104.32; Прем 16.16; 19.19"
                27 -> res = "Исх 10.16; Плач 1.18"
                29 -> res = "Пс 23.1"
            }
        }
        if (glava == 10) {
            when (stih) {
                2 -> res = "Исх 12.26"
                3 -> res = "Исх 9.1"
                4 -> res = "Пс 104.34"
                12 -> res = "Исх 9.32"
                13 -> res = "Исх 14.21; Чис 11.31"
                14 -> res = "Пс 77.46"
                15 -> res = "Пс 104.35"
                16 -> res = "Исх 8.25; 9.27"
                19 -> res = "Исх 8.31"
                20 -> res = "Исх 11.10"
                21 -> res = "Ис 50.3"
                22 -> res = "Пс 104.28"
                23 -> res = "Прем 17.5; 18.1"
                24 -> res = "Исх 8.8"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Исх 6.1; 12.33; Пс 104.38"
                3 -> res = "Исх 3.21; 12.36; Сир 45.1"
                5 -> res = "Пс 77.51; 104.36; Прем 18.5"
                10 -> res = "Исх 9.16; 10.20; Рим 9.17"
            }
        }
        if (glava == 12) {
            when (stih) {
                2 -> res = "Чис 9.1; Исх 13.4; Нав 4.19"
                3 -> res = "Ин 1.29; 1 Кор 5.7"
                6 -> res = "Исх 16.12; Лев 23.5; Втор 16.6"
                8 -> res = "Чис 9.11"
                9 -> res = "Втор 16.7"
                10 -> res = "Исх 23.18; 34.25"
                11 -> res = "Лк 12.35; Еф 6.14; 1 Пет 1.13"
                12 -> res = "Пс 135.10; Евр 11.28; Чис 33.4"
                14 -> res = "Рим 10.4"
                15 -> res = "Исх 23.15; 34.18"
                18 -> res = "Иез 45.21; Лев 23.5; Чис 28.16"
                20 -> res = "Втор 16.4; 1 Кор 5.8"
                23 -> res = "Евр 11.28"
                26 -> res = "Исх 10.2; 13.8; Втор 6.20"
                27 -> res = "1 Кор 11.26"
                29 -> res = "Пс 77.51; 104.36; 134.8; 135.10; Прем 18.5"
                35 -> res = "Исх 3.22"
                36 -> res = "Исх 3.21; Пс 104.37"
                37 -> res = "Чис 33.3; Нав 24.6; Пс 135.11-12"
                40 -> res = "Быт 15.13"
                43 -> res = "Исх 7.8; 2 Кор 6.16; Еф 2.12"
                45 -> res = "Гал 4.7"
                46 -> res = "Чис 9.12; Ин 19.36"
                48 -> res = "1 Кор 11.28"
                49 -> res = "Лев 24.22; Гал 3.28"
            }
        }
        if (glava == 13) {
            when (stih) {
                2 -> res = "Исх 22.29; 34.19; Лев 27.26; Чис 3.13; 8.17; Лк 2.23"
                3 -> res = "Исх 23.15"
                5 -> res = "Быт 15.7, 18-21; 17.8"
                7 -> res = "1 Кор 5.8"
                8, 14 -> res = "Исх 12.26"
                9 -> res = "Втор 6.8; 11.18"
                10 -> res = "Исх 12.14"
                11 -> res = "Быт 15.18"
                12 -> res = "Исх 13.2"
                13 -> res = "Исх 34.20; Чис 3.46"
                15 -> res = "Исх 4.23; 12.29"
                16 -> res = "Втор 6.8"
                17 -> res = "1 Кор 10.13"
                18 -> res = "Пс 77.52-53"
                19 -> res = "Быт 50.25; Нав 24.32"
                20 -> res = "Чис 33.6"
                21 -> res = "Исх 14.19; Чис 14.14; Втор 1.33; 4.37; Пс 77.14; 104.39; Неем 9.19"
            }
        }
        if (glava == 14) {
            when (stih) {
                2 -> res = "Чис 33.7; Иер 44.1"
                4 -> res = "Исх 4.21; 10.20; Иез 28.22; Рим 9.17"
                8 -> res = "Прем 19.3; Исх 13.3"
                9 -> res = "Нав 24.6; 1 Мак 4.9"
                11 -> res = "Пс 105.7"
                13 -> res = "2 Пар 20.17"
                14 -> res = "Втор 1.30; 3.22; Суд 5.20"
                15 -> res = "Нав 24.7"
                19 -> res = "Исх 13.21"
                21 -> res = "Пс 77.13; 105.9; 113.3; Нав 4.23"
                22 -> res = "1 Кор 10.1; Евр 11.29; Иудифь 5.13"
                24 -> res = "Пс 77.14"
                25 -> res = "Втор 3.22"
                27 -> res = "Прем 18.5; 19.5; Исх 15.7"
                28 -> res = "Пс 105.11; 135.15"
                31 -> res = "Пс 105.12; 108.27; 2 Пар 20.20"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Пс 105.12"
                2 -> res = "Пс 117.6-7; Ис 12.2"
                3 -> res = "Суд 20.35; Исх 3.14; Ос 12.5"
                5 -> res = "Неем 9.11; Откр 18.21"
                6 -> res = "Пс 117.15"
                7 -> res = "Исх 14.27; Ис 5.24; 47.14"
                8 -> res = "Ис 63.12-13"
                9 -> res = "Исх 14.3, 9"
                10 -> res = "Пс 73.13"
                11 -> res = "Исх 18.11; 1 Цар 2.2; Пс 39.6"
                13 -> res = "Пс 76.21"
                14 -> res = "Нав 2.9"
                16 -> res = "Втор 4.37"
                17 -> res = "Пс 43.2-3; 79.9"
                18 -> res = "Пс 88.19"
                19 -> res = "Исх 14.22"
                20 -> res = "Пс 67.26"
                22 -> res = "Быт 16.7; Чис 33.8"
                25 -> res = "Сир 38.5"
                26 -> res = "Исх 23.25; Втор 7.15; Ис 3.7"
                27 -> res = "Чис 33.9"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Чис 33.11; Прем 11.2; Деян 7.36; 13.18"
                2 -> res = "Исх 15.24; Пс 105.13; 1 Кор 10.10"
                4 -> res = "Пс 77.25; 104.40; Прем 16.20"
                7 -> res = "1 Кор 10.10; Чис 16.11"
                8 -> res = "Чис 11.18"
                10 -> res = "Сир 45.3"
                12 -> res = "Исх 12.6; Чис 11.7"
                13 -> res = "Прем 16.2; Чис 11.31; Пс 77.27; 104.40"
                14 -> res = "Чис 11.7"
                15 -> res = "Пс 77.24; Прем 16.20; Ин 6.31; 1 Кор 10.3"
                18 -> res = "2 Кор 8.15"
                23 -> res = "Быт 2.2"
                26 -> res = "Чис 11.6"
                29 -> res = "Быт 2.2-3"
                31 -> res = "Чис 11.7; Прем 16.20"
                33 -> res = "Евр 9.4"
                35 -> res = "Нав 5.12; Неем 9.15"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Чис 33.14"
                2 -> res = "Чис 20.2-3; Втор 9.7"
                3 -> res = "Исх 14.11"
                4 -> res = "Чис 14.10"
                5 -> res = "Исх 7.20"
                6 -> res = "Чис 20.11; Пс 77.16; 104.41; Прем 11.4; 1 Кор 10.4"
                8 -> res = "Втор 25.17; Прем 11.3"
                9 -> res = "Нав 1.1"
                10 -> res = "Исх 24.14; 31.2"
                11 -> res = "Нав 8.18"
                13 -> res = "Суд 4.23; Прем 11.3"
                14 -> res = "Исх 34.27; Чис 24.20; Втор 25.17, 19"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "Исх 2.16"
                2 -> res = "Исх 2.21; 4.20"
                3 -> res = "Исх 2.22"
                4 -> res = "Исх 2.15"
                5 -> res = "Исх 3.1"
                6 -> res = "Чис 10.29"
                11 -> res = "Исх 1.13; 15.11; 1 Пар 17.25"
                12 -> res = "Втор 12.7"
                18 -> res = "Втор 1.9"
                21 -> res = "Чис 11.16; Втор 1.13; 2 Пар 19.5-6"
                25 -> res = "Чис 11.16; Втор 1.15; 1 Пар 27.1"
                26 -> res = "Втор 1.17"
                27 -> res = "Чис 10.30"
            }
        }
        if (glava == 19) {
            when (stih) {
                2 -> res = "Чис 33.15"
                3, 19 -> res = "Деян 7.38"
                4 -> res = "Втор 29.2"
                5 -> res = "Втор 5.2; Пс 23.1"
                6 -> res = "1 Пет 2.9"
                8 -> res = "Втор 5.27; 26.17; Исх 20.18; 24.16; Чис 9.15"
                10 -> res = "Лев 11.45; Нав 3.5; 1 Цар 16.5"
                12 -> res = "Евр 12.20"
                14 -> res = "Нав 3.5"
                15 -> res = "1 Цар 21.4; 1 Кор 7.5"
                16 -> res = "Втор 5.4"
                17 -> res = "Втор 4.10"
                18 -> res = "Втор 4.11; Суд 5.4-5; Евр 12.18"
                20 -> res = "3 Цар 19.8"
                21 -> res = "Исх 33.20; Суд 6.22; 1 Кор 10.8"
                22 -> res = "Лев 10.3"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "Втор 4.13"
                2 -> res = "Втор 5.6; Пс 80.11"
                3 -> res = "Втор 5.7"
                4 -> res = "Лев 26.1; Втор 5.8; Пс 96.7"
                5 -> res = "Чис 14.18; Втор 5.9"
                6 -> res = "Исх 34.7; Втор 5.10"
                7 -> res = "Лев 19.12; Втор 5.11; Мф 5.33"
                8 -> res = "Исх 31.13; Втор 5.12; Иез 20.12"
                9 -> res = "Лев 23.3; Втор 5.13"
                10 -> res = "Втор 5.14; Мф 12.2"
                11 -> res = "Быт 2.2; Исх 31.17; Евр 4.4"
                12 -> res = "Втор 5.16; Мф 15.4; Мк 7.10; Еф 6.2-3; Сир 3.8"
                13 -> res = "Втор 5.17; Мф 5.21; 19.18; Мк 10.19; Рим 13.9"
                14 -> res = "Втор 5.18; Мф 5.27"
                15 -> res = "Втор 5.19"
                16 -> res = "Втор 5.20"
                17 -> res = "Втор 5.21; Рим 7.7; 13.9"
                18 -> res = "Евр 12.19"
                19 -> res = "Втор 18.16; Евр 12.19-20"
                20 -> res = "Быт 22.1"
                21 -> res = "3 Цар 8.12; Евр 12.18"
                23 -> res = "Исх 34.17"
                24 -> res = "Исх 27.8; Втор 12.11"
                25 -> res = "Втор 27.5; Нав 8.31"
                26 -> res = "Исх 28.42"
            }
        }
        if (glava == 21) {
            when (stih) {
                2 -> res = "Втор 15.12; Иер 34.14"
                4 -> res = "Лев 25.44; Быт 21.10; Гал 4.24"
                5 -> res = "Втор 15.16"
                6 -> res = "Лев 25.39-41"
                9 -> res = "Исх 22.16"
                12 -> res = "Лев 24.17"
                13 -> res = "Втор 19.2"
                14 -> res = "Втор 19.11; 3 Цар 2.29, 31"
                17 -> res = "Лев 20.9; Притч 20.20; Мф 15.4; Мк 7.10"
                19 -> res = "2 Цар 3.29"
                20 -> res = "Лев 25.39"
                24 -> res = "Лев 24.20; Втор 19.21; Мф 5.38"
                28 -> res = "Быт 9.5"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "2 Цар 12.6"
                8 -> res = "Исх 21.6; Пс 81.1, 6; Ин 10.35"
                12 -> res = "Быт 31.39"
                16 -> res = "Втор 22.28"
                18 -> res = "Лев 19.31; 20.27; Втор 18.11"
                20 -> res = "Втор 13.13, 15"
                21 -> res = "Исх 23.9; Лев 19.33-34"
                22 -> res = "Зах 7.10"
                25 -> res = "Лев 25.36; Пс 14.5; Иез 18.8"
                26 -> res = "Втор 24.12"
                28 -> res = "Деян 23.5"
                29 -> res = "Иез 44.30; Исх 13.2; Лк 2.23"
                31 -> res = "Лев 22.8; Иез 44.31"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "Лев 19.11"
                3 -> res = "Лев 19.15"
                4 -> res = "Втор 22.1"
                5 -> res = "Лк 14.5"
                6 -> res = "Втор 16.19; Ис 10.1-2"
                7 -> res = "Дан 13.62"
                8 -> res = "Втор 16.19; Сир 20.29"
                9 -> res = "Втор 10.19; Быт 46.5; Исх 22.21"
                10 -> res = "Лев 25.3"
                12 -> res = "Исх 20.9; Лев 23.3"
                13 -> res = "Втор 27.1; Исх 20.3; Нав 23.7"
                15 -> res = "Исх 13.3; Сир 35.4"
                16 -> res = "Лев 23.34"
                17 -> res = "Исх 34.23; Втор 16.16"
                19 -> res = "Исх 34.26; Втор 14.21"
                20 -> res = "Исх 13.21; 14.19"
                21 -> res = "Ис 63.10; Иер 23.6; Ин 10.30"
                22 -> res = "Втор 18.15; Быт 12.3"
                23 -> res = "Исх 33.2; Втор 7.1; Нав 24.11"
                24 -> res = "Исх 20.5; Быт 35.2"
                25 -> res = "Мф 6.33; Исх 15.26"
                26 -> res = "Втор 7.14"
                27 -> res = "Быт 35.5"
                28 -> res = "Втор 7.20; Нав 24.12"
                31 -> res = "Быт 15.18; 28.14; Чис 34.2"
                32 -> res = "Исх 34.15; Втор 7.2"
                33 -> res = "Исх 34.12"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "Исх 18.25"
                3 -> res = "Ин 7.19"
                4 -> res = "Быт 31.45"
                5 -> res = "Чис 3.41"
                7 -> res = "Тов 5.1"
                8 -> res = "Евр 9.19-20"
                10 -> res = "Исх 33.20; Иез 1.26; 10.1"
                11 -> res = "Исх 19.12; 33.22"
                14 -> res = "Исх 31.2; 35.30"
                16 -> res = "Исх 19.9; 3 Цар 8.10-11; 2 Пар 7.1"
                17 -> res = "Втор 4.24; 9.3; Евр 12.29"
                18 -> res = "Исх 34.28; Втор 9.9, 18"
            }
        }
        if (glava == 25) {
            when (stih) {
                2 -> res = "Исх 35.5"
                9 -> res = "Исх 26.30"
                16 -> res = "Исх 16.34; Евр 9.4"
                17 -> res = "Исх 37.6"
                20 -> res = "Евр 9.5"
                21 -> res = "Исх 26.34; Втор 10.2"
                22 -> res = "Исх 29.42"
                23 -> res = "Исх 35.13; Евр 9.2"
                30 -> res = "Лев 24.6; 1 Цар 21.6; 3 Цар 7.48"
                31 -> res = "Исх 35.14; Чис 8.4"
                33 -> res = "Зах 4.2"
                37 -> res = "Чис 8.2"
                40 -> res = "Деян 7.44; Евр 8.5"
            }
        }
        if (glava == 26) {
            when (stih) {
                1 -> res = "Исх 36.8; 2 Цар 7.6"
                7 -> res = "Исх 36.14"
                10 -> res = "Исх 36.12"
                11 -> res = "Исх 36.18"
                14 -> res = "Исх 36.19"
                15 -> res = "Исх 36.20"
                30 -> res = "Исх 25.9"
                33 -> res = "Исх 40.3; Евр 9.3"
                34 -> res = "Исх 25.21; Евр 9.4"
                35 -> res = "Исх 40.22; Евр 9.2"
            }
        }
        if (glava == 27) {
            when (stih) {
                1 -> res = "Исх 35.16"
                2 -> res = "3 Цар 1.50"
                9 -> res = "Исх 38.9"
                16 -> res = "Исх 35.17"
                20 -> res = "Чис 8.2"
                21 -> res = "Лев 6.18; 24.3; 1 Цар 3.3"
            }
        }
        if (glava == 28) {
            when (stih) {
                1 -> res = "Евр 5.4; Исх 6.23"
                2 -> res = "Исх 31.10"
                3 -> res = "Исх 31.3"
                17 -> res = "Прем 18.24; Откр 21.19"
                25 -> res = "Исх 28.7"
                30 -> res = "Лев 8.8; Чис 27.21"
                35 -> res = "Сир 45.11"
                41 -> res = "Лев 8.30; Суд 17.5"
            }
        }
        if (glava == 29) {
            when (stih) {
                1 -> res = "Лев 9.2"
                4 -> res = "Исх 30.20; 40.12"
                9 -> res = "Исх 28.41"
                10 -> res = "Лев 1.3"
                13 -> res = "Лев 3.3"
                14 -> res = "Лев 4.12; Чис 19.5; Евр 13.11"
                15 -> res = "Лев 8.18"
                16 -> res = "Евр 9.12, 19"
                19 -> res = "Лев 1.4"
                21 -> res = "Исх 30.30"
                22 -> res = "Лев 3.3; 7.37"
                24 -> res = "Исх 35.22"
                26 -> res = "Лев 8.29"
                28 -> res = "Исх 27.21"
                32 -> res = "Лев 8.31; 24.9; Мф 12.4; Мк 2.26; Лк 6.4"
                38 -> res = "Чис 28.3"
                39 -> res = "Чис 28.4"
                43 -> res = "Пс 77.60; Иез 37.27; Зах 2.10"
                45 -> res = "Лев 26.12; 2 Кор 6.16"
            }
        }
        if (glava == 30) {
            when (stih) {
                3 -> res = "Чис 4.11"
                6 -> res = "Исх 25.22"
                7 -> res = "1 Цар 3.14; Пс 140.2; Лк 1.9"
                9 -> res = "Лев 10.1"
                10 -> res = "Лев 16.2; Евр 9.7, 13"
                12 -> res = "Чис 1.2"
                13 -> res = "Лев 27.25; Чис 3.47; Иез 45.12"
                15 -> res = "Чис 15.19; Втор 12.6; Неем 12.44"
                18 -> res = "Исх 35.16"
                23 -> res = "Песн 4.14; Иез 27.22"
                30 -> res = "1 Ин 2.20, 27"
                35 -> res = "Исх 35.15; 1 Пар 9.30"
            }
        }
        if (glava == 31) {
            when (stih) {
                2 -> res = "Исх 35.30"
                3 -> res = "3 Цар 7.14"
                6 -> res = "Исх 35.34"
                7 -> res = "Исх 35.11"
                13 -> res = "Исх 20.8; Иез 20.12"
                14 -> res = "Чис 15.35; Быт 17.14"
                15 -> res = "Исх 20.9"
                17 -> res = "Быт 1.31; 2.1-2; Исх 20.11; Евр 4.4"
                18 -> res = "Исх 32.16; 34.29; Втор 9.10"
            }
        }
        if (glava == 32) {
            when (stih) {
                1 -> res = "Деян 7.40"
                3 -> res = "Втор 9.16"
                4 -> res = "Пс 105.19; 3 Цар 12.28; Неем 9.18"
                6 -> res = "1 Кор 10.7"
                7 -> res = "Втор 9.12"
                8 -> res = "3 Цар 12.28"
                10 -> res = "Втор 9.14"
                11 -> res = "Пс 105.23"
                12 -> res = "Чис 14.13, 15"
                13 -> res = "Быт 12.7; 15.7; 48.16; Пс 104.8-10"
                16 -> res = "Исх 31.18; Втор 9.10"
                17 -> res = "Исх 24.13"
                19 -> res = "Втор 9.17"
                26 -> res = "Быт 34.20"
                27 -> res = "Втор 33.9"
                29 -> res = "Втор 33.10"
                32 -> res = "Рим 9.3; Пс 68.29; Флп 4.3; Откр 3.5"
                34 -> res = "Исх 14.19; 33.2; Чис 14.18"
            }
        }
        if (glava == 33) {
            when (stih) {
                1 -> res = "Быт 50.24; Чис 32.11"
                2 -> res = "Исх 23.23; Втор 7.1; Нав 24.11"
                3 -> res = "Исх 34.9"
                5 -> res = "Иер 6.26; Иоил 1.8; Иона 3.6"
                9 -> res = "Втор 31.15"
                11 -> res = "Чис 12.7-8; Втор 34.10; Сир 45.3"
                14 -> res = "Втор 4.37"
                17 -> res = "2 Тим 2.19"
                19 -> res = "Рим 9.15"
                20 -> res = "Суд 13.22; Дан 10.8; 1 Тим 6.16"
            }
        }
        if (glava == 34) {
            when (stih) {
                1 -> res = "Втор 10.1"
                2 -> res = "Исх 33.21"
                3 -> res = "Исх 19.12"
                4 -> res = "Втор 10.3"
                5 -> res = "Исх 33.19"
                6 -> res = "Пс 85.15; Иоил 2.13; Иона 4.2"
                7 -> res = "Исх 20.6; Втор 5.10; Иер 32.18"
                8 -> res = "1 Цар 24.9"
                9 -> res = "Втор 9.13"
                12 -> res = "Втор 7.2"
                13 -> res = "Исх 23.24"
                14 -> res = "Исх 20.5"
                15 -> res = "Исх 23.32; Втор 7.2"
                16 -> res = "3 Цар 11.1; Втор 7.3"
                17 -> res = "Исх 20.3"
                18 -> res = "Исх 12.2, 15"
                19 -> res = "Исх 13.2; 22.29; Иез 44.30; Лк 2.23"
                20 -> res = "Исх 13.13"
                21 -> res = "Исх 20.9"
                22 -> res = "Втор 16.10"
                23 -> res = "Исх 23.17; Втор 16.16"
                25 -> res = "Исх 12.10; 23.18"
                26 -> res = "Исх 23.19; Втор 14.21"
                27 -> res = "Исх 24.4"
                28 -> res = "Исх 24.18; Втор 9.9, 18"
                30 -> res = "2 Кор 3.7"
                32 -> res = "Исх 35.1"
                33 -> res = "2 Кор 3.13"
            }
        }
        if (glava == 35) {
            when (stih) {
                1 -> res = "Исх 34.32"
                2 -> res = "Исх 20.9; 31.14"
                3 -> res = "Исх 16.23"
                5 -> res = "Исх 25.2"
                11 -> res = "Исх 25.8"
                13 -> res = "Исх 25.23"
                14 -> res = "Исх 25.31"
                15 -> res = "Исх 30.1"
                16 -> res = "Исх 27.1"
                17 -> res = "Исх 27.9"
                19 -> res = "Исх 28.2"
                22 -> res = "Чис 18.18"
                25 -> res = "Притч 31.19"
                30 -> res = "Исх 31.2"
                34 -> res = "Исх 31.6"
            }
        }
        if (glava == 36) {
            when (stih) {
                8 -> res = "Исх 26.1"
                35 -> res = "2 Пар 3.14"
            }
        }
        if (glava == 37) {
            when (stih) {
                1 -> res = "Исх 25.10"
                7 -> res = "3 Цар 6.23"
                25 -> res = "Исх 30.1"
                29 -> res = "Исх 30.25"
            }
        }
        if (glava == 38) {
            when (stih) {
                1 -> res = "Исх 27.1; 2 Пар 1.5"
                2 -> res = "3 Цар 1.51; Пс 117.27"
                21 -> res = "Чис 4.28"
                24 -> res = "Лев 27.25"
            }
        }
        if (glava == 39) {
            when (stih) {
                2 -> res = "Исх 28.6"
                10 -> res = "Прем 18.24; Иез 28.13"
                30 -> res = "Исх 28.36; Лев 8.9"
            }
        }
        if (glava == 40) {
            when (stih) {
                2 -> res = "2 Пар 1.3"
                3 -> res = "Исх 26.33"
                5 -> res = "Исх 30.1"
                9 -> res = "Исх 30.26"
                10, 17 -> res = "Чис 7.1"
                12 -> res = "Исх 29.4"
                14 -> res = "Исх 29.8"
                16 -> res = "Исх 7.10"
                20 -> res = "Чис 7.1; Евр 9.4"
                22 -> res = "Исх 26.35"
                23 -> res = "Исх 25.23, 30; 1 Цар 21.6"
                24 -> res = "Исх 25.31"
                27 -> res = "Исх 30.7"
                29 -> res = "Исх 27.1"
                30 -> res = "Исх 30.18"
                32 -> res = "Исх 29.4; 30.19"
                34 -> res = "Чис 9.15; 3 Цар 8.10"
                36 -> res = "Чис 9.21; 14.14"
                38 -> res = "Пс 77.14; Ис 4.5; 1 Кор 10.1"
            }
        }
        return res
    }

    fun kniga3(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Лев 12.8"
                3 -> res = "Исх 29.10"
                4 -> res = "Исх 29.10; Рим 3.25; 2 Кор 5.19"
                6 -> res = "Лев 7.8"
                7 -> res = "Лев 9.24"
                9 -> res = "Быт 8.21; Исх 29.25; Еф 5.2"
                14 -> res = "Лев 5.7"
                16 -> res = "Лев 4.12; 6.10"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Лев 5.11; 6.14; Неем 13.9"
                2 -> res = "Сир 7.34; Деян 10.4; Откр 8.4"
                3 -> res = "Чис 18.9; Сир 7.33-34"
                5 -> res = "1 Пар 9.31"
                9 -> res = "Лев 1.9"
                11 -> res = "Лев 6.17"
                12 -> res = "Лев 23.17"
                13 -> res = "Мк 9.49"
                14 -> res = "Нав 5.11"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Лев 1.3; 7.11"
                2 -> res = "Исх 29.16; Лев 1.5"
                3 -> res = "Исх 29.13, 22"
                4 -> res = "Лев 4.9"
                5 -> res = "Исх 29.25; Лев 1.9; 6.12"
                9 -> res = "Лев 4.35"
                11 -> res = "Лев 3.16; Иез 44.7"
                16 -> res = "Исх 29.13"
                17 -> res = "Быт 9.4; Лев 7.23, 26; Втор 12.16; Деян 15.20"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "Лев 5.15"
                3 -> res = "Лев 7.7; Иез 45.23; 2 Кор 5.21"
                5 -> res = "Лев 6.30"
                6, 17 -> res = "Лев 8.11; 14.7"
                7 -> res = "Исх 27.1; 30.3; Чис 18.17"
                8 -> res = "Лев 2.9"
                9 -> res = "Исх 29.13; Лев 3.4"
                10 -> res = "Лев 3.5"
                11 -> res = "Лев 8.17; Чис 19.5"
                12 -> res = "Лев 6.11; Евр 13.11"
                13 -> res = "Лев 9.7, 15; Чис 15.24"
                15 -> res = "Лев 3.16; 2 Пар 29.23; Мф 26.57"
                18 -> res = "Исх 40.6"
                20 -> res = "Рим 3.25; Евр 10.4"
                26 -> res = "Лев 3.3; 5.13"
                27 -> res = "Исх 12.44"
                29 -> res = "Лев 1.3"
                31 -> res = "Лев 3.14; Исх 29.18"
                35 -> res = "Лев 5.13; 16.18"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Втор 17.4"
                2 -> res = "Агг 2.13; 2 Кор 6.17; Лев 11.24"
                3 -> res = "Лев 11.12"
                4 -> res = "Сир 23.13; Иак 3.2"
                7 -> res = "Лев 12.8; Лк 2.24"
                8 -> res = "Лев 1.15"
                11 -> res = "Исх 16.36; Лев 2.1"
                12 -> res = "Лев 1.17; 2.2"
                13 -> res = "Лев 2.3; 4.26"
                15 -> res = "Исх 30.13"
                16 -> res = "Лев 6.7; 22.14"
                18 -> res = "Лев 4.26"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Чис 5.6"
                3 -> res = "Исх 23.4; Втор 22.1"
                5 -> res = "Исх 22.1; Лк 19.8"
                6 -> res = "Чис 5.8"
                7 -> res = "Лев 4.26"
                9 -> res = "Исх 29.38"
                10 -> res = "Исх 28.42"
                11 -> res = "Лев 4.12"
                12 -> res = "2 Мак 1.22"
                14 -> res = "Лев 2.1; Чис 15.4"
                15 -> res = "Лев 1.9"
                16 -> res = "Лев 2.3; 8.31; Иез 42.13"
                18 -> res = "Чис 18.10; Исх 27.21; Лев 10.9"
                22 -> res = "Пс 50.21"
                25 -> res = "Лев 4.3; 17.2"
                26 -> res = "Лев 6.16; Ос 4.8"
                28 -> res = "Лев 8.31; Иез 46.24"
                29 -> res = "Лев 7.6"
                30 -> res = "Лев 4.5; Евр 13.11"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Лев 5.6"
                2 -> res = "Лев 1.5; 6.25"
                3 -> res = "Лев 3.3"
                4 -> res = "Лев 3.4, 10"
                6 -> res = "Лев 6.18"
                7 -> res = "Лев 14.13"
                8 -> res = "Лев 1.6"
                9 -> res = "Лев 2.3"
                10 -> res = "Лев 2.5; 5.11; 6.22"
                11 -> res = "Лев 3.2"
                12 -> res = "Лев 22.29; 2 Пар 29.31; Пс 115.8"
                15 -> res = "Лев 19.5; 22.30; 1 Кор 10.18"
                16 -> res = "Чис 30.3"
                17 -> res = "Лев 19.6"
                19 -> res = "1 Цар 20.26"
                20 -> res = "Быт 17.14"
                21 -> res = "Лев 11.4"
                23 -> res = "Лев 3.17"
                26 -> res = "Быт 9.4; Лев 3.17"
                30 -> res = "Исх 29.24"
                32 -> res = "Исх 30.15"
                34 -> res = "Исх 29.27; Чис 18.11; 1 Кор 9.13"
                37 -> res = "Лев 16.6; 27.34"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "Исх 28.1; Лев 9.18, 22"
                6 -> res = "Исх 28.1; 40.12"
                10 -> res = "Исх 30.25; Чис 7.1"
                12 -> res = "Исх 29.7; Чис 35.25; Пс 132.2; Сир 45.18"
                14 -> res = "Исх 29.10"
                15 -> res = "2 Пар 29.22; Исх 29.16"
                16 -> res = "Лев 3.4"
                18 -> res = "Исх 29.15"
                21 -> res = "Исх 29.18; Лев 1.9"
                22 -> res = "Исх 29.19"
                23 -> res = "Лев 14.14"
                25 -> res = "Исх 29.22"
                26 -> res = "Исх 29.23"
                28 -> res = "Лев 1.9"
                29 -> res = "Исх 29.24; Лев 7.33"
                30 -> res = "Исх 29.21; Сир 45.18"
                31 -> res = "Исх 29.32; Лев 24.9; Мф 12.4; Мк 2.26; Лк 6.4"
                35 -> res = "Лев 10.7"
            }
        }
        if (glava == 9) {
            when (stih) {
                2 -> res = "Исх 29.1"
                3 -> res = "Лев 4.13; 1.5"
                7 -> res = "Лев 16.6; Евр 7.27"
                10 -> res = "Исх 29.22; Лев 3.10"
                11 -> res = "Лев 4.11"
                13 -> res = "Лев 1.6"
                15 -> res = "2 Кор 5.21"
                17 -> res = "Лев 2.1; Исх 29.38-40; Чис 28.4"
                21 -> res = "Исх 29.24"
                22 -> res = "Чис 6.23; Исх 20.24"
                24 -> res = "2 Мак 2.10"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Чис 3.4; 26.61; 1 Пар 24.2"
                3 -> res = "Исх 19.22; Иез 42.13; 1 Пет 4.17"
                5 -> res = "Деян 5.6, 10"
                6 -> res = "Лев 13.45; 21.10"
                9 -> res = "Иез 44.21; 1 Тим 3.3; Тит 1.7"
                10 -> res = "Иез 44.23; Евр 5.14; Лев 11.1-47"
                11 -> res = "Втор 33.10; Мал 2.4"
                12, 13 -> res = "Лев 2.3; 6.16"
                14 -> res = "Лев 9.21"
                15 -> res = "Исх 29.27"
                16 -> res = "2 Мак 2.11"
                17 -> res = "Лев 6.26; Исх 28.38"
            }
        }
        if (glava == 11) {
            when (stih) {
                2 -> res = "Втор 14.4"
                3 -> res = "Быт 1.30; Рим 14.14"
                7 -> res = "2 Мак 6.18"
                9 -> res = "Втор 14.9"
                13 -> res = "Втор 14.12"
                24 -> res = "Лев 5.2; Агг 2.14"
                32 -> res = "Лев 15.12"
                33 -> res = "Лев 6.28"
                40 -> res = "Лев 17.15; Втор 14.21"
                44 -> res = "Лев 19.2; 20.7; 1 Пет 1.16"
                45 -> res = "Быт 17.7; Лев 20.7"
                47 -> res = "Мф 15.17; Деян 10.13-15, 28"
            }
        }
        if (glava == 12) {
            when (stih) {
                2 -> res = "Лк 2.22"
                3 -> res = "Быт 17.10; Лк 2.21; Ин 7.22"
                6 -> res = "Лев 5.7"
                8 -> res = "Лк 2.24; Лев 5.7"
            }
        }
        if (glava == 13) {
            when (stih) {
                2 -> res = "Лев 14.3; Втор 24.8; Мф 8.4"
                3 -> res = "Чис 14.12"
                6 -> res = "Наум 3.19"
                9 -> res = "Лев 14.3; Втор 24.8"
                12 -> res = "Исх 9.9; Ис 1.6"
                13 -> res = "Пс 31.5; 37.4; Лк 18.13-14"
                34 -> res = "Откр 7.14"
                46 -> res = "4 Цар 15.5; 1 Кор 5.11; Гал 5.19, 21"
            }
        }
        if (glava == 14) {
            when (stih) {
                2 -> res = "Мф 8.2-3; Мк 1.44; Лк 5.14; 17.14"
                4 -> res = "Чис 19.6; Евр 9.19; Исх 12.22"
                7, 51 -> res = "Лев 4.6; 8.11"
                8 -> res = "Чис 8.7; Пс 50.9; 1 Пет 1.2"
                12 -> res = "Исх 29.24"
                13 -> res = "Лев 7.7"
                14 -> res = "Лев 8.23"
                16 -> res = "Лев 16.14"
                22 -> res = "Лев 12.8; 15.14"
                25 -> res = "Лев 8.24"
                35 -> res = "Лев 13.2"
                44 -> res = "Лев 13.51"
                46 -> res = "Лев 11.24"
                54 -> res = "Лев 16.16, 33"
            }
        }
        if (glava == 15) {
            when (stih) {
                2 -> res = "Лев 22.4; 2 Цар 3.29"
                5 -> res = "Лев 11.24"
                12 -> res = "Лев 6.28"
                13 -> res = "Чис 19.11"
                14 -> res = "Лев 12.8"
                19 -> res = "Лев 18.19"
                24 -> res = "Лев 18.19; Иез 18.6"
                25 -> res = "Мф 9.20"
                29 -> res = "Лев 12.8; 14.22"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Лев 10.1-2; Чис 3.4"
                2 -> res = "Исх 30.10; Евр 9.7, 13"
                5 -> res = "Чис 29.11"
                6 -> res = "Чис 1.49"
                11 -> res = "Евр 7.27"
                12 -> res = "Лев 6.12; Исх 30.34"
                14 -> res = "Евр 9.13; 10.4; Лев 4.6, 17"
                16 -> res = "Евр 9.2"
                17 -> res = "Лк 1.10"
                19 -> res = "Лев 14.7"
                22 -> res = "Лев 16.10"
                27 -> res = "Евр 13.11"
                29 -> res = "Лев 23.2"
                34 -> res = "Исх 30.10; Лев 16.2; Евр 9.7"
            }
        }
        if (glava == 17) {
            when (stih) {
                2 -> res = "Лев 6.25"
                4 -> res = "Быт 17.14"
                6 -> res = "Евр 13.11; Исх 29.18"
                7 -> res = "Лев 20.3; Втор 32.17"
                9 -> res = "Нав 22.16"
                10 -> res = "Быт 9.4; Втор 12.23; Пс 33.17"
                11 -> res = "Втор 12.23; Кол 1.20; Евр 9.13"
                14 -> res = "Быт 9.4; Лев 3.17"
                15 -> res = "Лев 11.40; Втор 14.21; Иез 44.31"
            }
        }
        if (glava == 18) {
            when (stih) {
                2 -> res = "Лев 11.44"
                4 -> res = "Мф 15.3"
                5 -> res = "Иез 20.11; Неем 9.29; Рим 10.5; Гал 3.12"
                6 -> res = "2 Цар 16.22"
                7 -> res = "Быт 9.22-23; 19.32; Иез 22.10"
                8 -> res = "Втор 27.20; 2 Цар 16.22; Иез 22.10"
                9 -> res = "Втор 27.22; 2 Цар 13.12; Иез 22.11"
                12 -> res = "Лев 20.19"
                14 -> res = "Лев 20.20"
                15 -> res = "Быт 38.16; Втор 27.23; Иез 22.11"
                16 -> res = "Лев 20.21; Мф 14.4; Мк 6.18"
                17 -> res = "Лев 20.14"
                19 -> res = "Лев 15.19"
                20 -> res = "Лев 20.10"
                21 -> res = "Лев 20.2; 4 Цар 23.10"
                22 -> res = "Рим 1.27; 1 Кор 6.9"
                23 -> res = "Исх 22.19"
                24 -> res = "Лев 20.23; 4 Цар 17.15"
                25 -> res = "Ис 26.21"
                28 -> res = "Лев 20.22"
                30 -> res = "Лев 19.37; 20.8"
            }
        }
        if (glava == 19) {
            when (stih) {
                2 -> res = "Лев 11.44; 1 Пет 1.15-16"
                3 -> res = "Исх 20.12; Сир 3.6-9; Исх 20.8"
                4 -> res = "Исх 20.4"
                5 -> res = "Лев 3.1"
                6 -> res = "Лев 7.16-17"
                7 -> res = "Лев 7.18"
                8 -> res = "Быт 17.14"
                9 -> res = "Лев 23.22; Втор 24.19"
                11 -> res = "Исх 20.15"
                12 -> res = "Исх 20.7; Втор 5.11; Мф 5.33"
                13 -> res = "Сир 10.6; Втор 24.14; Тов 4.14; Сир 34.22"
                15 -> res = "Втор 1.17; 16.19; Сир 42.1; Притч 24.23; Иак 2.1"
                17 -> res = "1 Ин 2.11; 3.15; Мф 18.15; Лк 17.3"
                18 -> res = "Мф 5.43; 22.39; Мк 12.31; Рим 13.9; Гал 5.14; Иак 2.8"
                22 -> res = "Лев 4.26; 5.13"
                23 -> res = "Втор 20.6"
                24 -> res = "Неем 10.35"
                26 -> res = "Втор 18.10; 4 Цар 21.6"
                28 -> res = "Втор 14.1; 3 Цар 18.28"
                29 -> res = "Сир 26.13"
                30 -> res = "Лев 23.2"
                31 -> res = "Лев 20.6; Втор 18.11; Ис 8.19"
                32 -> res = "Сир 8.7"
                33 -> res = "Исх 22.21"
                36 -> res = "Втор 25.13-15; Притч 11.1; Иез 45.10"
                37 -> res = "Лев 18.30; Втор 7.12"
            }
        }
        if (glava == 20) {
            when (stih) {
                2 -> res = "Лев 18.21; 4 Цар 23.10"
                6 -> res = "Лев 19.31"
                7 -> res = "Лев 11.44; 19.2; 1 Пет 1.15-16"
                9 -> res = "Исх 21.17; Притч 20.20; Мф 15.4; Мк 7.10"
                10 -> res = "Втор 22.22; Ин 8.4-5"
                11 -> res = "Быт 35.22"
                12 -> res = "Быт 38.16; 1 Кор 6.9"
                13 -> res = "Лев 18.22; Рим 1.27; 1 Кор 6.9"
                14 -> res = "Лев 18.17"
                15 -> res = "Лев 18.23"
                17 -> res = "Лев 18.9"
                18 -> res = "Лев 15.24; Иез 18.6"
                19 -> res = "Лев 18.12"
                20 -> res = "Ос 9.11-12"
                21 -> res = "Лев 18.16; Мк 6.18"
                22 -> res = "Лев 18.28, 30"
                23 -> res = "Лев 18.24; Втор 9.5"
                24 -> res = "Исх 3.8; 13.5"
                25 -> res = "Втор 14.4"
                26 -> res = "Лев 11.45; 19.2; Мф 5.48"
                27 -> res = "Втор 18.11; 1 Цар 28.7"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "Иез 44.25"
                2 -> res = "Чис 6.7"
                5 -> res = "Лев 19.27; Втор 14.1; Иез 44.20"
                7 -> res = "Иез 44.22; Еф 5.27"
                8 -> res = "Лев 11.44"
                10 -> res = "Исх 28.41; Лев 10.6"
                11 -> res = "Чис 6.7; 9.6"
                12 -> res = "Лев 10.7; Исх 28.38"
                13 -> res = "Иез 44.22"
                17 -> res = "1 Тим 3.2; Тит 1.7"
                18 -> res = "1 Тим 6.14; 2 Пет 3.14"
                23 -> res = "Лев 22.9"
            }
        }
        if (glava == 22) {
            when (stih) {
                2 -> res = "Лев 6.25; Чис 6.23"
                4 -> res = "Лев 15.2, 16; 2 Пар 30.18"
                5 -> res = "Лев 11.29"
                6 -> res = "Лев 11.24; 2 Пет 3.14"
                8 -> res = "Исх 22.31; Иез 44.31"
                9 -> res = "Лев 5.1"
                10 -> res = "Исх 12.44"
                13 -> res = "Лев 10.14"
                14 -> res = "Лев 5.15"
                15 -> res = "Лев 21.8"
                18 -> res = "Пс 49.14"
                20 -> res = "Втор 15.21; Сир 35.11"
                21 -> res = "Лев 7.16"
                22 -> res = "Мал 1.8, 13"
                27 -> res = "Исх 22.30"
                28 -> res = "Втор 22.6"
                29 -> res = "Лев 7.12"
                30 -> res = "Лев 7.15-16"
                31 -> res = "Лев 18.30"
                32 -> res = "Лев 10.3; 21.8"
                33 -> res = "Исх 13.3"
            }
        }
        if (glava == 23) {
            when (stih) {
                3 -> res = "Исх 20.9; Втор 5.13; Евр 4.4"
                5 -> res = "Исх 12.18; Чис 28.16"
                8 -> res = "Втор 16.8"
                10 -> res = "1 Кор 15.20; Кол 1.18"
                11 -> res = "Исх 29.28"
                13 -> res = "Лев 2.1; Исх 16.36"
                14 -> res = "Лев 2.14"
                15 -> res = "Втор 16.9; Исх 35.21"
                16, 21 -> res = "Чис 28.26"
                22 -> res = "Лев 19.9; Втор 24.19"
                24 -> res = "3 Цар 8.2; Чис 29.1; Пс 80.4"
                27 -> res = "Лев 16.29"
                32 -> res = "Лев 16.31"
                34 -> res = "Ин 7.2"
                36 -> res = "Чис 29.35; Неем 8.18; Ин 7.37"
                37 -> res = "Чис 29.2"
                40 -> res = "Неем 8.14-16; Мф 21.8; Пс 117.24"
            }
        }
        if (glava == 24) {
            when (stih) {
                2 -> res = "Исх 27.20"
                3 -> res = "1 Цар 3.3; Исх 27.21"
                4 -> res = "Исх 25.31; Ин 1.7"
                5 -> res = "Исх 25.30; Мф 12.4; Лк 6.4"
                6 -> res = "Исх 25.30"
                7 -> res = "Ин 6.35"
                8 -> res = "Мф 12.5"
                9 -> res = "Лев 8.31; Исх 29.32; Мф 12.4; Мк 2.26"
                11 -> res = "Втор 28.58; Мф 9.3"
                12 -> res = "Чис 15.34"
                16 -> res = "Исх 20.7; Мф 26.65"
                17 -> res = "Исх 21.12"
                19 -> res = "Исх 21.24; Втор 19.21"
                20 -> res = "Исх 21.24; Втор 19.21; Мф 5.38"
                22 -> res = "Исх 12.49; Втор 1.16"
            }
        }
        if (glava == 25) {
            when (stih) {
                3 -> res = "Исх 23.10"
                4 -> res = "Втор 15.1"
                9 -> res = "Лев 23.27"
                10 -> res = "Втор 15.1; Ис 61.2; Лев 27.24"
                13, 30 -> res = "Чис 36.4"
                14 -> res = "Лев 19.13; 1 Фес 4.6"
                17 -> res = "Лев 19.14"
                18 -> res = "Лев 18.30; 3 Цар 4.25"
                19 -> res = "Пс 66.7; Ис 1.19; Иез 34.27"
                21 -> res = "Втор 28.8"
                23 -> res = "Чис 36.7; 3 Цар 21.1-3"
                25 -> res = "Иов 19.25"
                26 -> res = "Чис 35.12"
                34 -> res = "Чис 35.2"
                35 -> res = "Втор 15.8; Сир 19.1"
                36 -> res = "Исх 22.25; Иез 18.8; 22.12"
                38 -> res = "Исх 20.2; Быт 17.7"
                39 -> res = "Исх 21.2; 4 Цар 4.1; Мф 18.25"
                40 -> res = "Исх 21.2; Иер 34.14"
                41 -> res = "Лк 4.18 [43] Еф 6.9; Кол 4.1"
                43 -> res = "Еф 6.9; Кол 4.1"
                44 -> res = "Исх 21.4"
                47 -> res = "Неем 5.8"
                55 -> res = "Лев 18.2"
            }
        }
        if (glava == 26) {
            when (stih) {
                1 -> res = "Исх 20.4; Втор 5.8; Пс 96.7"
                3 -> res = "Втор 28.1"
                5 -> res = "Иов 11.19"
                7 -> res = "Втор 6.19"
                8 -> res = "Втор 32.30; Нав 23.10; 2 Пар 14.9"
                10 -> res = "Песн 7.14"
                11 -> res = "Втор 4.7"
                12 -> res = "2 Кор 6.16"
                13 -> res = "Иер 27.2; 28.2"
                14 -> res = "Втор 28.15; Плач 2.17; Мал 2.2; Вар 2.10"
                15 -> res = "Ис 24.5"
                16 -> res = "Втор 28.21, 66; 1 Цар 2.33"
                17 -> res = "Лев 17.10; Пс 33.17"
                19 -> res = "Втор 28.23"
                20 -> res = "Иер 8.13; Иоил 1.12"
                22 -> res = "Прем 11.16, 18"
                24 -> res = "2 Цар 22.27; Пс 17.27"
                25 -> res = "Иез 21.14"
                26 -> res = "Пс 104.16; Иез 4.16; Мф 15.38"
                28 -> res = "Втор 32.23"
                29 -> res = "4 Цар 6.28-29; Иер 19.9; Плач 2.20"
                31 -> res = "Иер 7.14; Ис 1.13; Ам 5.21"
                32 -> res = "Иер 19.8; 25.9; Иез 23.25"
                34 -> res = "Лев 25.2"
                36 -> res = "Втор 20.3; Ис 7.4; Иов 15.21"
                40 -> res = "Втор 4.30; Иез 36.31; Дан 9.16"
                41 -> res = "Иер 9.26; Иез 44.7"
                42 -> res = "Исх 2.24; Втор 4.29; Ис 54.10"
                44 -> res = "Втор 4.29; Иер 14.9"
                45 -> res = "Исх 6.5; 16.6; 19.5; Пс 78.8"
            }
        }
        if (glava == 27) {
            when (stih) {
                2 -> res = "Чис 30.3; Втор 23.21"
                16 -> res = "Иез 45.11"
                24 -> res = "Лев 25.10"
                25 -> res = "Исх 30.13; Чис 3.47; 18.16; Иез 45.12"
                26 -> res = "Исх 13.2; Чис 3.13"
                27 -> res = "Лев 22.23"
                28 -> res = "Чис 21.2; Нав 6.17; 1 Цар 15.3"
                29 -> res = "Нав 6.17; Суд 11.39"
                30 -> res = "Исх 23.19; Втор 12.17; Евр 7.9"
                34 -> res = "Лев 26.46"
            }
        }
        return res
    }

    fun kniga4(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Исх 25.22"
                2 -> res = "Исх 30.12"
                3 -> res = "Чис 26.4; 1 Пар 25.28; 2 Пар 25.5"
                4 -> res = "Чис 13.4"
                6 -> res = "Чис 10.19"
                7 -> res = "Чис 10.14; 1 Пар 2.10"
                10 -> res = "Чис 2.18, 20"
                11 -> res = "Чис 2.22"
                12 -> res = "Чис 2.25"
                13 -> res = "Чис 2.27"
                14 -> res = "Чис 2.14"
                15 -> res = "Чис 2.29"
                19 -> res = "Чис 26.64"
                46 -> res = "Чис 26.51"
                49 -> res = "Чис 3.15"
                51 -> res = "Чис 3.10, 38; 4.5; 18.7"
                54 -> res = "Исх 12.28; Чис 2.34"
            }
        }
        if (glava == 2) {
            when (stih) {
                3 -> res = "Чис 10.5"
                5 -> res = "Чис 10.15"
                7 -> res = "Чис 10.16"
                10 -> res = "Чис 10.6"
                12 -> res = "Чис 10.19"
                14 -> res = "Чис 10.20"
                17 -> res = "Пс 45.6"
                18 -> res = "Пс 79.3; Чис 10.22"
                20 -> res = "Чис 1.10"
                22 -> res = "Чис 1.11; 7.60; 10.24"
                34 -> res = "Исх 12.28; Лев 24.23"
            }
        }
        if (glava == 3) {
            when (stih) {
                2 -> res = "Исх 6.23; 1 Пар 24.1"
                3 -> res = "Лев 8.2; Исх 28.41"
                4 -> res = "Лев 10.1; Чис 26.61; 1 Пар 24.2"
                6 -> res = "1 Езд 6.18"
                8 -> res = "Лев 8.35"
                9 -> res = "Чис 8.19"
                10 -> res = "Чис 16.40; 18.7"
                12 -> res = "Исх 29.24; Чис 8.16"
                13 -> res = "Исх 13.2; 22.29; 34.19; Лев 27.26; Чис 8.17; Лк 2.23"
                17 -> res = "Быт 46.11; Исх 6.16; Чис 26.57; 1 Пар 6.1; 23.6"
                19 -> res = "Исх 6.18; Чис 26.58-59"
                30 -> res = "Исх 6.22; Лев 10.4"
                31 -> res = "Чис 7.9"
                32 -> res = "1 Пар 9.11; Чис 19.3; 4 Цар 25.18"
                38 -> res = "Чис 1.51; 16.40; 18.7"
                47 -> res = "Чис 18.16; Исх 30.13"
            }
        }
        if (glava == 4) {
            when (stih) {
                3 -> res = "Чис 8.15"
                5 -> res = "Чис 10.17; Нав 18.1"
                6 -> res = "3 Цар 8.8"
                7 -> res = "Исх 25.30"
                9 -> res = "Исх 25.31"
                11 -> res = "Исх 30.3"
                14 -> res = "Исх 27.3"
                15 -> res = "1 Пар 13.10"
                16 -> res = "Исх 30.23"
                20 -> res = "1 Цар 6.19"
                24 -> res = "1 Пар 15.2"
                25 -> res = "Исх 26.7, 14"
                28 -> res = "Чис 7.7"
                31 -> res = "Чис 10.17; Исх 26.15"
                33 -> res = "Чис 7.8"
            }
        }
        if (glava == 5) {
            when (stih) {
                2 -> res = "Лев 13.46; 15.2"
                3 -> res = "Чис 12.15"
                6 -> res = "Лев 6.2"
                7 -> res = "Лк 19.8"
                8 -> res = "Лев 6.6"
                9 -> res = "Исх 29.28"
                14 -> res = "Сир 9.1"
                15 -> res = "Исх 16.36"
                17 -> res = "Исх 30.18; 32.20"
                18 -> res = "1 Кор 11.5-6"
                21 -> res = "Иер 42.18; 44.12"
                22 -> res = "Втор 27.15"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Суд 13.5; 1 Цар 1.11; Иер 1.5"
                5 -> res = "Суд 13.5"
                7 -> res = "Лев 21.2, 11"
                10 -> res = "Лев 12.8; 14.22"
                18 -> res = "Деян 21.24"
                20 -> res = "Исх 29.27; Лев 7.31"
                23 -> res = "Сир 36.18"
                24 -> res = "Пс 66.8"
                25, 26 -> res = "Пс 4.7"
                27 -> res = "Сир 50.23"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Исх 40.10, 17, 20"
                8 -> res = "Чис 4.28"
                9 -> res = "Чис 3.31; 4.15; 2 Цар 6.13"
                12 -> res = "Чис 1.7; 2.3"
                18 -> res = "Чис 1.8; 2.5"
                24 -> res = "Чис 1.9; 2.7"
                30 -> res = "Чис 1.5; 2.10"
                36 -> res = "Чис 1.6; 2.12"
                42 -> res = "Чис 1.14; 2.14"
                48 -> res = "Чис 1.10; 2.18"
                54 -> res = "Чис 1.10; 2.20"
                60 -> res = "Чис 1.11; 2.22; 10.24"
                66 -> res = "Чис 1.12; 2.25"
                72 -> res = "Чис 1.13; 2.27"
                78 -> res = "Чис 1.15; 2.29"
                89 -> res = "Лев 1.1"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "Исх 25.37; 27.21"
                4 -> res = "Исх 25.31; 3 Цар 7.49"
                6 -> res = "Чис 19.7"
                7 -> res = "Лев 14.8-9; 2 Пар 23.6"
                9 -> res = "1 Езд 6.18"
                11 -> res = "Исх 29.24"
                16 -> res = "Чис 3.12; 18.6"
                17 -> res = "Чис 3.13"
                19 -> res = "Чис 3.9"
                24 -> res = "Чис 4.3; 1 Пар 23.3, 24"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Исх 13.4"
                2 -> res = "Исх 12.3; 23.15; Лев 23.5"
                5 -> res = "Исх 12.6; Лев 23.5"
                6 -> res = "Чис 19.11"
                11 -> res = "2 Пар 30.2"
                12 -> res = "Исх 12.46; Ин 19.36"
                14 -> res = "Исх 12.49"
                15 -> res = "Исх 40.34"
                16 -> res = "Исх 13.21"
                17 -> res = "Исх 40.36"
                18 -> res = "1 Кор 10.1"
            }
        }
        if (glava == 10) {
            when (stih) {
                5 -> res = "Чис 2.3"
                6 -> res = "Чис 2.10"
                8 -> res = "Исх 27.21"
                9 -> res = "Чис 31.6; 2 Пар 13.12; Иов 39.25"
                10 -> res = "Чис 28.14; 4 Цар 11.14; 2 Пар 7.6"
                12 -> res = "Чис 2.2"
                14 -> res = "Чис 1.7"
                15 -> res = "Чис 1.8"
                16 -> res = "Чис 1.9"
                17 -> res = "Чис 4.5"
                18 -> res = "Чис 1.5"
                19 -> res = "Чис 1.6; 2.12"
                20 -> res = "Чис 1.14; 2.14"
                22 -> res = "Чис 1.10; 2.18"
                23 -> res = "Чис 1.10; 2.20"
                24 -> res = "Чис 1.11; 2.22"
                25 -> res = "Чис 1.12; 2.25"
                26 -> res = "Чис 1.13; 2.27"
                27 -> res = "Чис 1.15; 2.19"
                29 -> res = "Исх 2.18; 18.1; 6.12"
                33 -> res = "Втор 31.8"
                35 -> res = "Пс 67.2"
                36 -> res = "2 Пар 6.41; Пс 131.8"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Чис 21.4; Лев 10.2; Пс 77.21"
                2 -> res = "Ам 7.5"
                3 -> res = "Втор 9.22"
                4 -> res = "Исх 12.38; 1 Кор 10.6"
                6, 20 -> res = "Чис 21.5"
                7 -> res = "Исх 16.14; Пс 77.24; Прем 16.20; Ин 6.31; 1 Кор 10.3"
                9 -> res = "Исх 16.14"
                12 -> res = "Втор 1.35"
                14 -> res = "Втор 1.19"
                15 -> res = "Исх 32.32"
                16 -> res = "Исх 18.21; Чис 16.25"
                17 -> res = "1 Кор 12.4; Исх 18.26"
                18 -> res = "Исх 19.10"
                21 -> res = "Чис 20.10; Мф 14.15; Ин 6.5"
                22 -> res = "Мф 15.33; Мк 8.4"
                23 -> res = "Ис 50.2; 59.1"
                25 -> res = "Чис 12.5; 1 Цар 10.6; Иоил 2.28"
                28 -> res = "Чис 13.9; 1 Фес 5.19"
                31 -> res = "Исх 16.13; Пс 77.27; 104.40; Прем 19.11"
                33 -> res = "Пс 77.30-31"
                35 -> res = "Чис 13.1; 33.16"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Чис 16.2; Исх 2.21"
                3 -> res = "Исх 11.8; Мф 11.29"
                5 -> res = "Исх 16.10; Чис 11.17; 14.10"
                6 -> res = "1 Цар 3.7"
                7 -> res = "Евр 3.5"
                8 -> res = "Исх 33.11; Втор 34.10; 1 Кор 13.12"
                9 -> res = "Чис 11.3"
                10 -> res = "Втор 24.9"
                12 -> res = "4 Цар 5.10"
                14 -> res = "Лев 13.46; 14.8"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Чис 11.35; 33.17"
                3 -> res = "Втор 1.22; 9.23"
                4 -> res = "Втор 1.22"
                7 -> res = "Нав 14.7"
                18 -> res = "Чис 32.8"
                22 -> res = "2 Цар 8.9"
                23 -> res = "Втор 1.28; 2.10"
                24 -> res = "Чис 32.9; Втор 1.24"
                27 -> res = "Быт 14.7; Втор 1.19"
                28 -> res = "Исх 3.8; Втор 1.25"
                30 -> res = "Нав 11.3"
                31 -> res = "Чис 14.6, 24; Нав 14.8"
                34 -> res = "Быт 6.4; Втор 9.2"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Чис 21.5; Втор 1.27; Пс 105.25"
                2 -> res = "Чис 16.3"
                3 -> res = "3 Езд 1.18"
                5 -> res = "Чис 16.4"
                6 -> res = "Сир 46.9; 1 Мак 2.55-56"
                8 -> res = "Исх 3.8; Чис 13.28"
                9 -> res = "Втор 20.3; 32.42"
                10 -> res = "Исх 17.4"
                12 -> res = "Исх 32.10"
                13 -> res = "Исх 32.12"
                14 -> res = "Исх 13.21"
                15 -> res = "Исх 32.12"
                16 -> res = "Втор 9.28"
                18 -> res = "Пс 102.8; Исх 20.5; Втор 5.9; Иер 32.18"
                19 -> res = "Исх 32.12"
                21 -> res = "Втор 1.35"
                22 -> res = "Неем 4.12; Еккл 7.20"
                23 -> res = "Втор 1.35; Пс 94.11; Евр 3.11"
                24 -> res = "Нав 14.6; Суд 1.20; 1 Мак 2.56"
                27 -> res = "Пс 105.25"
                29 -> res = "Чис 26.65; 32.11; Втор 1.35; Пс 105.26"
                30 -> res = "Чис 26.65; Втор 1.36; Нав 14.6"
                33 -> res = "Пс 94.10"
                34 -> res = "Пс 94.10"
                37 -> res = "Иуд 1.5; 1 Кор 10.10; Евр 3.11"
                38 -> res = "Сир 46.10"
                40 -> res = "Втор 1.41"
                44 -> res = "Втор 1.43"
                45 -> res = "Суд 1.17"
            }
        }
        if (glava == 15) {
            when (stih) {
                3 -> res = "Лев 7.16; Исх 29.18"
                4 -> res = "Лев 2.5; Исх 16.36"
                13 -> res = "Лев 1.17; 3.5, 16"
                15 -> res = "Исх 12.49; Лев 24.22; Чис 9.14"
                16 -> res = "Втор 1.16"
                19 -> res = "Исх 23.15-16"
                20 -> res = "Неем 10.37; Лев 23.10-11"
                22, 24 -> res = "Лев 4.13"
                27 -> res = "Лев 4.27"
                29 -> res = "Исх 12.49; Лев 24.22"
                32 -> res = "Исх 20.8"
                34 -> res = "Лев 24.12"
                36 -> res = "Нав 7.25"
                38 -> res = "Втор 22.12; Мф 23.5"
                40 -> res = "Мф 15.3"
                41 -> res = "Исх 20.2; Лев 11.45; Быт 17.7"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Чис 26.9; 27.3; Сир 45.22; Иуд 1.11; Исх 6.21"
                2 -> res = "Чис 12.1; Исх 18.22"
                3 -> res = "Чис 14.2; 20.2"
                4 -> res = "Чис 14.5"
                9 -> res = "Чис 3.6"
                11 -> res = "Исх 16.7"
                14 -> res = "Исх 3.8; 13.5; 33.3"
                15 -> res = "Быт 4.4-5"
                19 -> res = "Исх 16.10; Лев 9.23"
                22 -> res = "Пс 30.6; 145.4; Лк 8.55; 2 Цар 24.17"
                24 -> res = "Чис 12.15"
                30 -> res = "Чис 27.3; Втор 11.6; Пс 105.17"
                31 -> res = "Чис 26.10"
                35 -> res = "Лев 10.2"
                41 -> res = "Чис 14.2; 20.3"
                42 -> res = "Исх 16.10; Чис 12.5"
                46 -> res = "Прем 18.21"
            }
        }
        if (glava == 17) {
            when (stih) {
                4 -> res = "Исх 25.22"
                8 -> res = "Евр 9.4; Ис 11.1"
                10 -> res = "Евр 9.10"
                13 -> res = "Ис 64.12"
            }
        }
        if (glava == 18) {
            when (stih) {
                6 -> res = "Нав 13.14"
                7 -> res = "Чис 3.10; 16.40"
                8 -> res = "Лев 6.16, 29; Чис 31.41"
                9 -> res = "Лев 2.3; Сир 7.33-34"
                10 -> res = "Лев 6.16; 7.6"
                11 -> res = "Сир 7.33"
                12 -> res = "Неем 10.37"
                14 -> res = "Лев 27.28"
                15 -> res = "Исх 34.19"
                16 -> res = "Исх 30.13; Лев 27.25; Чис 3.47; Иез 45.12"
                17 -> res = "Лев 3.9; 4.7"
                18 -> res = "Исх 29.22, 27; Лев 7.34"
                19 -> res = "Исх 27.21"
                20 -> res = "Втор 10.9; 18.2; Нав 13.14, 33; Иез 44.28"
                21 -> res = "Евр 7.8"
                24 -> res = "Лев 27.30; Неем 12.47; Втор 10.9"
                26 -> res = "Втор 14.22"
                28 -> res = "Лев 22.19"
                31 -> res = "Мф 10.10; 1 Кор 9.13; 1 Тим 5.18"
            }
        }
        if (glava == 19) {
            when (stih) {
                2 -> res = "Евр 9.13; 2 Кор 5.21"
                3 -> res = "Лев 24.14; Мф 27.33; Евр 13.12"
                4 -> res = "Евр 9.13; 1 Пет 1.2"
                6 -> res = "Лев 14.4, 6, 51"
                7 -> res = "Лев 11.24; Чис 8.7"
                9 -> res = "1 Ин 1.7; Евр 9.13; Чис 31.19, 23; Евр 10.22"
                10 -> res = "Исх 27.21"
                11 -> res = "Сир 34.28"
                13 -> res = "Ис 52.11"
                16 -> res = "Чис 31.19"
                18 -> res = "Исх 12.22; Лев 14.4-5"
                20 -> res = "Евр 10.26, 29"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "Втор 1.19; Исх 2.4, 7"
                2 -> res = "Чис 14.2"
                3 -> res = "Исх 17.2; Пс 105.16"
                4 -> res = "Втор 9.7"
                5 -> res = "Исх 17.3; Иер 2.6"
                6 -> res = "Исх 16.10"
                8 -> res = "Чис 17.10"
                10 -> res = "Исх 17.6; Втор 8.15; Неем 9.15; Пс 77.16; 104.41; Прем 11.4; Ис 48.21; 3 Езд 1.20; 1 Кор 10.4"
                12 -> res = "Втор 1.37"
                13 -> res = "Исх 17.7; Втор 32.51"
                14 -> res = "Быт 25.25-26; Втор 2.8"
                16 -> res = "Исх 2.23; 3.2, 7; 14.19"
                18 -> res = "Втор 2.30; Рим 15.28"
                19 -> res = "Втор 2.28"
                20 -> res = "Чис 21.4"
                21 -> res = "Втор 2.4"
                22 -> res = "Чис 33.37"
                24 -> res = "Быт 25.8; Втор 31.2"
                25 -> res = "Чис 33.38; Втор 32.50"
                29 -> res = "Втор 10.6"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "Чис 33.40"
                2 -> res = "Лев 27.28"
                3 -> res = "Нав 2.9"
                4 -> res = "Чис 11.1"
                5 -> res = "Втор 6.16"
                6 -> res = "Прем 16.5; 1 Кор 10.9"
                7 -> res = "Исх 8.8"
                8 -> res = "Ин 3.14"
                9 -> res = "4 Цар 18.4; Ин 3.14"
                10 -> res = "Чис 33.43"
                11 -> res = "Чис 33.44"
                12 -> res = "Втор 2.13"
                13 -> res = "Суд 11.13"
                15 -> res = "Ис 15.8"
                16 -> res = "Чис 20.8"
                18 -> res = "Втор 33.21"
                21 -> res = "Втор 2.26; Суд 11.19; Неем 9.22"
                22 -> res = "Чис 20.17"
                23 -> res = "Втор 2.32"
                24 -> res = "Втор 31.4; Нав 9.10; 24.8; Суд 11.21; Пс 134.11; Ам 2.9; 3 Езд 1.11"
                28 -> res = "Иер 48.45"
                29 -> res = "3 Цар 11.7"
                30 -> res = "Ис 15.2; Иер 48.8"
                33 -> res = "Втор 3.1; 29.7"
                34 -> res = "Пс 134.11"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "Чис 33.48"
                2 -> res = "Суд 11.25"
                3 -> res = "2 Цар 8.2"
                4 -> res = "Чис 23.24"
                5 -> res = "Втор 23.4; Нав 24.9"
                6 -> res = "Чис 23.25; Мих 6.5"
                7 -> res = "2 Пет 2.15; Иуд 1.11"
                11 -> res = "Втор 23.5"
                18 -> res = "Чис 24.13"
                28 -> res = "2 Пет 2.16; Иуд 1.11"
                31 -> res = "Нав 5.13"
            }
        }
        if (glava == 23) {
            when (stih) {
                7 -> res = "Втор 23.4"
                8 -> res = "Нав 24.10"
                9 -> res = "Втор 33.28"
                10 -> res = "Быт 13.16; 3 Цар 19.4"
                12 -> res = "Втор 32.31"
                14 -> res = "Втор 3.27"
                19 -> res = "1 Цар 15.29; Мал 3.6; Тит 1.2"
                21 -> res = "Пс 54.11; Иер 50.20"
                22 -> res = "Чис 24.8"
                24 -> res = "Быт 49.9"
                25 -> res = "Чис 22.6"
                28 -> res = "Чис 25.3"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "Чис 23.3"
                5 -> res = "Нав 24.10"
                6 -> res = "Пс 1.3; Иер 17.8"
                8 -> res = "Чис 23.22"
                9 -> res = "Быт 49.9"
                13 -> res = "Чис 22.18"
                14 -> res = "Чис 25.1-2; 31.16; Откр 2.14"
                17 -> res = "Мф 2.2; Быт 49.10; 2 Цар 8.2"
                18 -> res = "2 Цар 8.14; Быт 36.8"
                19 -> res = "Рим 9.5; 2 Кор 10.5; Откр 19.6"
                20 -> res = "Втор 25.19"
                21 -> res = "Суд 1.16; 1 Цар 15.6"
                24 -> res = "Дан 11.30"
                25 -> res = "Чис 31.8"
            }
        }
        if (glava == 25) {
            when (stih) {
                1 -> res = "Чис 31.16; 1 Кор 10.8; Откр 2.14"
                3 -> res = "Нав 22.17; Пс 105.28"
                4 -> res = "Втор 4.3"
                7 -> res = "Пс 105.30"
                9 -> res = "1 Кор 10.8"
                12 -> res = "Сир 45.29"
                13 -> res = "1 Мак 2.54"
                15 -> res = "Чис 31.8"
                17 -> res = "Чис 31.2"
            }
        }
        if (glava == 26) {
            when (stih) {
                2 -> res = "Чис 1.2"
                3 -> res = "Чис 33.50"
                5 -> res = "Быт 46.8"
                9 -> res = "Чис 16.1"
                10 -> res = "Чис 16.31"
                11 -> res = "Чис 16.32"
                12 -> res = "Быт 46.10"
                19 -> res = "Быт 38.3-4"
                20 -> res = "Быт 38.5"
                21 -> res = "Быт 46.12; 1 Пар 2.5"
                23 -> res = "Быт 46.13"
                26 -> res = "Быт 46.14"
                29 -> res = "Нав 17.1"
                33 -> res = "Нав 17.3"
                57 -> res = "Быт 46.11; Исх 6.16; Чис 3.17; 1 Пар 6.1; 23.6"
                59 -> res = "Исх 2.2; 6.20; 1 Пар 23.13"
                61 -> res = "Лев 10.1; Чис 3.4; 1 Пар 24.2"
                62 -> res = "Чис 14.28; 32.10; Втор 1.35; Пс 105.26; 1 Кор 10.5"
            }
        }
        if (glava == 27) {
            when (stih) {
                1 -> res = "Чис 36.2"
                3 -> res = "Чис 16.1, 30"
                8 -> res = "Тов 6.12"
                12 -> res = "Втор 32.48-49"
                14 -> res = "Втор 32.51"
                18 -> res = "Втор 3.21; 34.9; Быт 48.14; Чис 8.10"
                20 -> res = "Втор 34.9"
                21 -> res = "Исх 28.30"
            }
        }
        if (glava == 28) {
            when (stih) {
                2 -> res = "Лев 3.11; 21.6"
                3 -> res = "Исх 29.38"
                5, 21 -> res = "Исх 16.36"
                11 -> res = "Ис 1.13; 66.23; Кол 2.16"
                14 -> res = "Чис 10.10"
                15 -> res = "Чис 29.5"
                16 -> res = "Исх 12.18; Лев 23.5"
                17 -> res = "Исх 12.15; Втор 16.3"
                19 -> res = "Втор 16.2; 2 Пар 35.7"
                26 -> res = "Лев 23.15-16"
            }
        }
        if (glava == 29) {
            when (stih) {
                1 -> res = "Лев 23.24"
                2 -> res = "Неем 10.33"
                6 -> res = "Евр 13.15-16"
                7 -> res = "Лев 16.29; 23.27; Дан 10.12"
                11 -> res = "Лев 16.5, 10; Неем 12.30"
                12 -> res = "Исх 23.16; Лев 23.34; Ин 7.2"
                35 -> res = "Ин 7.37; Лев 23.36"
            }
        }
        if (glava == 30) {
            when (stih) {
                3 -> res = "Лев 27.2"
                7 -> res = "1 Цар 1.11"
            }
        }
        if (glava == 31) {
            when (stih) {
                2 -> res = "Чис 25.17"
                6 -> res = "Чис 10.9; 25.7-8"
                8 -> res = "Нав 13.21"
                11 -> res = "Втор 20.14"
                16 -> res = "Чис 25.1-2"
                17 -> res = "Суд 21.11"
                19 -> res = "Чис 19.14, 16"
                23 -> res = "Чис 19.9"
                27 -> res = "Нав 8.27; 22.8; 1 Цар 30.24"
                30 -> res = "Чис 3.7"
                41 -> res = "Чис 18.8, 19"
                50 -> res = "Исх 35.22"
                54 -> res = "Нав 6.18"
            }
        }
        if (glava == 32) {
            when (stih) {
                1 -> res = "Быт 46.32; 47.3"
                7 -> res = "Втор 1.28; Деян 21.13"
                8 -> res = "Чис 13.3"
                9 -> res = "Чис 13.24, 32; Втор 1.28"
                10 -> res = "Чис 14.28; 26.65"
                11 -> res = "Чис 14.23; Быт 50.24"
                12 -> res = "Чис 14.30"
                17 -> res = "Втор 3.18"
                18 -> res = "Нав 22.1"
                19 -> res = "Втор 3.12"
                20 -> res = "Нав 1.13"
                24 -> res = "Втор 23.23"
                29 -> res = "Нав 4.12"
                33 -> res = "Втор 3.12; Нав 13.8"
                39 -> res = "Быт 50.23"
                41 -> res = "Нав 13.30; 1 Пар 2.22"
                42 -> res = "Чис 21.25; Суд 8.11; 1 Пар 2.23"
            }
        }
        if (glava == 33) {
            when (stih) {
                3 -> res = "Исх 12.37"
                4 -> res = "Исх 12.12; Ис 10.10"
                6 -> res = "Исх 13.20"
                7 -> res = "Исх 14.2"
                8 -> res = "Нав 4.22; Пс 113.3; 1 Кор 10.1"
                9 -> res = "Исх 15.27"
                11 -> res = "Исх 16.1"
                14 -> res = "Исх 17.1"
                15 -> res = "Исх 19.2"
                16 -> res = "Чис 11.35"
                18 -> res = "Чис 11.35; 13.1"
                31 -> res = "Втор 10.6"
                35 -> res = "3 Цар 9.26"
                36 -> res = "Чис 20.1, 22"
                37 -> res = "Чис 20.22"
                38 -> res = "Чис 20.25; Втор 32.50"
                40 -> res = "Чис 21.1"
                43 -> res = "Чис 21.10"
                44 -> res = "Чис 21.11"
                47 -> res = "Чис 21.1; Втор 34.1"
                48 -> res = "Чис 22.1"
                49 -> res = "Чис 25.1; Нав 2.1"
                50 -> res = "Чис 25.17"
                52 -> res = "Исх 23.24; Втор 7.5; Лев 26.30"
                53 -> res = "Втор 7.2; Нав 11.12"
                54 -> res = "Чис 26.54"
                55 -> res = "Исх 23.33; 34.12; Втор 7.16"
            }
        }
        if (glava == 34) {
            when (stih) {
                2 -> res = "Быт 15.18"
                3 -> res = "Нав 15.1"
                4 -> res = "Нав 15.3"
                5 -> res = "Быт 15.18; Нав 15.4"
                6 -> res = "Нав 15.47"
                10 -> res = "1 Цар 30.28"
                11 -> res = "Втор 3.17; Лк 5.1"
                12 -> res = "Чис 32.33"
                13 -> res = "Нав 14.2; Деян 13.19"
                17 -> res = "Нав 14.1; 21.1"
            }
        }
        if (glava == 35) {
            when (stih) {
                2 -> res = "Нав 21.2"
                5 -> res = "Нав 21.12"
                6 -> res = "Втор 4.42; Нав 20.2"
                7 -> res = "Нав 21.41"
                8 -> res = "Чис 26.56; Гал 6.6"
                11 -> res = "Исх 21.13; Втор 19.2; Нав 20.2"
                12 -> res = "Лев 25.26; Нав 20.3, 6"
                14 -> res = "Втор 4.41; Нав 20.8"
                16 -> res = "Исх 21.12; Лев 24.17"
                19 -> res = "2 Цар 14.7; Исх 21.23"
                20 -> res = "Втор 19.11"
                21 -> res = "Втор 19.12"
                22 -> res = "Втор 19.4"
                25 -> res = "Еф 2.16; Лев 8.12; Пс 44.8"
                29 -> res = "Исх 12.17"
                30 -> res = "Втор 19.15"
                33 -> res = "Быт 9.6; 3 Цар 2.31; Мф 26.52"
                34 -> res = "Исх 29.45; 3 Цар 6.13"
            }
        }
        if (glava == 36) {
            when (stih) {
                1 -> res = "Быт 46.20"
                2, 11 -> res = "Чис 27.1"
                4 -> res = "Лев 25.13, 30"
                6 -> res = "Тов 1.9"
                7 -> res = "Лев 25.23; 3 Цар 21.3"
                8 -> res = "Чис 27.8; Тов 6.12"
                10 -> res = "Чис 27.3-4"
            }
        }
        return res
    }

    fun kniga5(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Чис 33.8"
                2 -> res = "Исх 3.1"
                4 -> res = "Чис 21.24"
                6 -> res = "Исх 19.1; Чис 10.11"
                7 -> res = "Быт 2.14; 15.18"
                8 -> res = "Быт 12.7; 15.18; 17.8"
                9 -> res = "Исх 18.18; Чис 11.14"
                10 -> res = "Быт 15.5"
                15 -> res = "Исх 18.25; Чис 11.16"
                16 -> res = "Ин 7.24"
                17 -> res = "Втор 16.19; 1 Пет 1.17; Лев 19.15; Притч 24.23; Сир 42.1; Иак 2.1"
                19 -> res = "Чис 13.1, 27"
                21 -> res = "Нав 8.1"
                22 -> res = "Чис 13.3-4"
                24 -> res = "Чис 13.24"
                25 -> res = "Чис 13.28"
                27 -> res = "Чис 14.2; Пс 105.24-25"
                28 -> res = "Чис 32.9; Быт 11.4"
                29 -> res = "Нав 2.9"
                30 -> res = "Исх 14.14, 25; Нав 10.14"
                31 -> res = "Исх 19.4; Чис 11.18; Пс 90.12"
                32 -> res = "Пс 77.32; Евр 3.18-19"
                33 -> res = "Исх 13.21"
                35 -> res = "Чис 14.23; 26.65; Евр 3.1"
                37 -> res = "Чис 20.12; Втор 3.26; 4.21; 31.2"
                38 -> res = "Втор 3.28; Чис 34.17; Нав 1.6"
                39 -> res = "Чис 14.31; Иона 4.11"
                40 -> res = "Чис 14.25"
                41 -> res = "Чис 14.40"
                42 -> res = "Втор 23.14"
                43 -> res = "Чис 14.41, 44"
                44 -> res = "Чис 14.45; Пс 117.12; Нав 19.4"
                46 -> res = "Втор 2.14"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Чис 21.4"
                3 -> res = "Суд 5.4"
                4 -> res = "Чис 20.14, 21"
                5 -> res = "1 Цар 14.47; 2 Цар 8.14; 3 Цар 11.15"
                7 -> res = "Втор 1.31; Быт 21.22"
                8 -> res = "4 Цар 14.22; 3 Цар 9.26"
                9 -> res = "2 Пар 20.10"
                10 -> res = "Быт 14.5; Чис 13.23"
                12 -> res = "Быт 14.6; 36.20"
                13 -> res = "Чис 21.12"
                14 -> res = "Втор 1.46; Чис 14.21, 29, 33; 26.65"
                19 -> res = "Суд 11.13, 15; Быт 19.38"
                21 -> res = "Чис 13.23"
                23 -> res = "Быт 10.14; Иер 47.4; Ам 9.7"
                25 -> res = "Нав 2.9"
                26 -> res = "Чис 21.21"
                28 -> res = "Чис 20.19"
                30 -> res = "Чис 20.20; 21.23; Исх 4.21"
                31 -> res = "Ам 2.9"
                33 -> res = "Чис 21.24"
                34 -> res = "Втор 3.6; 13.15; 20.16"
                36 -> res = "2 Цар 24.5; Чис 21.15"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Чис 21.33; Втор 29.7"
                2 -> res = "Чис 21.24, 34"
                3 -> res = "Чис 21.35"
                6 -> res = "Втор 2.34-35; 20.16"
                7 -> res = "Втор 20.14"
                8 -> res = "Чис 34.7"
                9 -> res = "Иез 27.5"
                11 -> res = "Чис 21.31, 33; Нав 12.13; 2 Цар 12.26"
                12 -> res = "Чис 32.33"
                14 -> res = "Чис 32.41; 3 Цар 4.13; 2 Цар 10.6"
                15 -> res = "Быт 50.23; Чис 32.39"
                16 -> res = "Быт 32.22"
                17 -> res = "Чис 34.11-12; Нав 12.3"
                18 -> res = "Чис 32.17, 20, 29"
                19 -> res = "Чис 32.1"
                21 -> res = "Чис 27.18, 22-23"
                22 -> res = "Исх 14.14, 25; Втор 1.30; Нав 23.10"
                24 -> res = "3 Цар 8.42; Пс 67.8; 88.7"
                25 -> res = "3 Цар 4.33"
                26 -> res = "Втор 1.37; 4.21"
                27 -> res = "Втор 31.2"
                28 -> res = "Втор 1.38; Нав 1.6; 14.1"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Втор 12.32"
                2 -> res = "Втор 12.32; Притч 30.6"
                3 -> res = "Чис 25.4; Нав 22.17; Пс 105.28"
                6 -> res = "3 Езд 14.30"
                7 -> res = "Втор 26.19; Пс 144.18; 146.9"
                8 -> res = "3 Цар 2.3; Пс 118.98"
                9 -> res = "Пс 76.12; 104.5; Втор 11.19"
                10 -> res = "3 Езд 3.17"
                11 -> res = "Исх 19.18"
                12 -> res = "Неем 9.13; Ин 1.18"
                13 -> res = "Исх 20.1; 2 Кор 3.3"
                15 -> res = "Нав 23.11; Иер 17.21"
                16 -> res = "Исх 20.4"
                17 -> res = "Рим 1.23"
                19 -> res = "Иер 10.2; Втор 17.3; Мф 5.45"
                20 -> res = "Сир 17.13"
                21 -> res = "Втор 1.37; 3.27; 34.4; Чис 20.12"
                22 -> res = "Втор 34.4-5"
                23 -> res = "Прем 1.12"
                24 -> res = "Евр 12.29"
                26 -> res = "Втор 30.19; 31.28; 32.1"
                27 -> res = "Втор 28.64; Быт 34.30"
                28 -> res = "Втор 28.36"
                29 -> res = "Пс 114.4-5; Прем 1.2"
                30 -> res = "Лев 26.40"
                31 -> res = "Пс 102.8; Ис 11.12"
                33 -> res = "Исх 19.18-19; 20.1; Втор 5.23"
                34 -> res = "Втор 7.19; 29.3; Исх 13.3, 9"
                35 -> res = "Исх 19.16; Втор 32.39; 3 Цар 8.60"
                37 -> res = "Исх 13.3"
                39 -> res = "Нав 2.11"
                40 -> res = "Втор 5.33; 6.3"
                41 -> res = "Втор 19.2"
                42 -> res = "Чис 35.6"
                43 -> res = "Нав 20.8"
                46 -> res = "Втор 1.4-5; 3.29; Чис 21.24"
                47 -> res = "Чис 21.24, 33; Втор 29.7-8"
                48 -> res = "Чис 34.7; Втор 3.9"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Притч 4.4"
                2 -> res = "Исх 19.5"
                3 -> res = "Быт 17.2"
                4 -> res = "Исх 19.16; 20.1; 33.11"
                5 -> res = "Гал 3.19"
                6 -> res = "Исх 20.2; Пс 80.11"
                8 -> res = "Исх 20.4; Лев 26.1; Пс 96.7"
                9 -> res = "Исх 20.5; 34.7; Иер 32.18"
                10 -> res = "Исх 20.6; 34.7; Иер 32.18"
                11 -> res = "Исх 20.7; Лев 19.12; Мф 5.33"
                12 -> res = "Исх 20.8; 31.14; Иез 20.12"
                13 -> res = "Исх 20.9; Лев 23.3"
                14 -> res = "Исх 20.10; Евр 4.4"
                15 -> res = "Втор 16.12; Иер 21.5"
                16 -> res = "Исх 20.12; Сир 3.6; Мф 15.4; Мк 7.10; Еф 6.2-3"
                17 -> res = "Исх 20.13; Мф 5.21, 27; 19.18"
                21 -> res = "Исх 20.17; Рим 7.7; 13.9"
                22 -> res = "Исх 20.1"
                23 -> res = "Исх 20.18"
                24 -> res = "Исх 33.20"
                25 -> res = "Исх 20.19; Суд 13.22"
                26 -> res = "Втор 4.33; Ис 6.5; 40.6"
                27 -> res = "Исх 19.8"
                28 -> res = "Прем 1.6; Втор 18.17"
                29 -> res = "Пс 80.14; Ис 48.18"
                32 -> res = "Втор 17.11; 28.14"
                33 -> res = "Быт 18.19; 3 Цар 3.2"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Иак 1.22"
                2 -> res = "Втор 4.40"
                4 -> res = "Мк 12.29"
                5 -> res = "Мф 22.37; Мк 12.30; Лк 10.27"
                6 -> res = "Втор 4.9"
                7 -> res = "Втор 30.19; Пс 77.5-6"
                10 -> res = "Быт 50.24; Исх 33.1"
                11 -> res = "Втор 8.10"
                13 -> res = "Втор 10.20; 1 Цар 7.3; Мф 4.10; Лк 4.8"
                14 -> res = "Исх 20.2-3"
                16 -> res = "Исх 17.2; Чис 21.5; Мф 4.7; Лк 4.12"
                18 -> res = "Быт 12.7; 13.15"
                19 -> res = "Исх 23.27"
                20 -> res = "Исх 12.26"
                21 -> res = "Исх 1.11, 14; 12.37; 13.3"
                24 -> res = "Пс 66.7"
                25 -> res = "Лев 18.5; Иез 20.11; Мф 19.17"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Исх 23.23; Пс 105.34; Втор 31.3, 7"
                2 -> res = "Чис 33.53; Исх 23.32; 34.12"
                4 -> res = "Исх 23.33; 34.16; Нав 23.13"
                5 -> res = "Исх 23.24; Чис 33.52; 3 Цар 16.33"
                6 -> res = "Втор 14.2; 26.18; Ин 1.12"
                8 -> res = "Втор 10.15; Ис 63.9; Ин 3.16"
                9 -> res = "Втор 4.39; 32.4; 1 Кор 1.9"
                10 -> res = "Исх 14.24; Наум 1.2"
                12 -> res = "Исх 23.22; Лев 26.6"
                14 -> res = "Исх 23.26"
                15 -> res = "Исх 7.17; 8.2; 15.26"
                16 -> res = "Исх 23.24, 33"
                17 -> res = "Втор 8.17"
                19 -> res = "Втор 4.34; 5.15; 29.3"
                20 -> res = "Исх 23.28; Нав 24.12"
                21 -> res = "Втор 31.6"
                22 -> res = "Прем 18.15-16"
                25 -> res = "Втор 12.3; 2 Мак 12.40; 2 Пар 15.16"
                26 -> res = "Нав 6.17; 7.11"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Притч 3.2; 3 Езд 7.21"
                2 -> res = "Втор 29.5; Прем 3.5"
                3 -> res = "Мф 4.4; Лк 4.4"
                4 -> res = "Втор 29.5; Неем 9.21"
                5 -> res = "Втор 1.31; Пс 88.31; Притч 3.12"
                10 -> res = "Втор 6.11-12; Рим 14.6; 1 Тим 4.5"
                14 -> res = "Втор 6.12; 9.12"
                15 -> res = "Исх 17.6; Чис 20.10"
                16 -> res = "Исх 16.14-15; Пс 77.24; Прем 16.20; Ин 6.31; 1 Кор 10.3"
                17 -> res = "Втор 7.17; 9.4"
                18 -> res = "Втор 4.26; 11.28; 30.18"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Втор 7.1; 11.23"
                2 -> res = "Чис 13.23"
                3 -> res = "Исх 24.17; Втор 4.24; Евр 12.29"
                5 -> res = "Прем 12.3"
                7 -> res = "Исх 14.11; 16.2; 17.2; Чис 20.4"
                8, 14 -> res = "Исх 32.10"
                9 -> res = "Исх 24.18; 34.28"
                10 -> res = "Исх 31.18; 32.16; 34.29"
                11 -> res = "Исх 31.18"
                12 -> res = "Исх 32.7"
                13 -> res = "Исх 33.3"
                15 -> res = "Исх 32.15; Евр 12.18"
                17 -> res = "Исх 32.19"
                18 -> res = "Исх 32.31; 34.28 "
                20 -> res = "Исх 32.21"
                21 -> res = "Исх 32.20; 4 Цар 23.12"
                22 -> res = "Чис 11.1, 3, 34; Исх 17.7"
                23 -> res = "Чис 13.3; 14.2"
                25 -> res = "Исх 32.11"
                26 -> res = "Чис 14.13"
                27 -> res = "Исх 32.13"
                28 -> res = "Чис 14.16"
                29 -> res = "Исх 19.5; 32.11"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Исх 34.1"
                2 -> res = "Втор 9.10; Исх 32.19; 34.4; 37.1"
                4 -> res = "Исх 32.16; 34.28; Втор 9.10"
                5 -> res = "3 Цар 8.9"
                6 -> res = "Чис 20.29; 33.31"
                7 -> res = "Чис 33.32"
                8 -> res = "Чис 3.12; 4.25; 18.5, 7"
                9 -> res = "Чис 18.20; Втор 18.2; Иез 44.28"
                10 -> res = "Исх 32.14"
                12 -> res = "Мих 6.8; Втор 6.5; Мф 22.37; Лк 10.27"
                14 -> res = "Быт 14.19; 3 Цар 8.27; Пс 23.1"
                16 -> res = "Втор 30.6; Иер 4.4"
                17 -> res = "2 Пар 19.7; Иов 34.19; Прем 6.7; Сир 35.12; Иер 32.19; Деян 10.34; 1 Пет 1.17; Рим 2.11; Гал 2.6; Еф 6.9; Кол 3.25"
                20 -> res = "Втор 6.13; Мф 4.10; Лк 4.8"
                22 -> res = "Быт 46.27"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Втор 12.1"
                4 -> res = "Исх 14.25; 15.1"
                6 -> res = "Чис 16.30; Пс 105.17"
                9 -> res = "Втор 4.40; 5.33"
                10 -> res = "3 Цар 21.2"
                11 -> res = "Пс 64.10; 103.13"
                12 -> res = "Пс 64.12"
                13 -> res = "Втор 28.1-2"
                14 -> res = "Лев 26.4; Иер 5.24; Ос 6.3"
                16 -> res = "Исх 23.24"
                17 -> res = "Лев 26.19-20; Втор 4.26"
                18 -> res = "Втор 6.6, 8; Притч 6.21; Исх 13.9"
                19 -> res = "Втор 4.9; 6.7"
                20 -> res = "Втор 6.9"
                21 -> res = "Пс 88.30"
                22 -> res = "Втор 6.5"
                23 -> res = "Втор 7.1"
                24 -> res = "Нав 1.3"
                25 -> res = "Исх 23.27"
                26 -> res = "Втор 28.2, 15; 30.1, 15"
                28 -> res = "Втор 8.19; 27.15; 28.15"
                29 -> res = "Втор 27.12; Нав 8.33-34; Суд 9.7"
                30 -> res = "Быт 12.6; 18.1"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Втор 11.1"
                2 -> res = "Исх 34.13"
                5 -> res = "Исх 20.24"
                6 -> res = "Ос 3.4"
                7, 18 -> res = "Втор 14.23"
                9 -> res = "Евр 4.8"
                10 -> res = "3 Цар 8.56"
                11 -> res = "3 Цар 8.29; 4 Цар 21.4; 2 Пар 33.4; Иер 32.34"
                12 -> res = "Чис 18.20, 24; Втор 10.9"
                13 -> res = "Ос 8.11"
                15 -> res = "Втор 14.5"
                16 -> res = "Быт 9.4"
                17 -> res = "Лев 27.30"
                19 -> res = "Втор 14.27"
                20 -> res = "Быт 28.14; Втор 19.8"
                22 -> res = "Втор 15.22"
                23 -> res = "Лев 3.17; 17.14"
                30 -> res = "Втор 18.9; Нав 23.7; Иер 10.2"
                31 -> res = "Лев 18.21; 4 Цар 16.3"
                32 -> res = "Втор 4.1-2; Притч 30.6"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Чис 12.6; Мф 24.24; 3 Цар 13.3"
                2 -> res = "Иер 14.14"
                3 -> res = "Мф 7.15; Суд 2.22; Мф 6.13"
                4 -> res = "Втор 8.6; 10.20; Мих 6.8"
                5 -> res = "Втор 18.20; Иер 14.15; 3 Цар 18.40; 1 Кор 5.13"
                6 -> res = "Втор 17.2; 22.19; Мф 10.37"
                8 -> res = "Втор 19.13"
                9 -> res = "Втор 17.7"
                11 -> res = "Втор 17.13; 19.20"
                13 -> res = "2 Цар 20.1; 3 Цар 21.10; 2 Кор 2.15"
                15 -> res = "Нав 22.12; Втор 2.34"
                17 -> res = "Втор 7.25-26; Нав 6.17; 7.13"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Лев 19.27-28; 3 Цар 18.28"
                2 -> res = "Втор 7.6; 26.18"
                3 -> res = "Деян 10.14"
                4 -> res = "Лев 11.2"
                5 -> res = "Втор 12.15"
                7 -> res = "Лев 11.4"
                8 -> res = "Ис 65.4"
                9 -> res = "Лев 11.9"
                12 -> res = "Лев 11.13"
                21 -> res = "Исх 23.19; 34.26"
                22 -> res = "Лев 27.30; Чис 18.21"
                23 -> res = "Втор 12.7; Мф 21.12"
                25 -> res = "Мф 21.12"
                26 -> res = "Лев 10.9; Втор 27.7"
                27 -> res = "Чис 18.20, 24"
                28 -> res = "Лев 27.30"
                29 -> res = "Притч 10.24-25; 2 Кор 9.6"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Исх 21.2; Лев 25.4; Иер 34.14"
                4 -> res = "Сир 4.1"
                5 -> res = "Втор 28.1-2"
                6 -> res = "Втор 28.11-12"
                7 -> res = "Исх 22.25; Лев 25.35; Мф 5.42"
                8 -> res = "Мф 5.42"
                9 -> res = "2 Кор 6.15"
                10 -> res = "Мф 5.42; Лк 6.30"
                11 -> res = "Мф 26.11"
                12 -> res = "Исх 21.2; Иер 34.14"
                13 -> res = "Быт 21.14; 2 Пар 28.15"
                16 -> res = "Исх 21.5-6"
                19 -> res = "Исх 13.2; 22.30; Чис 3.13"
                20 -> res = "Втор 12.11"
                21 -> res = "Лев 22.20; Сир 35.11"
                22 -> res = "Втор 12.15"
                23 -> res = "Лев 3.17; 17.10; Втор 12.16, 23"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Исх 12.18; Лев 23.5; Чис 9.2"
                2 -> res = "Исх 12.3; Чис 28.19; Втор 12.5"
                3 -> res = "Исх 12.14, 39"
                4 -> res = "Исх 12.10, 20; 2 Пар 35.1, 18"
                6 -> res = "Мк 14.13-14; Лк 2.41-42; Исх 12.6"
                7 -> res = "Исх 12.9; 2 Пар 35.13"
                8 -> res = "Исх 12.15; Лев 23.8"
                9 -> res = "Лев 23.15; Чис 28.26; Лк 6.1"
                10 -> res = "Исх 23.6; 34.22; Втор 26.2"
                11, 14 -> res = "Неем 8.10"
                13 -> res = "Исх 23.16; Лев 23.34; 3 Цар 8.2"
                16 -> res = "Исх 23.17; 34.23; Сир 35.4"
                17 -> res = "Тов 4.8"
                18 -> res = "2 Пар 19.5; Прем 6.5; Пс 81.3"
                19 -> res = "Исх 23.8; Лев 19.15; Втор 1.17; Притч 24.23; Сир 20.29; Ин 7.24; Иак 2.1"
                22 -> res = "Лев 26.1"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Лев 22.20; Втор 15.21; Мал 1.8, 13"
                2 -> res = "Втор 13.6-7"
                3 -> res = "Втор 4.19; Иер 8.2"
                6 -> res = "Втор 19.15; Мф 18.16; Ин 8.17; 2 Кор 13.1; Евр 10.28"
                7 -> res = "Втор 13.9; 1 Кор 5.13"
                8 -> res = "2 Пар 19.10"
                9 -> res = "2 Пар 19.8, 11; Мал 2.7; Мф 23.3"
                11 -> res = "Втор 5.32; 28.14"
                12 -> res = "3 Цар 18.26"
                13 -> res = "Втор 13.11; 19.20; Рим 13.14"
                14 -> res = "1 Цар 8.5; Ос 13.10; Деян 13.21"
                16 -> res = "1 Цар 10.25; 3 Цар 4.26; 10.28"
                17 -> res = "2 Цар 5.13"
                18 -> res = "3 Цар 1.13"
                19 -> res = "Пс 118.12, 24; Мф 5.19"
                20 -> res = "Пс 130.2; Нав 1.7-8"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "Чис 18.20; Втор 10.9; 1 Кор 9.13"
                4 -> res = "Неем 10.37; Иез 44.30"
                9 -> res = "Лев 18.26; Втор 12.30"
                10 -> res = "Лев 20.27; 1 Цар 28.7"
                15 -> res = "Деян 3.22; 7.37"
                16 -> res = "Исх 20.19; Евр 12.18-20"
                18 -> res = "Ин 1.45; 6.14"
                19 -> res = "4 Цар 2.24; Ин 12.48"
                20 -> res = "Втор 13.5; Иер 14.14"
                21 -> res = "Иер 23.31"
                22 -> res = "Иер 28.9"
            }
        }
        if (glava == 19) {
            when (stih) {
                2 -> res = "Исх 21.13; Чис 35.10-11; Втор 4.41; Нав 20.2"
                4 -> res = "Чис 35.22"
                6 -> res = "Чис 35.12"
                7 -> res = "Нав 20.7"
                8 -> res = "Быт 28.14; Втор 12.20"
                9 -> res = "Нав 20.8"
                11 -> res = "Чис 35.20"
                12 -> res = "Чис 35.19, 21; 2 Цар 14.7"
                13 -> res = "Втор 13.8; 3 Цар 2.31"
                14 -> res = "Втор 27.17; Притч 22.28; Ос 5.10"
                15 -> res = "Чис 35.30; Втор 17.6; Мф 18.16; Ин 8.17; 2 Кор 13.1; Евр 10.28"
                17 -> res = "Втор 17.9"
                19 -> res = "Притч 19.5; 1 Кор 5.13"
                20 -> res = "Втор 13.11; 17.13"
                21 -> res = "Исх 21.24; Лев 24.20; Мф 5.38"
            }
        }
        if (glava == 20) {
            when (stih) {
                2 -> res = "Чис 31.6"
                5 -> res = "1 Мак 3.56"
                6 -> res = "Лев 19.23; Втор 28.30"
                7 -> res = "Втор 24.5"
                8 -> res = "Суд 7.3"
                10 -> res = "Чис 21.21"
                13 -> res = "Чис 31.7; 3 Цар 11.16"
                14 -> res = "Чис 31.27"
                17 -> res = "Втор 7.1-2; Нав 6.17"
                19 -> res = "Суд 2.17"
                20 -> res = "Иер 6.6"
            }
        }
        if (glava == 21) {
            when (stih) {
                5 -> res = "Втор 10.8; 17.8-9"
                6 -> res = "Пс 25.6; Мф 27.24"
                11 -> res = "Исх 34.16; Втор 7.3 "
                14 -> res = "Мал 2.16; Мф 19.8; Втор 24.1"
                15 -> res = "Быт 29.30; 1 Цар 1.5-6"
                17 -> res = "Быт 49.3; 4 Цар 2.9"
                18 -> res = "Втор 13.6, 8"
                21 -> res = "Втор 13.11; 17.13; 19.19-20; 1 Кор 5.13"
                23 -> res = "Гал 3.13"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "Исх 23.4"
                4 -> res = "Мф 12.11; Лк 14.5"
                6 -> res = "Притч 12.10"
                8 -> res = "Суд 16.27"
                9, 11 -> res = "Лев 19.19"
                12 -> res = "Чис 15.38; Мф 23.5"
                21 -> res = "Быт 34.7; Нав 7.15; 1 Кор 5.13"
                22 -> res = "Лев 20.10; Ин 8.4-5"
                24 -> res = "1 Кор 5.13"
                26 -> res = "Втор 21.22"
                28 -> res = "Исх 22.16"
                30 -> res = "Быт 35.22; Лев 18.8; Иез 22.10"
            }
        }
        if (glava == 23) {
            when (stih) {
                2 -> res = "Суд 11.1"
                3 -> res = "Неем 13.1"
                4 -> res = "Чис 22.5"
                5 -> res = "Чис 22.12"
                7 -> res = "Быт 25.25; Чис 20.14"
                10 -> res = "Лев 15.16"
                14 -> res = "Лев 26.12"
                16 -> res = "Исх 22.21"
                17 -> res = "Чис 25.8, 11; 3 Цар 3.16"
                18 -> res = "Пс 14.5"
                20 -> res = "Втор 15.3"
                21 -> res = "Чис 30.3; Еккл 5.3"
                25 -> res = "Мф 12.1; Мк 2.23; Лк 6.1"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "Мф 5.31; 19.7-8; Мк 10.4; Лк 16.18; 1 Кор 7.10"
                4 -> res = "Иер 3.1"
                5 -> res = "Втор 20.7"
                7 -> res = "Исх 21.16; 1 Тим 1.10; 1 Кор 5.13"
                8 -> res = "Лев 13.8; 14.3"
                9 -> res = "Чис 12.10"
                12 -> res = "Ам 2.8"
                13 -> res = "Исх 22.26; Иез 33.15"
                14 -> res = "Лев 19.13; Тов 4.14; Сир 34.22"
                16 -> res = "4 Цар 14.6; 2 Пар 25.4; Иез 18.20"
                17 -> res = "Исх 22.21; Лев 19.33; Пс 81.3"
                19 -> res = "Лев 23.22"
            }
        }
        if (glava == 25) {
            when (stih) {
                1 -> res = "Притч 17.15"
                3 -> res = "2 Кор 11.24"
                4 -> res = "1 Кор 9.9; 1 Тим 5.18; Сир 7.24"
                5 -> res = "Мф 22.24; Мк 12.19; Лк 20.28"
                7 -> res = "Руфь 4.4"
                9 -> res = "Руфь 4.7"
                12 -> res = "Втор 13.8"
                13 -> res = "Лев 19.36; Притч 20.10, 23; Иез 45.10"
                15 -> res = "Лев 19.36; Втор 4.40"
                16 -> res = "Втор 17.1"
                17 -> res = "Исх 17.8"
                18 -> res = "Нав 10.19"
                19 -> res = "1 Цар 15.3; Исх 17.14"
            }
        }
        if (glava == 26) {
            when (stih) {
                2 -> res = "Исх 23.19; 34.26"
                5 -> res = "Быт 31.5, 23, 29; 46.5; Исх 12.37"
                6 -> res = "Исх 1.11"
                7 -> res = "Исх 2.23-24"
                8 -> res = "Исх 12.51"
                9 -> res = "Исх 3.8; 13.5"
                10 -> res = "Втор 14.22"
                11 -> res = "Втор 16.14"
                12 -> res = "Лев 27.30"
                13 -> res = "Втор 14.27"
                14 -> res = "Иер 16.7; Иез 24.17"
                15 -> res = "Ис 63.15; Вар 2.16"
                16 -> res = "Втор 6.5"
                17 -> res = "Втор 5.31"
                18 -> res = "Втор 7.6; 14.2"
                19 -> res = "Втор 4.7; 28.1; Иер 13.11"
            }
        }
        if (glava == 27) {
            when (stih) {
                2 -> res = "Нав 3.17"
                3 -> res = "Нав 8.32; Исх 3.8; Втор 26.9"
                5 -> res = "Исх 20.25; Нав 8.31"
                7 -> res = "Втор 14.26"
                9 -> res = "Втор 26.18"
                10 -> res = "Втор 26.17; 28.1"
                12 -> res = "Втор 11.29"
                15 -> res = "Дан 9.11"
                16 -> res = "Исх 21.17; Лев 20.9; Притч 20.20"
                17 -> res = "Втор 19.14"
                19 -> res = "Исх 22.21; Лев 19.33-34; Иер 5.28"
                20 -> res = "Лев 18.8; 20.11; Иез 22.10"
                21 -> res = "Исх 22.19; Лев 18.23"
                22 -> res = "Лев 18.9"
                23 -> res = "Быт 38.18; Лев 18.15"
                24 -> res = "Быт 9.6; Исх 21.12; Лев 24.17"
                25 -> res = "Исх 23.8"
                26 -> res = "Гал 3.10"
            }
        }
        if (glava == 28) {
            when (stih) {
                1 -> res = "Лев 26.3"
                2 -> res = "Втор 11.20; 14.29; 23.20"
                3, 11 -> res = "Втор 30.9"
                6 -> res = "Пс 120.8"
                7 -> res = "Лев 26.7"
                8 -> res = "Лев 25.21; Втор 15.10"
                9 -> res = "Втор 7.6; 29.13"
                10 -> res = "Ис 43.7; Иер 14.9; 15.16"
                12 -> res = "Лев 26.4; Втор 14.29; 15.6"
                14 -> res = "Втор 5.32; 8.19; Нав 1.7"
                15 -> res = "Лев 26.14; Плач 2.17; Дан 9.11; Мал 2.2; Вар 2.10"
                20 -> res = "Суд 2.15"
                21 -> res = "Лев 26.16; Иез 14.21"
                22 -> res = "3 Цар 8.37; 17.1"
                23 -> res = "Лев 26.19"
                25 -> res = "Лев 26.17; 2 Пар 29.8; Иер 15.4"
                26 -> res = "Иер 7.33"
                27 -> res = "Исх 9.9"
                28 -> res = "Рим 1.28"
                29 -> res = "Иов 5.14; Ис 59.10"
                30 -> res = "2 Цар 12.11; Иер 6.12; Лев 26.16"
                33 -> res = "Суд 6.3; Иер 5.17"
                35 -> res = "Ис 1.6"
                36 -> res = "Втор 4.28"
                37 -> res = "3 Цар 9.7; Иер 24.9; Иез 5.15"
                38 -> res = "Мих 6.15; Агг 1.6"
                40 -> res = "Иоил 1.10"
                41 -> res = "Ос 9.12"
                47 -> res = "Втор 31.20; 32.15; Неем 9.26"
                48 -> res = "Иер 28.14; Плач 5.8"
                49 -> res = "Иер 5.15; Ос 8.1; Ис 33.19"
                50 -> res = "Плач 5.12; Дан 8.23"
                52 -> res = "Лк 19.43"
                53 -> res = "Лев 26.29; 4 Цар 6.28-29; Плач 2.20"
                58 -> res = "Иак 2.10"
                59 -> res = "Иез 7.7"
                60 -> res = "Исх 8.5; Втор 7.15"
                62 -> res = "Втор 4.27; 10.22"
                63 -> res = "Ис 1.24; Соф 3.17; Притч 1.26"
                64 -> res = "Втор 4.27; Неем 1.8; Иер 9.16"
                66 -> res = "Зах 12.10; Откр 1.7; Пс 21.16"
                68 -> res = "Ос 9.3; Втор 17.16; Иер 17.4"
            }
        }
        if (glava == 29) {
            when (stih) {
                1 -> res = "Втор 5.2"
                2 -> res = "Исх 19.4"
                3 -> res = "Втор 4.34; 7.15"
                4 -> res = "Еф 4.18; Ис 6.9-10"
                5 -> res = "Втор 8.2"
                7 -> res = "Втор 3.1; Чис 21.33"
                8 -> res = "Чис 21.24; 32.33; Нав 13.8"
                11 -> res = "Нав 9.27"
                13 -> res = "Быт 12.2; 17.7; 4 Цар 13.23"
                14 -> res = "Втор 5.3; Нав 24.25"
                15 -> res = "Деян 2.39"
                18 -> res = "Евр 12.15"
                19 -> res = "Ис 66.3, 5; Иер 44.16-18; Зах 11.5"
                20 -> res = "2 Пет 2.20; Евр 6.8; Втор 28.15"
                23 -> res = "Быт 19.25"
                24 -> res = "3 Цар 9.8; Иер 22.8"
                25 -> res = "3 Цар 9.8-9; 2 Пар 7.21-22; Иер 22.8"
                26 -> res = "Нав 24.20"
                29 -> res = "1 Тим 3.16; Пс 24.14"
            }
        }
        if (glava == 30) {
            when (stih) {
                1 -> res = "Втор 28.9, 15"
                2 -> res = "Пс 105.45"
                3 -> res = "Иер 23.3; 29.14"
                4 -> res = "3 Езд 1.30; 2 Мак 1.29; 2.18"
                6 -> res = "Пс 50.12; Иер 4.4; Деян 7.51"
                9 -> res = "Втор 28.3, 11; Иер 32.41"
                11 -> res = "Ис 45.19; 48.16"
                12 -> res = "Рим 10.6"
                15 -> res = "Втор 11.26; 28.2; Сир 15.17"
                17 -> res = "Лев 26.14; Втор 28.15"
                18 -> res = "Втор 4.26; 8.19; 11.17"
                19 -> res = "Втор 4.26; Ис 1.2; Иер 21.8"
                20 -> res = "Втор 4.40; Ин 6.27; Быт 50.24"
            }
        }
        if (glava == 31) {
            when (stih) {
                2 -> res = "Втор 1.37; 3.27; 4.21"
                3 -> res = "Втор 7.1"
                4 -> res = "Чис 21.24"
                5 -> res = "Втор 7.1-2"
                6 -> res = "Втор 7.21"
                7 -> res = "Чис 27.18, 22; Втор 1.29; Нав 1.1, 6"
                8 -> res = "Нав 1.5"
                10 -> res = "Лев 23.34; 25.10; Неем 8.18"
                11 -> res = "Неем 8.1; 13.1; Нав 8.35"
                12 -> res = "Еккл 12.1"
                14 -> res = "Чис 20.24; 27.13; Ис 38.1"
                15 -> res = "Исх 33.9; Чис 9.17; Пс 98.7"
                16 -> res = "2 Цар 7.12; 3 Цар 1.21; Ин 11.11"
                17 -> res = "Ос 2.6"
                18 -> res = "Втор 32.20"
                19 -> res = "Откр 15.3"
                20 -> res = "Быт 50.24; Втор 28.47; 32.15; Ам 5.25-26; Деян 7.42-43"
                21 -> res = "Пс 138.2"
                23 -> res = "Нав 1.6"
                24 -> res = "4 Цар 22.8"
                27 -> res = "Мк 10.5"
                28 -> res = "Втор 4.26"
            }
        }
        if (glava == 32) {
            when (stih) {
                1 -> res = "Втор 31.28; Неем 9.27; Ис 1.2"
                2 -> res = "Ис 55.10"
                3 -> res = "Откр 14.7"
                4 -> res = "2 Цар 22.2; 1 Кор 1.9"
                5 -> res = "Ис 1.4"
                6 -> res = "Мф 6.9"
                7 -> res = "Пс 76.12"
                8 -> res = "Быт 11.8; Деян 17.26"
                9 -> res = "1 Цар 10.1; 2 Цар 14.16"
                10 -> res = "Ос 13.5"
                11 -> res = "Исх 19.4"
                12 -> res = "Исх 13.21"
                13 -> res = "Втор 33.29; Чис 20.8; 1 Цар 14.26"
                14 -> res = "Иер 5.7"
                15 -> res = "Втор 31.20; Ос 8.13; Ис 17.10"
                17 -> res = "Пс 105.37"
                18 -> res = "Вар 4.8"
                20 -> res = "Втор 31.18; Притч 14.12"
                21 -> res = "Рим 10.19"
                22 -> res = "Иер 15.14"
                24 -> res = "Авв 2.17"
                25 -> res = "Плач 1.20"
                29 -> res = "Иер 9.12"
                30 -> res = "Лев 26.8; Ос 14.10"
                32 -> res = "Быт 18.20; Ис 1.9; 17.10; Иер 23.14"
                35 -> res = "Сир 28.1; Рим 12.19; Евр 10.30"
                36 -> res = "Пс 134.14"
                37 -> res = "3 Цар 18.27; Иер 2.28"
                38 -> res = "Лев 3.17"
                39 -> res = "Втор 4.35; Ис 45.5; 1 Цар 2.6; Тов 13.2; Прем 16.13"
                40 -> res = "Быт 22.16; Иер 10.10"
                43 -> res = "Рим 15.10; Чис 14.9; Ис 11.11"
                44 -> res = "2 Мак 7.6"
                47 -> res = "Ис 38.16; Исх 20.12; Втор 11.9"
                49 -> res = "Чис 27.12-13"
                50 -> res = "Чис 20.25; 33.38"
                51 -> res = "Чис 20.12; 27.14; Пс 80.8"
                52 -> res = "Чис 20.12"
            }
        }
        if (glava == 33) {
            when (stih) {
                1 -> res = "Сир 3.8-9"
                2 -> res = "Суд 5.4; Пс 67.18; Авв 3.3"
                3 -> res = "Прем 3.1"
                4 -> res = "Пс 147.8"
                6 -> res = "Быт 49.3"
                7 -> res = "Быт 49.10; Евр 7.14"
                8 -> res = "Исх 17.7; 28.30; Чис 20.13"
                9 -> res = "Исх 32.27-28; Мф 4.22; 10.37"
                12 -> res = "Нав 18.11"
                13 -> res = "Быт 27.28; 49.22-25"
                16 -> res = "Исх 3.2"
                17 -> res = "Чис 23.22; Быт 48.19-20"
                19 -> res = "Пс 50.19, 21"
                20 -> res = "Быт 49.19"
                22 -> res = "Нав 19.47"
                23 -> res = "Быт 49.21"
                24 -> res = "Нав 19.24"
                28 -> res = "Иер 23.6; 33.16"
                29 -> res = "2 Цар 7.10; 22.35; Пс 65.3"
            }
        }
        if (glava == 34) {
            when (stih) {
                1 -> res = "2 Мак 2.4"
                3 -> res = "4 Цар 2.4-5; Быт 19.22"
                4 -> res = "Втор 4.21; Быт 12.7; 13.15; 15.18; 26.3"
                5 -> res = "Чис 20.12; Нав 24.29"
                6 -> res = "Втор 32.50; Иуд 1.9"
                7 -> res = "Втор 31.2"
                8 -> res = "Чис 20.29"
                9 -> res = "Деян 8.17; Чис 27.18"
                10 -> res = "Мф 12.41; Исх 33.11; Чис 12.8"
            }
        }
        return res
    }

    fun kniga6(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Исх 17.9; Чис 27.18"
                2 -> res = "Втор 34.5"
                3 -> res = "Втор 11.24; Нав 14.9"
                4 -> res = "Исх 23.31"
                5 -> res = "Евр 13.5"
                6 -> res = "Втор 1.38; 3.28; 31.7"
                7 -> res = "Евр 3.5"
                8 -> res = "Пс 1.2"
                11 -> res = "Нав 3.2"
                13 -> res = "Чис 32.20"
                14 -> res = "Чис 32.29; Нав 4.12"
                16 -> res = "Исх 19.8"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Нав 7.2; Чис 25.1; Иак 2.25; Евр 11.31"
                4 -> res = "Нав 6.16"
                9 -> res = "Чис 21.3"
                10 -> res = "Исх 14.21; Чис 21.23-24"
                11 -> res = "Исх 15.14; Втор 4.39"
                12 -> res = "Нав 6.16, 22"
                14 -> res = "Нав 6.21"
                15 -> res = "2 Кор 11.32"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Нав 6.12; Чис 25.1"
                5 -> res = "Исх 19.10; Лев 20.7"
                6 -> res = "Чис 4.15"
                7 -> res = "Нав 4.14"
                10 -> res = "Иер 10.10; Быт 15.19; Исх 3.8"
                11 -> res = "Деян 7.45; Пс 8.2"
                13 -> res = "Пс 113.3"
                14 -> res = "Деян 7.45"
                15 -> res = "1 Пар 12.15; Сир 24.28"
                16 -> res = "Исх 14.21; Авв 3.9"
            }
        }
        if (glava == 4) {
            when (stih) {
                7 -> res = "Нав 3.13"
                12 -> res = "Чис 32.29"
                14 -> res = "Нав 3.7"
                19 -> res = "Исх 12.2"
                23 -> res = "Исх 14.21; Пс 77.13; 113.3"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Втор 11.25; Нав 2.9"
                2 -> res = "Исх 4.25"
                4 -> res = "Чис 14.23"
                6 -> res = "Исх 3.8"
                9 -> res = "Быт 34.14; Исх 16.3; Ос 4.15"
                10 -> res = "Исх 12.6"
                11 -> res = "Лев 2.14"
                12 -> res = "Неем 9.20"
                13 -> res = "Исх 23.23"
                14 -> res = "Дан 10.13; 12.1"
                15 -> res = "Исх 3.5"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Нав 24.11"
                12 -> res = "Нав 3.1; 7.16; 8.10"
                16 -> res = "Нав 2.4"
                17 -> res = "Лев 27.28; Втор 7.26; Нав 7.5"
                18 -> res = "Чис 31.54"
                19 -> res = "Евр 11.30; 2 Мак 12.15"
                20 -> res = "Нав 10.30"
                21 -> res = "Нав 2.14"
                22 -> res = "Евр 11.31"
                24 -> res = "Мф 1.5"
                25 -> res = "3 Цар 16.34"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Нав 22.20; 1 Пар 2.7"
                2 -> res = "Нав 2.1"
                5 -> res = "Нав 8.5"
                6 -> res = "Чис 14.6; 1 Цар 4.12; 2 Цар 13.19"
                9 -> res = "Исх 32.12; Чис 14.13; Иоил 2.17"
                13 -> res = "Нав 3.5; 6.17"
                14 -> res = "1 Цар 10.20; Притч 16.33; Иона 1.7"
                15 -> res = "Чис 15.30; Втор 13.17; Быт 34.7"
                16 -> res = "Нав 8.10"
                19 -> res = "Лк 17.18; Ин 9.24; 1 Цар 14.43"
                24 -> res = "Нав 22.20"
                25 -> res = "Мф 7.2; Чис 15.36"
                26 -> res = "2 Цар 18.17; Ис 65.10"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Втор 1.21; 7.18; 20.3"
                2 -> res = "Нав 6.20-21; Суд 20.29"
                4 -> res = "2 Пар 13.13"
                5, 6 -> res = "Нав 7.4"
                10 -> res = "Нав 6.12; 7.16"
                22 -> res = "Чис 21.35; Втор 7.2"
                26 -> res = "Исх 17.9, 11-12"
                29 -> res = "Втор 21.23; 2 Цар 18.17"
                31 -> res = "Исх 20.25; Втор 27.5"
                32 -> res = "Втор 17.18; 27.3"
                33 -> res = "Втор 11.29; 27.12-13; Суд 9.7"
                34 -> res = "Втор 28.1-2"
                35 -> res = "Втор 31.11"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Нав 3.10"
                3 -> res = "2 Цар 2.12; 3 Цар 3.4"
                6 -> res = "Нав 5.9"
                7 -> res = "Исх 23.32; Втор 7.2"
                10 -> res = "Чис 21.24"
                14 -> res = "Исх 25.22; Чис 27.21; 1 Цар 23.9"
                17 -> res = "Нав 18.25; 1 Пар 2.50"
                18, 26 -> res = "Нав 11.19"
                20 -> res = "2 Цар 21.1-2; 3 Цар 9.21"
                23 -> res = "Неем 10.28"
                24 -> res = "Втор 7.2"
                27 -> res = "1 Пар 9.2; 2 Пар 2.18; 1 Езд 8.20"
            }
        }
        if (glava == 10) {
            when (stih) {
                8 -> res = "Нав 11.6; 24.11"
                9 -> res = "Нав 11.7"
                10 -> res = "Исх 23.27; Втор 11.25; 3 Цар 9.17"
                11 -> res = "Ис 28.21; Прем 5.23; Сир 46.6"
                12 -> res = "Ис 28.21; Сир 46.5"
                13 -> res = "4 Цар 20.11; Ис 28.21; 2 Цар 1.18"
                14 -> res = "Исх 14.14, 25; Втор 1.30"
                19 -> res = "Втор 25.18"
                24 -> res = "Быт 3.15; Лк 10.19; Рим 16.20"
                26, 27 -> res = "Втор 21.23; Нав 8.29"
                28 -> res = "Втор 20.16; Нав 6.20"
                32 -> res = "Нав 15.39; Чис 21.35"
                33 -> res = "3 Цар 9.15; Нав 8.22; 11.8"
                38 -> res = "Нав 13.26"
                40 -> res = "Нав 12.8; Втор 7.2; 20.16; Исх 23.32; 34.12"
                42 -> res = "Исх 14.14; Втор 1.30; 3.22"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "4 Цар 15.29"
                2 -> res = "Лк 5.1"
                3 -> res = "Нав 6.1; 24.11"
                4 -> res = "1 Мак 11.1"
                6 -> res = "Нав 10.8"
                8 -> res = "Нав 24.11; Быт 10.15"
                10 -> res = "3 Цар 9.15; Иер 49.28"
                11 -> res = "Чис 33.52; Втор 20.16; Суд 4.2"
                12 -> res = "Чис 33.52-53; Втор 7.2"
                15 -> res = "Исх 34.11"
                16 -> res = "Нав 10.41"
                19 -> res = "Нав 9.18"
                20 -> res = "Нав 24.12"
                21 -> res = "Чис 13.23"
                22 -> res = "Иер 47.5; 2 Цар 21.20; 1 Цар 17.4"
                23 -> res = "Нав 14.15"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Чис 21.13"
                2 -> res = "Чис 21.24; Ис 16.2; Быт 32.22"
                3 -> res = "Чис 33.49; 34.11; Быт 14.3"
                4 -> res = "Нав 13.12; Втор 1.4"
                5 -> res = "Втор 3.13; 1 Цар 27.8"
                6 -> res = "Чис 21.24; 32.33"
                7 -> res = "Нав 10.40"
                9 -> res = "Нав 6.1; 8.29"
                10 -> res = "Нав 10.1"
                11 -> res = "Нав 10.3"
                12 -> res = "Нав 10.33"
                13 -> res = "Нав 10.39"
                16 -> res = "Нав 10.28"
                17 -> res = "3 Цар 4.10"
                20 -> res = "Нав 11.1"
            }
        }
        if (glava == 13) {
            when (stih) {
                3 -> res = "Иер 2.18"
                5 -> res = "3 Цар 5.18; Пс 82.8"
                6 -> res = "Пс 77.55"
                8 -> res = "Чис 32.33; Нав 22.4"
                9 -> res = "Втор 2.36; Нав 12.2"
                12 -> res = "Быт 14.15; Чис 21.33"
                14 -> res = "Чис 18.20; Втор 10.9; 18.2; Иез 44.28; Евр 7.5"
                16 -> res = "2 Цар 24.5; Ис 15.2"
                17 -> res = "Ис 15.2"
                19 -> res = "Ис 16.8"
                21 -> res = "Чис 31.8"
                22 -> res = "Чис 22.5; 24.25; 31.8"
                25 -> res = "Суд 5.17; 2 Цар 11.1"
                26 -> res = "2 Цар 2.8; Нав 10.38"
                27 -> res = "Ис 15.6"
                30 -> res = "Чис 32.41"
                33 -> res = "Чис 18.20"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Чис 34.2, 17"
                2 -> res = "Чис 34.13; Деян 13.19"
                3 -> res = "Чис 18.20; 32.33; Втор 3.12; 10.9; Нав 13.14"
                4 -> res = "Чис 35.3"
                5 -> res = "Чис 34.16"
                6 -> res = "Чис 14.24"
                7 -> res = "Чис 13.7, 17"
                8 -> res = "Чис 13.31, 33; 14.6"
                9 -> res = "Нав 1.3"
                11 -> res = "Втор 34.7; Сир 46.11"
                13 -> res = "Чис 14.24; Суд 1.20; 1 Мак 2.56"
                15 -> res = "Нав 15.13"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Чис 34.3"
                2 -> res = "Нав 18.19"
                3 -> res = "Быт 14.7; Чис 34.4"
                4 -> res = "Чис 34.5"
                6 -> res = "Нав 18.17"
                8 -> res = "Неем 11.4; Нав 18.14-15"
                10 -> res = "Нав 21.16; 1 Цар 6.12; 4 Цар 14.11"
                13 -> res = "Нав 14.13"
                14 -> res = "Суд 1.10"
                16 -> res = "1 Цар 18.25; Суд 1.12-13"
                19 -> res = "Быт 33.11"
                21 -> res = "Неем 11.25"
                25 -> res = "2 Цар 13.23"
                32 -> res = "Зах 14.10; Нав 19.6-7"
                33 -> res = "Нав 19.41"
                35 -> res = "Мих 1.15"
                39 -> res = "Нав 10.32; 4 Цар 14.19"
                42 -> res = "Нав 10.29"
                44 -> res = "Нав 19.29; 2 Пар 14.9"
                45 -> res = "4 Цар 1.2"
                47 -> res = "Чис 34.6"
                51 -> res = "Нав 10.41"
                55 -> res = "1 Цар 23.25"
                60 -> res = "Нав 18.14"
                62 -> res = "2 Пар 20.2"
                63 -> res = "Суд 1.8; 2 Цар 5.6"
            }
        }
        if (glava == 16) {
            when (stih) {
                2 -> res = "Быт 28.19"
                3 -> res = "1 Пар 6.67-68"
                4 -> res = "Быт 48.5"
                5 -> res = "Чис 26.35"
                9 -> res = "Нав 17.9"
                10 -> res = "Нав 13.13; Суд 1.29"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Быт 46.20; Чис 26.29; 32.39"
                2 -> res = "Чис 26.29, 32"
                3 -> res = "Чис 26.33; 27.1; 36.11"
                4 -> res = "Чис 27.7"
                9 -> res = "Нав 16.9"
                11 -> res = "Суд 1.27; 1 Цар 31.10; 4 Цар 9.27"
                12 -> res = "Нав 15.63"
                13 -> res = "Втор 20.16; Нав 13.13"
                14 -> res = "Чис 26.54; Быт 48.16"
                16 -> res = "Суд 1.19; Ос 1.5"
                18 -> res = "Нав 13.6; 1 Ин 5.4"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "Нав 21.2; 3 Цар 13.2"
                7 -> res = "Иез 44.28; Чис 32.33; Втор 3.12"
                9 -> res = "2 Цар 24.8"
                11 -> res = "Втор 33.12"
                12 -> res = "Нав 7.2"
                13 -> res = "Быт 12.8; Нав 16.2; 3 Цар 9.17"
                14 -> res = "Нав 15.9, 60"
                16 -> res = "Нав 15.7"
                17 -> res = "Нав 22.10"
                19 -> res = "Нав 15.2"
                23 -> res = "Втор 2.23"
                24 -> res = "3 Цар 15.22"
                25 -> res = "Нав 9.17"
                28 -> res = "Неем 11.4"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "Втор 33.6; Быт 49.7"
                2 -> res = "1 Пар 4.28"
                3 -> res = "1 Пар 4.29"
                4 -> res = "Втор 1.44"
                8 -> res = "1 Пар 4.33"
                10, 33 -> res = "Мф 4.13"
                11 -> res = "Суд 4.7"
                13 -> res = "4 Цар 14.25"
                15 -> res = "Суд 17.7"
                18 -> res = "1 Цар 29.1; 2 Цар 2.9; 3 Цар 18.45"
                26 -> res = "3 Цар 18.19"
                27 -> res = "3 Цар 9.13"
                28 -> res = "Быт 10.19; Нав 11.8"
                34 -> res = "Втор 33.23"
                35 -> res = "Чис 13.22; 3 Цар 8.65"
                40 -> res = "Суд 18.1"
                41 -> res = "Нав 15.33"
                43 -> res = "3 Цар 4.9"
                44 -> res = "3 Цар 15.27"
                46 -> res = "Иона 1.3; Деян 9.36"
                47 -> res = "Втор 33.22; Суд 18.7"
                49 -> res = "Чис 14.6"
                50 -> res = "Нав 14.6; 24.30; Суд 2.9"
            }
        }
        if (glava == 20) {
            when (stih) {
                2 -> res = "Чис 35.11; Втор 19.2"
                3, 6 -> res = "Чис 35.12"
                7 -> res = "Втор 19.7"
                8 -> res = "Втор 4.43"
            }
        }
        if (glava == 21) {
            when (stih) {
                2 -> res = "Чис 35.2"
                3 -> res = "1 Пар 6.64"
                4 -> res = "2 Пар 31.15"
                10 -> res = "1 Пар 6.54"
                11 -> res = "Нав 14.13; 15.13"
                12 -> res = "1 Пар 6.56"
                13 -> res = "Нав 10.29"
                16 -> res = "Нав 15.10; 1 Цар 6.9"
                17 -> res = "2 Цар 2.12; Иер 28.1"
                18 -> res = "3 Цар 2.26; Ис 10.30; Иер 1.1"
                20 -> res = "1 Пар 6.61"
                21 -> res = "Нав 20.7"
                25 -> res = "Суд 1.27"
                27 -> res = "1 Пар 6.62; Нав 20.8"
                30 -> res = "1 Пар 6.74"
                32 -> res = "Нав 20.7"
                34 -> res = "1 Пар 6.63"
                38 -> res = "Нав 20.8"
                39 -> res = "Иер 49.3"
                41 -> res = "Чис 35.7"
                42 -> res = "Чис 35.5"
                43 -> res = "Быт 12.7; 13.17"
                44 -> res = "Нав 22.4"
                45 -> res = "1 Цар 3.19; Ис 34.16; Мк 7.30"
            }
        }
        if (glava == 22) {
            when (stih) {
                2 -> res = "Чис 32.18; Втор 3.18"
                4 -> res = "Нав 13.8; Чис 32.33"
                5 -> res = "Втор 8.6; 10.12"
                7 -> res = "Чис 32.33; Нав 13.8"
                8 -> res = "Чис 31.27; 1 Цар 30.26"
                10 -> res = "Нав 18.17"
                12 -> res = "Втор 13.12"
                16 -> res = "Лев 17.8-9"
                17 -> res = "Чис 25.3; Втор 4.3"
                19 -> res = "Нав 18.1"
                20 -> res = "Нав 7.1; 1 Пар 2.7"
                22 -> res = "Втор 10.17; Пс 49.1"
                27 -> res = "Быт 31.48; Нав 24.27"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "Нав 21.44; 22.4"
                2 -> res = "Нав 24.1"
                3 -> res = "Втор 9.5"
                5 -> res = "Исх 14.14; Втор 6.19"
                6 -> res = "Втор 5.32"
                7 -> res = "Исх 23.13; Пс 15.4; Иер 5.7"
                9 -> res = "Лев 26.7"
                10 -> res = "Лев 26.8; Суд 3.31"
                11 -> res = "Втор 4.15"
                12 -> res = "Втор 7.3; Неем 10.30"
                13 -> res = "Суд 2.3; Чис 33.55; Втор 7.4"
                14 -> res = "3 Цар 2.2; Нав 21.45; 1 Цар 3.19"
                16 -> res = "Лев 26.14; 3 Цар 9.6-7"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "Нав 23.2; 3 Цар 12.1; 2 Пар 10.1"
                2 -> res = "Быт 11.26"
                3 -> res = "Быт 11.31; 21.2"
                4 -> res = "Быт 25.26; 36.8; 46.6"
                5 -> res = "Исх 3.10"
                6 -> res = "Исх 12.37; 14.9"
                8 -> res = "Чис 21.25"
                9 -> res = "Чис 22.5"
                11 -> res = "Нав 6.1; 11.3; Исх 23.23"
                12 -> res = "Исх 23.28; Втор 7.20; Нав 11.20"
                13 -> res = "Втор 6.10"
                14 -> res = "Исх 20.2; Лев 26.1; Иез 23.3"
                15 -> res = "3 Цар 18.21; Лк 11.23"
                19 -> res = "Втор 4.24; Евр 12.29"
                20 -> res = "Втор 29.25-28; Нав 23.15-16"
                23 -> res = "Быт 35.2; 1 Цар 7.3"
                24 -> res = "Иер 42.6"
                25 -> res = "Втор 29.14; 4 Цар 23.3"
                26 -> res = "Суд 9.6"
                27 -> res = "Быт 31.48; Нав 22.27; Ис 19.20"
                28 -> res = "Суд 2.6"
                29 -> res = "Втор 34.5; Суд 2.8; Быт 50.26"
                30 -> res = "Нав 19.50; Суд 2.9"
                32 -> res = "Быт 23.16; 50.25; Деян 7.16"
            }
        }
        return res
    }

    fun kniga7(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Чис 27.21; Суд 20.18"
                2 -> res = "Быт 49.8"
                3 -> res = "Втор 33.7"
                4 -> res = "1 Цар 11.8"
                6 -> res = "2 Цар 4.12"
                7 -> res = "Лев 24.20; Мф 7.2"
                8, 21 -> res = "Нав 15.63; 18.28"
                10 -> res = "Нав 15.14"
                11 -> res = "Нав 12.13; 15.15"
                12 -> res = "Нав 15.16"
                13 -> res = "1 Пар 4.13"
                14 -> res = "Нав 15.18"
                15 -> res = "Быт 33.11"
                16 -> res = "1 Цар 15.6"
                17 -> res = "Втор 2.34; Чис 14.45"
                18 -> res = "4 Цар 1.2"
                19 -> res = "Нав 17.16"
                20 -> res = "Чис 14.24; Нав 14.13; 15.13"
                22 -> res = "Нав 16.1"
                23 -> res = "Быт 28.19"
                25 -> res = "Нав 6.24"
                26 -> res = "Нав 16.2"
                27 -> res = "Нав 17.11; 21.25; 1 Цар 31.10"
                29 -> res = "Нав 16.10; 21.21"
                31 -> res = "Нав 15.44; 19.29"
                34 -> res = "Суд 18.1"
                35 -> res = "Нав 19.42"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Исх 3.2; 14.19; Быт 17.7"
                2 -> res = "Исх 23.32; 34.13"
                3 -> res = "Нав 23.13; Исх 23.33; 34.12"
                6 -> res = "Нав 24.28"
                7 -> res = "Нав 24.31"
                8 -> res = "Нав 24.29"
                9 -> res = "Нав 19.50"
                11 -> res = "Суд 3.7"
                12 -> res = "Притч 29.18"
                13 -> res = "Чис 25.3; Суд 8.33"
                14 -> res = "Суд 3.8; Пс 43.13; Ис 50.1"
                16 -> res = "Суд 3.9; Деян 13.20"
                17 -> res = "Лев 17.7"
                18 -> res = "Суд 10.16"
                20 -> res = "Суд 3.8"
                21 -> res = "Нав 23.13"
                22 -> res = "Втор 8.2; Суд 3.4; Мф 6.13"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Исх 23.29; Втор 7.22"
                3 -> res = "Нав 13.3; Втор 3.8"
                4 -> res = "Втор 8.2; Суд 2.22"
                6 -> res = "Исх 23.32; 34.16; Втор 7.3"
                7 -> res = "Иер 7.9"
                8 -> res = "Суд 2.14"
                9 -> res = "Нав 15.17; Суд 2.16; 4.3"
                11 -> res = "Суд 8.28"
                12 -> res = "Суд 4.1; 6.1; 1 Цар 12.9"
                20 -> res = "Чис 23.16"
                31 -> res = "Суд 5.6"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "1 Цар 12.9"
                3 -> res = "Суд 3.9; Нав 17.16"
                6 -> res = "1 Цар 12.11"
                7 -> res = "Суд 5.21; 3 Цар 18.40"
                10 -> res = "Суд 5.18"
                11 -> res = "Чис 10.29; 24.21"
                14 -> res = "2 Цар 5.24"
                15, 23, 17 -> res = "Пс 82.10"
                16 -> res = "Суд 3.29"
                19 -> res = "Суд 5.25"
                21 -> res = "Иудифь 13.1"
            }
        }
        if (glava == 5) {
            when (stih) {
                4 -> res = "Втор 33.2; Пс 67.8"
                5 -> res = "Исх 19.18"
                6 -> res = "Суд 3.31"
                8 -> res = "1 Цар 13.22"
                10 -> res = "Суд 10.4"
                14 -> res = "Суд 3.15; 1 Пар 2.55"
                15 -> res = "Быт 49.14"
                17 -> res = "Нав 13.24-25; 19.24, 40"
                18 -> res = "Суд 4.10; Деян 15.26"
                19 -> res = "Пс 75.6"
                20 -> res = "Исх 14.14; Нав 10.11"
                21 -> res = "Суд 4.7"
                22 -> res = "Пс 75.7"
                23 -> res = "Суд 2.1"
                25 -> res = "Суд 4.19"
                26 -> res = "Иудифь 13.8-9"
                31 -> res = "Пс 82.18; 2 Цар 23.4; Дан 12.3"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Суд 3.12; Чис 25.17-18"
                2 -> res = "2 Цар 17.9"
                3 -> res = "Втор 28.33; Суд 8.11"
                5 -> res = "Суд 7.12"
                7 -> res = "Суд 3.9"
                10 -> res = "4 Цар 17.35"
                11 -> res = "Суд 2.1; 5.23; 1 Цар 12.11"
                12 -> res = "Руфь 2.4; Лк 1.28"
                13 -> res = "Пс 12.2"
                14 -> res = "1 Цар 12.11"
                15 -> res = "Исх 4.10; 1 Цар 9.21"
                16 -> res = "Исх 3.12; Чис 14.15"
                17 -> res = "Лк 2.12"
                18 -> res = "Суд 13.15"
                21 -> res = "Лев 9.24"
                22 -> res = "Быт 16.13; Исх 19.21"
                23 -> res = "Суд 19.20; 1 Цар 25.6"
                24 -> res = "Быт 22.14; Исх 17.15; Ис 9.6"
                25 -> res = "Втор 7.5"
                29 -> res = "Суд 15.6"
                31 -> res = "3 Цар 18.21"
                32 -> res = "Суд 7.1; 1 Цар 12.11; 2 Цар 11.21"
                33 -> res = "Ос 1.5"
                34 -> res = "Суд 11.29; 1 Цар 16.13"
                37 -> res = "Пс 71.6"
                39 -> res = "Быт 18.32"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Суд 6.32"
                2 -> res = "Втор 8.17"
                3 -> res = "Втор 20.8"
                4 -> res = "1 Цар 14.6"
                7 -> res = "2 Пар 14.11; 1 Мак 3.18; Мф 14.19"
                10 -> res = "Еккл 4.9"
                12 -> res = "Суд 6.5"
                15 -> res = "Быт 24.26; Ис 9.4"
                16 -> res = "Суд 9.34"
                18 -> res = "Исх 14.14"
                21 -> res = "Пс 82.10"
                22 -> res = "Пс 82.18"
                24 -> res = "Ин 1.28"
                25 -> res = "Пс 82.12; Ис 10.26"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Суд 12.1"
                2 -> res = "Суд 6.34; Нав 17.2"
                3 -> res = "Суд 7.25"
                5 -> res = "Нав 13.27"
                8 -> res = "Быт 32.30; 3 Цар 12.25"
                10 -> res = "Суд 20.2"
                11 -> res = "Чис 32.42"
                12 -> res = "Ос 10.14"
                18 -> res = "Нав 19.12"
                20 -> res = "Нав 10.24"
                21 -> res = "Пс 82.12"
                27 -> res = "Лев 20.5; Исх 23.33"
                28 -> res = "Суд 3.11"
                30 -> res = "4 Цар 10.1"
                31 -> res = "Суд 9.1"
                33 -> res = "Суд 3.7; 9.4; Иер 23.27"
                35 -> res = "Суд 9.5"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Суд 8.31"
                2 -> res = "Суд 8.31; 2 Цар 5.1"
                4 -> res = "Быт 20.16"
                5 -> res = "4 Цар 10.7, 14"
                6 -> res = "Нав 24.26"
                7 -> res = "Втор 11.29"
                8 -> res = "3 Езд 4.13"
                13 -> res = "Пс 103.15"
                15 -> res = "Иез 5.4; 19.14"
                17 -> res = "Суд 5.18; 12.3; 1 Цар 19.5"
                23 -> res = "1 Цар 16.14"
                24 -> res = "2 Цар 1.16; Пс 7.17; Мф 27.25"
                27 -> res = "Иез 18.6"
                28 -> res = "Быт 34.2"
                32 -> res = "Нав 8.2"
                33 -> res = "Лев 25.28; 1 Цар 10.7"
                45 -> res = "Втор 29.23; Соф 2.9"
                48 -> res = "Пс 67.15"
                50 -> res = "2 Цар 11.21"
                53 -> res = "2 Цар 11.21"
                57 -> res = "Суд 9.20"
            }
        }
        if (glava == 10) {
            when (stih) {
                3 -> res = "Быт 31.21; Чис 32.1"
                4 -> res = "Суд 5.10"
                6 -> res = "Суд 2.11, 13; 1 Цар 7.3"
                7 -> res = "Суд 2.14; 1 Цар 12.9"
                10 -> res = "Суд 3.9"
                13 -> res = "Втор 32.15; Иер 2.13; 3 Цар 18.27"
                16 -> res = "Быт 35.4; Суд 2.18"
                17 -> res = "Суд 11.11"
                18 -> res = "Суд 11.6"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Евр 11.32"
                2 -> res = "Быт 21.10"
                3 -> res = "1 Цар 22.2"
                8 -> res = "Суд 10.18"
                10 -> res = "Мал 2.14"
                11 -> res = "1 Цар 12.11"
                12 -> res = "Втор 20.10"
                13 -> res = "Чис 21.13, 24"
                15 -> res = "Втор 2.19"
                17 -> res = "Чис 20.14, 17"
                18 -> res = "Чис 21.13"
                19 -> res = "Чис 21.21"
                21 -> res = "Чис 21.24"
                23 -> res = "Ам 2.9"
                24 -> res = "3 Цар 11.7; 4 Цар 23.13"
                25 -> res = "Чис 22.2"
                27 -> res = "Быт 16.5"
                29 -> res = "Суд 6.34; 13.25; Лк 1.35"
                33 -> res = "Втор 3.12"
                34 -> res = "Исх 15.20; 1 Цар 18.6; Пс 67.26"
                35 -> res = "Быт 37.29, 34"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Суд 8.1"
                3 -> res = "Суд 5.18; 9.17"
                4 -> res = "2 Цар 18.6"
                6 -> res = "Мф 26.73"
                8 -> res = "Нав 19.15"
                12 -> res = "1 Пар 6.69"
                13 -> res = "2 Цар 23.30"
                14 -> res = "Суд 5.10"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Суд 2.11; 3.7, 12"
                2 -> res = "Нав 15.33; Суд 16.31"
                3 -> res = "Суд 2.1; Быт 18.10"
                4 -> res = "Чис 6.3-4"
                5 -> res = "Чис 6.5"
                6 -> res = "Лк 1.12"
                8 -> res = "Быт 25.21"
                14 -> res = "Чис 6.3; Лк 1.15"
                15 -> res = "Суд 6.18"
                17 -> res = "Быт 32.29"
                18 -> res = "Ис 9.6; 45.15"
                20 -> res = "Мф 17.6; Лк 1.12"
                22 -> res = "Исх 19.21; Втор 5.24-26; Мф 28.8"
                24 -> res = "Евр 11.32"
                25 -> res = "1 Цар 16.13; Мф 4.1; Лк 4.1"
            }
        }
        if (glava == 14) {
            when (stih) {
                3 -> res = "Исх 34.16; Втор 7.3"
                6 -> res = "Суд 6.34; 1 Цар 16.13; Евр 11.32"
                12 -> res = "3 Цар 10.1"
                15 -> res = "Суд 16.5"
                17 -> res = "Суд 16.16"
                19 -> res = "Суд 1.18; 2 Цар 1.20"
            }
        }
        if (glava == 15) {
            when (stih) {
                3 -> res = "Суд 14.4"
                6 -> res = "Суд 6.29"
                14 -> res = "Суд 6.34; 11.29; 14.6"
                19 -> res = "1 Цар 30.12"
                20 -> res = "Суд 16.31"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Нав 15.47"
                2 -> res = "Лк 20.20"
                3 -> res = "Евр 11.34"
                4 -> res = "Втор 1.24"
                5 -> res = "Суд 14.15; 17.2"
                9 -> res = "Суд 15.14"
                17 -> res = "Суд 13.5"
                19 -> res = "Чис 6.5"
                20 -> res = "1 Цар 28.15"
                21 -> res = "Иер 39.7; Ис 47.2"
                23 -> res = "1 Цар 5.2"
                25 -> res = "Мф 27.28, 30"
                28 -> res = "Иудифь 13.4; Евр 11.34"
                30 -> res = "3 Цар 19.4; Евр 2.14"
                31 -> res = "Суд 13.2; 15.20"
            }
        }
        if (glava == 17) {
            when (stih) {
                2 -> res = "Руфь 3.10; 1 Цар 15.13"
                4 -> res = "Ис 40.19; Прем 15.9; Суд 18.17"
                6 -> res = "Суд 18.1; 19.1; 21.25"
                10 -> res = "Суд 18.4"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "Суд 1.34; 17.6; Нав 19.40"
                2 -> res = "Нав 19.47; Суд 17.1"
                4, 19 -> res = "Суд 17.10"
                5 -> res = "1 Цар 23.10; 30.8"
                7 -> res = "Нав 19.47"
                11 -> res = "Суд 13.25"
                12 -> res = "Нав 15.60; Иер 26.20"
                14 -> res = "Ис 10.30; Суд 17.4-5"
                24 -> res = "Быт 31.30"
                28 -> res = "2 Цар 10.6"
                29 -> res = "Быт 14.14; Нав 19.47"
                30 -> res = "Быт 49.17; Исх 32.1; 3 Цар 12.29"
                31 -> res = "Иер 17.12"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "Суд 17.7; 18.1; Быт 35.19"
                10 -> res = "Быт 10.16; Нав 15.63; 2 Цар 5.6"
                12 -> res = "Еф 2.12"
                13 -> res = "2 Цар 5.25"
                15 -> res = "Суд 20.4"
                16 -> res = "Быт 35.18; Суд 3.15; 2 Цар 16.11"
                20 -> res = "Суд 6.23; Деян 16.15; Евр 13.2"
                21 -> res = "Быт 18.4"
                22 -> res = "Быт 19.4-5; Ос 9.9"
                23 -> res = "Быт 19.7; 34.7"
                24 -> res = "Быт 19.8"
                30 -> res = "Суд 18.14"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "Ос 10.9"
                4 -> res = "Суд 19.15"
                6 -> res = "Суд 19.29; Быт 34.7; Иер 29.23"
                7 -> res = "Суд 19.30"
                13 -> res = "Суд 19.22; Ос 9.9"
                16 -> res = "Суд 3.15"
                18 -> res = "Суд 1.1-2; 19.18"
                29 -> res = "Суд 20.37; 1 Цар 15.5"
                35 -> res = "Исх 15.3"
                40 -> res = "Нав 8.20"
                47 -> res = "Суд 21.13"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "Суд 20.1"
                3 -> res = "1 Цар 9.21"
                4 -> res = "3 Цар 8.63"
                7 -> res = "Суд 21.1"
                8 -> res = "1 Цар 11.1; 31.11"
                11 -> res = "Чис 31.17"
                21 -> res = "Исх 15.20; 1 Цар 18.6; Суд 21.12"
                25 -> res = "Суд 17.6; 18.1"
            }
        }
        return res
    }

    fun kniga8(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Суд 2.16; 6.4, 6; Втор 2.9"
                2 -> res = "Быт 35.19; Суд 17.7-8"
                4 -> res = "Неем 13.23"
                6 -> res = "4 Цар 8.3"
                8 -> res = "Руфь 2.11; Быт 43.14"
                9 -> res = "Руфь 3.1"
                16 -> res = "2 Цар 15.21; Руфь 2.12; Зах 8.21"
                17 -> res = "1 Цар 3.17"
                20 -> res = "Иов 9.18"
                21 -> res = "Быт 32.10"
            }
        }
        if (glava == 2) {
            when (stih) {
                2, 16 -> res = "Лев 19.9; 23.22; Втор 24.19"
                3 -> res = "Мф 1.5"
                4 -> res = "Суд 6.12"
                10 -> res = "1 Цар 25.23"
                12 -> res = "Руфь 1.16; Пс 16.8; 35.8"
                13 -> res = "Быт 30.27; 34.3; Суд 19.3"
                17 -> res = "Суд 6.11"
                19 -> res = "Руфь 3.10"
                20 -> res = "Быт 24.31; 2 Цар 2.5; Лев 25.25"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Руфь 1.9"
                2 -> res = "Руфь 2.8"
                3 -> res = "2 Цар 12.20; 2 Пар 28.15; Пс 103.15"
                5 -> res = "Исх 19.8; Тов 5.1"
                9 -> res = "Иез 16.8; Втор 25.5"
                10 -> res = "Суд 17.2; Руфь 2.20"
                14 -> res = "2 Кор 8.21"
                18 -> res = "2 Кор 1.17"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Руфь 3.12"
                2 -> res = "3 Цар 21.8"
                3 -> res = "Лев 25.25"
                4 -> res = "Иер 32.7"
                5 -> res = "Втор 25.5-6"
                7 -> res = "Втор 25.9"
                10 -> res = "Втор 25.6; Мф 22.24"
                11 -> res = "Лк 24.48; Быт 16.2; 29.31"
                12 -> res = "Быт 38.29"
                13 -> res = "Пс 126.3"
                15 -> res = "Быт 45.11; 1 Цар 18.3; Пс 54.23"
                17 -> res = "Мф 1.5-6"
                18 -> res = "1 Пар 2.5; Мф 1.3"
                20 -> res = "Чис 7.12"
                22 -> res = "1 Цар 16.11; 17.12"
            }
        }
        return res
    }

    fun kniga9(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Мф 27.57; 1 Цар 9.5"
                2 -> res = "Быт 29.31; Лк 1.7"
                3 -> res = "Исх 23.17; Нав 18.1; 1 Цар 4.17"
                5 -> res = "Быт 20.18; 29.30"
                9 -> res = "1 Цар 3.3"
                11 -> res = "Чис 6.5; 30.7; Лк 1.25"
                15 -> res = "Пс 41.5"
                17 -> res = "4 Цар 5.19"
                18 -> res = "Руфь 2.13"
                19 -> res = "Быт 30.22"
                20 -> res = "Евр 11.32"
                25 -> res = "1 Цар 1.7"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Лк 1.47, 69; Пс 91.11"
                2 -> res = "Мф 19.17; Исх 15.11"
                4 -> res = "Лк 1.52"
                5 -> res = "Лк 1.53"
                6 -> res = "Втор 32.39; Тов 13.2; Прем 16.13"
                7 -> res = "Сир 11.21"
                8 -> res = "Пс 112.7"
                9 -> res = "Пс 146.6"
                10 -> res = "Ис 45.9"
                12 -> res = "Втор 13.13"
                13 -> res = "Исх 29.27; Лев 7.31; Иез 46.24"
                14 -> res = "Лев 7.34"
                15 -> res = "Лев 3.3"
                17 -> res = "Рим 2.24; 2 Кор 6.3"
                21 -> res = "Лк 1.80; 2.40, 52"
                25 -> res = "Чис 15.30; 3 Цар 12.16"
                27 -> res = "Исх 4.27; Деян 7.25"
                28 -> res = "Лев 7.34; 10.14"
                30 -> res = "Исх 28.1, 43; 29.9; Мал 2.9"
                31 -> res = "3 Цар 2.27"
                32 -> res = "3 Цар 2.26-27, 35"
                33 -> res = "Пс 101.24; 111.10"
                34 -> res = "1 Цар 4.11"
                35 -> res = "Чис 25.13; 2 Цар 8.17; 1 Пар 29.22"
                36 -> res = "3 Цар 2.27; Иез 44.14"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Ам 8.11; Пс 73.9; Притч 29.18"
                3 -> res = "Исх 27.21; Лев 24.3"
                7 -> res = "Чис 12.6"
                11 -> res = "4 Цар 21.12"
                12 -> res = "1 Цар 2.31"
                13 -> res = "1 Цар 2.23"
                14 -> res = "Ис 22.14; Лев 4.3"
                19 -> res = "3 Цар 8.24"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "1 Цар 7.12; Нав 15.53"
                3 -> res = "Чис 14.44; 1 Цар 14.18"
                7 -> res = "Исх 14.25"
                8 -> res = "Ис 43.13; Исх 7.8"
                9 -> res = "Суд 13.1"
                11 -> res = "Пс 77.60, 64"
                21 -> res = "Пс 77.61; Плач 1.6; Евр 9.5"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Нав 11.22"
                2 -> res = "Суд 16.23"
                6 -> res = "1 Цар 6.5; Пс 77.66"
                10 -> res = "Суд 1.18; Ам 1.8; Соф 2.4"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "1 Цар 5.8"
                5 -> res = "1 Цар 5.6"
                6 -> res = "Исх 8.15; 12.31"
                7 -> res = "2 Цар 6.3"
                9 -> res = "Нав 15.10"
                14 -> res = "3 Цар 19.21"
                15 -> res = "Нав 21.16"
                19 -> res = "Чис 4.5, 20; Наум 1.6"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "2 Цар 6.3"
                3 -> res = "Втор 6.13; 10.20; Мф 4.10"
                5 -> res = "Суд 11.11; 1 Цар 10.17"
                6 -> res = "Иона 3.7; Чис 14.40"
                8 -> res = "1 Цар 12.23; Иер 15.1"
                9 -> res = "Сир 46.19"
                10 -> res = "Сир 46.20"
                12 -> res = "1 Цар 14.4"
                15 -> res = "Деян 13.20"
                16 -> res = "1 Цар 10.3"
                17 -> res = "1 Цар 1.1, 19; 9.11; Втор 27.6"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "1 Пар 6.28, 33; 1 Цар 3.20"
                3 -> res = "Исх 18.21; 23.8; Втор 16.19"
                5 -> res = "Ос 13.10; Деян 13.21"
                6 -> res = "1 Цар 12.12"
                7 -> res = "1 Цар 10.19"
                9 -> res = "Втор 17.15"
                11 -> res = "1 Цар 10.25"
                20 -> res = "Чис 27.17"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "1 Цар 10.23"
                4 -> res = "Ин 3.23"
                6 -> res = "Суд 13.6"
                12 -> res = "Быт 31.54"
                13 -> res = "Втор 8.10; Мф 14.19; Лк 24.30"
                15 -> res = "1 Цар 20.12"
                16 -> res = "Деян 13.21"
                21 -> res = "Суд 6.15; 20.46"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Деян 13.21; Ос 13.11"
                2 -> res = "Быт 35.19; 1 Цар 9.5"
                3 -> res = "Нав 19.12; 1 Пар 6.77"
                5 -> res = "1 Цар 13.3; 19.20; Чис 11.25"
                8 -> res = "1 Цар 11.14; 13.8"
                10 -> res = "1 Цар 19.20"
                11 -> res = "1 Цар 19.24"
                17 -> res = "1 Цар 7.6"
                19 -> res = "1 Цар 8.7"
                21 -> res = "Деян 1.26"
                23 -> res = "1 Цар 9.2"
                24 -> res = "Втор 17.15; 3 Цар 1.25"
                25 -> res = "1 Цар 8.11; Втор 17.15-16"
                26 -> res = "1 Цар 11.7"
                27 -> res = "1 Цар 11.12"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "1 Цар 12.12; Суд 21.8; Ам 1.13"
                2 -> res = "Иер 39.7"
                6 -> res = "Суд 14.6; 15.14; 1 Цар 16.13"
                7 -> res = "1 Цар 10.26"
                8 -> res = "Суд 1.4"
                11 -> res = "Суд 7.16"
                12 -> res = "1 Цар 10.27"
                13 -> res = "2 Цар 19.22"
                14 -> res = "1 Цар 10.8"
                15 -> res = "1 Цар 12.1"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "1 Цар 8.7; 11.15"
                2 -> res = "Чис 27.17"
                3 -> res = "Сир 46.22; Деян 20.33"
                8 -> res = "Быт 46.6"
                9 -> res = "Суд 4.2"
                11 -> res = "Суд 4.6; 6.14; 11.11; 1 Цар 7.10"
                12 -> res = "1 Цар 8.5"
                14 -> res = "Втор 7.12"
                15 -> res = "Втор 1.26; 2.15"
                17 -> res = "Притч 26.1; 1 Цар 8.7"
                19 -> res = "Исх 20.19"
                20 -> res = "Евр 11.32; Втор 6.5, 13; 17.11"
                21 -> res = "Лев 19.4; Иер 3.23; 1 Кор 8.4"
                23 -> res = "1 Цар 7.8; 3 Цар 8.36"
                24 -> res = "4 Цар 17.39"
                25 -> res = "Ис 24.2"
            }
        }
        if (glava == 13) {
            when (stih) {
                2 -> res = "Ис 10.28; Суд 19.12"
                3 -> res = "1 Цар 10.5"
                4 -> res = "Быт 34.30; Исх 5.21"
                6 -> res = "1 Цар 14.22; 2 Цар 17.9"
                8 -> res = "1 Цар 10.8"
                14 -> res = "Деян 13.22"
                15 -> res = "1 Цар 14.2"
                17 -> res = "Нав 18.23"
                18 -> res = "Нав 16.3"
                19 -> res = "Суд 5.8; 4 Цар 24.14; Иер 29.2"
                22 -> res = "Суд 5.8"
            }
        }
        if (glava == 14) {
            when (stih) {
                3 -> res = "1 Цар 4.21; 22.9"
                6 -> res = "2 Пар 14.11"
                15 -> res = "Исх 14.25; 23.27"
                18 -> res = "1 Цар 4.3"
                20 -> res = "Суд 7.22; Зах 14.13"
                22 -> res = "1 Цар 13.6"
                26 -> res = "Втор 32.13"
                33 -> res = "Втор 12.16, 23"
                35 -> res = "Нав 22.10; Суд 6.24"
                37 -> res = "Нав 7.1; 1 Цар 28.6"
                41 -> res = "Нав 7.16"
                43 -> res = "Нав 7.19"
                44 -> res = "3 Цар 2.23"
                45 -> res = "1 Цар 11.13"
                48 -> res = "1 Цар 15.2-3"
                49 -> res = "1 Пар 8.33"
                50 -> res = "1 Цар 17.55; 26.5"
                51 -> res = "1 Цар 9.1"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "1 Цар 10.1"
                2 -> res = "Исх 17.8"
                5 -> res = "Нав 8.4"
                6 -> res = "Чис 10.29; Суд 1.16"
                7 -> res = "Чис 24.20"
                11 -> res = "Быт 6.6-7"
                12 -> res = "Нав 15.55; 2 Цар 18.18"
                13 -> res = "1 Цар 23.21"
                17 -> res = "1 Цар 9.21"
                18 -> res = "Быт 13.13; Пс 25.9"
                22 -> res = "Сир 4.15; Ос 6.6; Мф 9.13; 12.7"
                23 -> res = "1 Пар 10.13"
                24 -> res = "Исх 32.22"
                26 -> res = "1 Цар 16.1"
                28 -> res = "1 Цар 28.17"
                29 -> res = "Чис 23.19; Ос 11.9"
                30 -> res = "Мк 12.17; Ин 5.44"
                33 -> res = "Иер 31.15; 3 Цар 18.40"
                35 -> res = "1 Цар 16.1; Рим 9.2"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "1 Цар 17.12; 4 Цар 9.1; 3 Езд 3.23"
                3 -> res = "1 Цар 9.16"
                4 -> res = "Лк 2.4"
                5 -> res = "Исх 19.10"
                6 -> res = "1 Цар 17.13"
                7 -> res = "Втор 10.17; Деян 10.34; 1 Пар 28.9; Пс 7.10; Иер 11.20; Откр 2.23"
                9 -> res = "2 Цар 13.3"
                11 -> res = "2 Цар 7.8; Пс 77.71"
                12 -> res = "Пс 88.21"
                13 -> res = "Деян 7.46; 13.22"
                14 -> res = "Суд 16.20; Лк 19.24"
                19 -> res = "1 Цар 8.11"
                20 -> res = "1 Цар 25.18"
                21 -> res = "1 Цар 18.3"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Нав 15.35"
                4 -> res = "Нав 11.22"
                5 -> res = "2 Цар 21.16, 19"
                10 -> res = "4 Цар 19.4"
                12 -> res = "1 Цар 16.1; Мф 1.6"
                13 -> res = "1 Цар 16.6"
                14 -> res = "1 Цар 16.11"
                15 -> res = "1 Цар 16.21"
                23 -> res = "2 Цар 1.20"
                26 -> res = "Нав 3.10; 4 Цар 19.4; Иер 10.10"
                28 -> res = "1 Цар 16.7"
                34 -> res = "Сир 47.3"
                37 -> res = "Евр 11.32-33"
                42 -> res = "1 Кор 1.27; 1 Цар 16.12"
                44 -> res = "Иез 29.5; 39.4"
                45 -> res = "Пс 19.8; 117.11; Притч 18.11"
                46 -> res = "Ис 45.5"
                47 -> res = "Пс 43.6-7; 34.10"
                49 -> res = "Сир 47.5"
                50 -> res = "1 Мак 4.30"
                55 -> res = "1 Цар 14.50; 26.5"
                58 -> res = "1 Цар 16.1, 21"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "1 Цар 19.1; 20.17"
                3 -> res = "1 Цар 19.1-3"
                6 -> res = "Пс 67.26"
                7 -> res = "1 Цар 29.5; Сир 47.7"
                10 -> res = "1 Цар 16.14; 19.9, 23"
                11 -> res = "Евр 11.34"
                14 -> res = "4 Цар 18.7"
                16 -> res = "1 Цар 8.20; 2 Цар 5.2"
                17 -> res = "Нав 1.18; 1 Цар 25.28"
                18 -> res = "2 Цар 7.18"
                25, 27 -> res = "2 Цар 3.14"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "1 Цар 18.1; 20.17"
                5 -> res = "Суд 5.18"
                6 -> res = "1 Цар 14.45"
                9 -> res = "1 Цар 16.14"
                10 -> res = "1 Цар 18.11; 20.33"
                11 -> res = "Пс 58.1; Евр 11.34"
                22 -> res = "1 Цар 17.1"
                23 -> res = "Притч 21.1; 1 Цар 18.10"
                24 -> res = "1 Цар 10.11"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "1 Цар 17.29"
                2 -> res = "1 Цар 22.15"
                3 -> res = "1 Цар 25.26"
                6 -> res = "Ин 7.42; 1 Цар 9.12"
                8, 16 -> res = "1 Цар 18.3"
                15 -> res = "2 Цар 9.1"
                17 -> res = "1 Цар 18.1; 19.1"
                24 -> res = "Чис 10.10"
                26 -> res = "Лев 7.19; 11.24; 15.2, 16"
                33 -> res = "1 Цар 18.11; 19.10"
                42 -> res = "2 Цар 21.7"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "1 Цар 16.4"
                6 -> res = "Исх 25.30; Мф 12.4; Мк 2.26; Лк 6.4"
                7 -> res = "Пс 51.2"
                9 -> res = "1 Цар 17.50"
                10 -> res = "1 Цар 27.2; Пс 55.1"
                11 -> res = "1 Цар 18.7"
                13 -> res = "Пс 33.1; 55.1; Притч 17.24"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "2 Цар 23.13; Пс 141.1"
                2 -> res = "Суд 11.3"
                3 -> res = "Суд 10.17"
                4 -> res = "2 Цар 23.14"
                5 -> res = "Пс 62.1"
                9 -> res = "1 Цар 21.1; Пс 51.2"
                10 -> res = "1 Цар 21.6, 9"
                11 -> res = "Пс 56.1"
                16 -> res = "1 Цар 2.31"
                20 -> res = "2 Цар 15.29; 3 Цар 2.26"
                21 -> res = "Мф 14.12"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "Нав 15.44"
                2 -> res = "2 Цар 2.1; 5.19"
                6 -> res = "Исх 28.6"
                9 -> res = "1 Цар 30.7"
                14 -> res = "1 Цар 22.4"
                17 -> res = "1 Цар 15.28"
                19 -> res = "1 Цар 26.1; Пс 53.2"
                24 -> res = "2 Цар 22.19"
                25 -> res = "Нав 15.55"
            }
        }
        if (glava == 24) {
            when (stih) {
                5 -> res = "1 Цар 26.8"
                7 -> res = "Пс 7.5; Рим 12.20; 13.5"
                15 -> res = "2 Цар 16.9"
                18 -> res = "1 Цар 25.21"
                19 -> res = "2 Цар 18.28"
                20 -> res = "Притч 25.21-22; Рим 12.20"
            }
        }
        if (glava == 25) {
            when (stih) {
                1 -> res = "1 Цар 28.3"
                2 -> res = "Нав 12.22; 15.55; 2 Цар 19.32"
                13 -> res = "Пс 44.4"
                18 -> res = "1 Цар 30.12"
                21 -> res = "1 Цар 24.18"
                26 -> res = "1 Цар 20.3"
                28 -> res = "1 Цар 18.17"
                29 -> res = "Пс 6.11; 30.21; 72.19"
                30 -> res = "2 Цар 5.2"
                35 -> res = "Притч 15.1"
                36 -> res = "2 Цар 13.27"
                39 -> res = "Пс 57.11; 1 Цар 27.3"
                43 -> res = "Нав 15.56"
            }
        }
        if (glava == 26) {
            when (stih) {
                1 -> res = "1 Цар 23.19; Пс 53.2"
                5 -> res = "1 Цар 14.50; 17.55"
                7 -> res = "2 Цар 23.18"
                9 -> res = "2 Цар 1.14; Пс 7.5"
                10 -> res = "Еккл 9.12"
                11 -> res = "1 Цар 26.23"
                15 -> res = "2 Цар 3.38"
                16 -> res = "2 Цар 12.5"
                17 -> res = "1 Цар 24.17"
                18 -> res = "1 Цар 17.29; 20.1; 24.12"
                19 -> res = "Сир 28.15, 21"
                20 -> res = "1 Цар 24.15"
                21 -> res = "1 Цар 24.18; Пс 71.14"
                23 -> res = "Пс 17.25; Притч 24.12; Ос 4.9"
            }
        }
        if (glava == 27) {
            when (stih) {
                2 -> res = "1 Цар 21.10"
                3 -> res = "1 Цар 25.39-40; 30.5"
                6 -> res = "Нав 15.31; 1 Цар 29.4"
                7 -> res = "1 Цар 29.3"
                8 -> res = "Нав 12.5; 13.17"
                9 -> res = "Втор 25.19"
            }
        }
        if (glava == 28) {
            when (stih) {
                1 -> res = "1 Цар 29.1"
                3 -> res = "1 Цар 25.1; Лев 20.27; Втор 18.11"
                4 -> res = "Нав 19.18; 1 Цар 31.1"
                6 -> res = "1 Цар 28.15; Иез 14.3"
                7 -> res = "Лев 20.27; Втор 18.11"
                8, 15 -> res = "1 Пар 10.13"
                11 -> res = "Ис 8.19"
                17 -> res = "1 Цар 15.28"
                18 -> res = "1 Цар 13.13; 15.19"
                19 -> res = "Сир 46.23"
            }
        }
        if (glava == 29) {
            when (stih) {
                1 -> res = "1 Цар 28.1"
                3, 11 -> res = "1 Цар 27.7"
                4 -> res = "1 Пар 12.19"
                5 -> res = "1 Цар 18.7; Сир 47.7"
                8 -> res = "1 Цар 20.1"
                9 -> res = "2 Цар 14.17"
            }
        }
        if (glava == 30) {
            when (stih) {
                5 -> res = "1 Цар 25.42-43"
                6 -> res = "Исх 17.4"
                7 -> res = "Быт 49.24; 1 Цар 23.9"
                12 -> res = "Суд 15.19"
                24 -> res = "Чис 31.27; Нав 22.8; 2 Мак 8.28"
                26 -> res = "2 Цар 1.1"
                27 -> res = "Нав 15.58"
                28 -> res = "Втор 3.12"
            }
        }
        if (glava == 31) {
            when (stih) {
                1 -> res = "1 Пар 10.1"
                2 -> res = "1 Цар 14.49"
                6 -> res = "1 Цар 28.19; 1 Пар 10.6"
                7 -> res = "1 Пар 10.7"
                10 -> res = "2 Цар 21.12"
                11, 12 -> res = "2 Цар 2.4"
                13 -> res = "2 Цар 21.12; 1 Пар 10.12"
            }
        }
        return res
    }

    fun kniga10(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "1 Цар 27.6; 30.17"
                2 -> res = "Быт 37.34; 1 Цар 4.12; Иов 2.12"
                4 -> res = "2 Цар 4.10"
                11 -> res = "1 Цар 4.12; 2 Цар 3.31"
                14 -> res = "1 Цар 10.1; 24.7; Пс 104.15"
                15 -> res = "2 Цар 4.10, 12"
                18 -> res = "Быт 49.8; Нав 10.13"
                20 -> res = "1 Цар 17.23; Суд 11.34; 14.19"
                21 -> res = "1 Цар 31.1"
                22 -> res = "1 Цар 14.6"
                26 -> res = "2 Цар 9.1; 1 Цар 18.1"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "1 Цар 23.2; 30.7-8"
                2 -> res = "1 Цар 25.42"
                4 -> res = "1 Цар 31.11; 1 Мак 2.57"
                5 -> res = "1 Цар 15.13"
                8 -> res = "1 Цар 14.50; 17.55"
                9 -> res = "Чис 32.40; Нав 19.18"
                11 -> res = "2 Цар 5.5"
                12 -> res = "Нав 9.3; 21.17"
                13 -> res = "Иер 41.12"
                18 -> res = "1 Пар 2.16"
                23 -> res = "2 Цар 3.27"
                28 -> res = "2 Цар 18.16"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "2 Цар 5.10"
                2 -> res = "1 Пар 3.1"
                3 -> res = "1 Пар 3.1-2"
                4 -> res = "3 Цар 1.5"
                5 -> res = "1 Пар 3.3"
                7 -> res = "2 Цар 21.8"
                8 -> res = "1 Цар 24.15; 2 Цар 9.8; 16.9"
                10 -> res = "Суд 20.1; 1 Цар 3.20; 2 Цар 17.11"
                14 -> res = "1 Цар 18.27"
                15 -> res = "1 Цар 25.44"
                18 -> res = "2 Цар 5.2"
                19 -> res = "1 Пар 12.29"
                22 -> res = "2 Цар 4.1"
                25 -> res = "2 Цар 10.3"
                27 -> res = "2 Цар 2.23; 20.10; 3 Цар 2.5, 32"
                29 -> res = "3 Цар 2.33; Лев 15.2; 4 Цар 5.27"
                30 -> res = "2 Цар 2.23; 3 Цар 2.5"
                31 -> res = "Иоил 2.13"
                35 -> res = "2 Цар 19.13"
                38 -> res = "1 Цар 26.15"
                39 -> res = "Пс 61.13; 3 Цар 2.32"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Ис 13.7; Иер 50.43"
                2 -> res = "Нав 18.25"
                3 -> res = "1 Цар 31.7"
                4 -> res = "2 Цар 9.3; 1 Цар 29.11; 1 Пар 9.40"
                5 -> res = "2 Цар 2.8"
                9 -> res = "Быт 48.16"
                10 -> res = "2 Цар 1.4"
                12 -> res = "2 Цар 1.15; 3.32"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "1 Пар 11.1"
                2 -> res = "1 Цар 18.16; 25.30"
                3 -> res = "1 Пар 11.3"
                4 -> res = "3 Цар 2.11"
                5 -> res = "2 Цар 2.11"
                6 -> res = "1 Пар 11.4; Суд 19.10; Нав 15.63"
                7 -> res = "3 Цар 2.10"
                8 -> res = "Нав 15.63; 1 Пар 11.6"
                9 -> res = "3 Цар 9.15; 1 Пар 11.8"
                11 -> res = "1 Пар 14.1"
                12 -> res = "1 Пар 14.2; Пс 29.2"
                14 -> res = "1 Пар 3.5; Лк 3.31"
                16 -> res = "1 Пар 14.7"
                17 -> res = "1 Пар 14.8"
                18 -> res = "Нав 15.8"
                19 -> res = "1 Цар 23.2; 30.8"
                20 -> res = "1 Пар 14.11; Ис 28.21"
                21 -> res = "1 Цар 31.9; Втор 7.5; 1 Пар 14.12"
                24 -> res = "Суд 4.14"
                25 -> res = "Суд 19.13; 1 Пар 14.16"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "1 Пар 13.5"
                2 -> res = "Исх 25.20"
                3 -> res = "1 Цар 7.1"
                6 -> res = "1 Пар 13.9"
                7 -> res = "Лев 10.2"
                8 -> res = "1 Пар 13.11"
                9 -> res = "Мф 8.34; Деян 5.13"
                10 -> res = "1 Пар 13.13"
                11 -> res = "1 Пар 13.14"
                12 -> res = "1 Пар 13.14; 15.16; 2 Цар 5.7"
                14 -> res = "Пс 83.3"
                15 -> res = "1 Пар 15.28"
                16 -> res = "1 Пар 15.29; 1 Кор 2.14"
                17 -> res = "1 Пар 16.1"
                18 -> res = "1 Пар 16.2; Чис 6.24"
                19 -> res = "1 Пар 16.3, 43"
                21 -> res = "2 Цар 5.2"
                22 -> res = "Пс 83.11; 130.1-2"
                23 -> res = "1 Цар 2.30; 2 Цар 21.8"
            }
        }
        if (glava == 7) {
            when (stih) {
                2 -> res = "1 Пар 17.1; Деян 7.46"
                3 -> res = "Сир 47.1"
                4 -> res = "1 Пар 17.3-4"
                5 -> res = "3 Цар 8.19"
                8 -> res = "1 Цар 16.11-12; Пс 77.70-71"
                10 -> res = "4 Цар 21.8; 2 Пар 33.8"
                12 -> res = "3 Цар 8.20; 2 Пар 21.7; Пс 131.11; Деян 2.30"
                13 -> res = "3 Цар 5.5; 6.12"
                14 -> res = "4 Цар 8.19; 1 Пар 17.13; Пс 88.33; Евр 1.5"
                15 -> res = "Лк 1.72; 1 Цар 15.23"
                16 -> res = "3 Цар 11.38; Пс 88.37; Ин 12.34"
                17 -> res = "1 Пар 17.15"
                19 -> res = "1 Пар 17.17"
                20 -> res = "1 Пар 17.18; Пс 138.1-2; Ин 21.16"
                22 -> res = "Пс 85.10; Ис 44.6; 45.21"
                23 -> res = "Втор 4.7; 33.29; 1 Пар 17.21; Иер 32.21"
                24 -> res = "Быт 17.7; Иер 31.33"
                27 -> res = "3 Цар 2.24"
                28 -> res = "1 Пар 17.26; Лк 1.38"
                29 -> res = "1 Пар 17.27"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "1 Пар 18.1"
                2 -> res = "Чис 22.3; 1 Пар 18.2; Втор 2.9"
                3 -> res = "3 Цар 11.23"
                4 -> res = "2 Цар 10.18"
                5 -> res = "2 Цар 10.6"
                6 -> res = "1 Пар 18.6, 13"
                7 -> res = "2 Пар 12.2"
                8 -> res = "1 Пар 18.8"
                9 -> res = "1 Пар 18.9"
                11 -> res = "1 Пар 18.11"
                13 -> res = "1 Пар 18.12"
                14 -> res = "1 Пар 18.13"
                15 -> res = "1 Пар 18.14"
                16 -> res = "2 Цар 20.23; 1 Пар 18.15"
                17 -> res = "1 Пар 6.12; 9.11"
                18 -> res = "2 Цар 15.18; 20.7; 3 Цар 1.38"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "1 Пар 19.2"
                2 -> res = "2 Цар 16.1; 19.17"
                3 -> res = "1 Цар 20.14; 2 Цар 4.4"
                4 -> res = "2 Цар 17.27"
                10 -> res = "2 Цар 16.3; 19.17"
                11 -> res = "2 Цар 19.28"
                12 -> res = "1 Пар 8.34; 9.40"
                13 -> res = "2 Цар 4.4"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "1 Пар 19.1"
                3 -> res = "2 Цар 3.25; 1 Пар 19.3"
                4 -> res = "Лев 19.27; 1 Пар 19.4"
                6 -> res = "1 Пар 19.6-7; 2 Цар 8.5"
                10 -> res = "1 Пар 19.11"
                12 -> res = "1 Цар 3.18; 1 Пар 19.13; Деян 21.14"
                15 -> res = "1 Пар 19.16"
                18 -> res = "1 Пар 19.18"
                19 -> res = "1 Пар 19.19"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "1 Пар 19.8"
                2 -> res = "Сир 19.2; Мф 5.28"
                3 -> res = "1 Пар 3.5"
                4 -> res = "3 Цар 15.5"
                8 -> res = "Быт 18.4"
                15 -> res = "2 Цар 12.9; 3 Цар 15.5"
                21 -> res = "Суд 9.53"
                24 -> res = "2 Цар 12.9"
                26 -> res = "Втор 34.8"
                27 -> res = "Сир 22.11"
            }
        }
        if (glava == 12) {
            when (stih) {
                5 -> res = "Рим 2.1"
                6 -> res = "Исх 22.1"
                7 -> res = "3 Цар 20.40; 1 Цар 16.13; 1 Пар 11.3"
                9 -> res = "2 Цар 11.4, 17, 27"
                10 -> res = "3 Цар 21.19"
                11 -> res = "2 Цар 16.22"
                13 -> res = "Сир 47.13"
                14 -> res = "Ис 52.5; Иез 36.20"
                24 -> res = "Мф 1.6"
                26 -> res = "1 Пар 20.1"
                30 -> res = "1 Пар 20.2"
                31 -> res = "2 Цар 8.2; Ис 41.15"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "1 Пар 3.1"
                3 -> res = "1 Цар 16.9; 1 Пар 2.13"
                37 -> res = "2 Цар 3.3; 14.23; 15.8"
            }
        }
        if (glava == 14) {
            when (stih) {
                2 -> res = "2 Цар 23.26; 2 Пар 11.6"
                4 -> res = "1 Цар 20.41; 2 Цар 1.2; 9.6"
                7 -> res = "Чис 35.19, 21; Втор 19.12; 2 Цар 21.17"
                11 -> res = "Прем 6.21"
                14 -> res = "Иез 18.32; 33.11"
                16 -> res = "Втор 32.9; Пс 93.5"
                17 -> res = "1 Цар 29.9; 2 Цар 19.27"
                20 -> res = "Есф 5.2"
                22 -> res = "1 Цар 25.24"
                23 -> res = "1 Пар 3.2; 2 Цар 13.37"
                25 -> res = "3 Цар 1.6"
                26 -> res = "2 Цар 18.9"
                27 -> res = "2 Цар 13.1"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "3 Цар 1.5"
                3 -> res = "2 Цар 8.15"
                8 -> res = "2 Цар 3.3"
                10 -> res = "Рим 13.2"
                12 -> res = "2 Цар 17.23; 23.34; 1 Пар 27.33"
                14 -> res = "Пс 3.1"
                16 -> res = "2 Цар 16.21"
                18 -> res = "2 Цар 8.18; 1 Пар 18.17"
                19 -> res = "2 Цар 18.2"
                21 -> res = "Руфь 1.16"
                23 -> res = "3 Цар 2.37; Иер 31.40; Ин 18.1"
                24 -> res = "1 Цар 22.20; 30.7"
                25 -> res = "2 Цар 16.12; Пс 41.5"
                26 -> res = "2 Цар 10.12; Мф 6.10; Деян 21.14"
                28 -> res = "4 Цар 25.5; 2 Цар 17.16"
                30 -> res = "Мф 26.30, 37; Евр 5.7; 2 Цар 19.4"
                31 -> res = "2 Цар 16.23"
                34 -> res = "2 Цар 17.7; Лк 1.51"
                37 -> res = "2 Цар 16.16; 1 Пар 27.33"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "2 Цар 9.2; 19.17"
                3 -> res = "2 Цар 19.26"
                4 -> res = "2 Цар 19.29"
                5 -> res = "2 Цар 3.16; 19.16; 3 Цар 2.8"
                7 -> res = "Пс 5.7"
                9 -> res = "2 Цар 19.21"
                10 -> res = "Иов 5.7"
                11 -> res = "2 Цар 19.16; Исх 22.28"
                12 -> res = "2 Цар 15.25"
                13 -> res = "3 Цар 2.8"
                16 -> res = "2 Цар 15.37"
                21 -> res = "2 Цар 15.16"
                22 -> res = "2 Цар 12.11"
                23 -> res = "2 Цар 15.31"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Пс 54.4"
                2 -> res = "2 Цар 16.14"
                7 -> res = "2 Цар 15.34"
                9 -> res = "Суд 6.2"
                14 -> res = "2 Цар 15.31; Иов 5.13; Пс 32.10"
                17 -> res = "2 Цар 15.27"
                19 -> res = "Нав 2.4"
                21 -> res = "2 Цар 15.28"
                23 -> res = "2 Цар 15.12"
                25 -> res = "2 Цар 19.13"
                27 -> res = "2 Цар 19.31"
                29 -> res = "2 Цар 16.2"
            }
        }
        if (glava == 18) {
            when (stih) {
                2 -> res = "2 Цар 15.19; 20.6"
                3 -> res = "2 Цар 21.17; 1 Цар 18.7; Сир 47.7"
                9 -> res = "2 Цар 14.26"
                17 -> res = "Нав 7.26"
                18 -> res = "Быт 14.17; 2 Цар 14.27"
                19 -> res = "1 Пар 6.8"
                31 -> res = "3 Цар 1.42"
            }
        }
        if (glava == 19) {
            when (stih) {
                4 -> res = "2 Цар 15.30"
                8, 12 -> res = "2 Цар 5.1"
                13 -> res = "2 Цар 17.25"
                16, 23 -> res = "3 Цар 2.8"
                17 -> res = "2 Цар 9.2, 10; 16.1"
                21 -> res = "2 Цар 16.9; Исх 22.28"
                24 -> res = "2 Цар 9.6"
                25, 27 -> res = "2 Цар 16.3"
                28 -> res = "2 Цар 9.11"
                29 -> res = "2 Цар 16.4"
                31 -> res = "2 Цар 17.27; 3 Цар 2.7"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "2 Цар 16.11; 19.16; 3 Цар 12.16"
                3 -> res = "2 Цар 16.21"
                4 -> res = "2 Цар 19.13"
                6 -> res = "2 Цар 18.2"
                7 -> res = "2 Цар 8.18; 3 Цар 1.38"
                8 -> res = "Нав 10.41"
                9 -> res = "2 Цар 17.25"
                10 -> res = "2 Цар 3.27; 3 Цар 2.5, 32"
                12 -> res = "2 Цар 2.23"
                22 -> res = "Притч 24.21; Сир 7.7-8"
                23 -> res = "2 Цар 8.16, 18"
                24 -> res = "3 Цар 4.3"
                25 -> res = "2 Цар 8.17"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "1 Пар 21.30; Нав 10.41"
                2 -> res = "Нав 9.19; 11.19"
                6 -> res = "Чис 25.4; Нав 10.26; 1 Цар 10.26"
                7 -> res = "1 Цар 20.16, 42"
                8 -> res = "2 Цар 3.7; 17.27; Суд 7.2"
                12 -> res = "1 Цар 31.10, 12"
                14 -> res = "2 Цар 24.25"
                17 -> res = "2 Цар 4.7; 18.3"
                18 -> res = "1 Пар 20.4"
                19 -> res = "1 Цар 17.7"
                20 -> res = "1 Пар 20.6"
                21 -> res = "2 Цар 13.3"
            }
        }
        if (glava == 22) {
            when (stih) {
                2 -> res = "Пс 17.3"
                3 -> res = "2 Цар 23.3; Быт 15.1; Пс 7.2"
                6 -> res = "Иов 22.10; Притч 14.27; Пс 17.6"
                8 -> res = "Пс 17.8"
                9 -> res = "Исх 24.17; Втор 4.24"
                12 -> res = "Иов 36.28; Ис 50.3"
                14 -> res = "Пс 28.3"
                15 -> res = "1 Цар 2.10; 7.10; 12.18"
                17 -> res = "Иов 22.11; Пс 31.6; Ис 43.2"
                20 -> res = "Пс 30.9"
                21 -> res = "Иов 22.30; Пс 4.2"
                25 -> res = "Пс 7.10"
                28 -> res = "Притч 29.23; Сир 20.11; Иов 22.29"
                29 -> res = "Пс 26.1; 111.4; Иов 29.3"
                32 -> res = "Исх 15.11; Ис 43.11"
                35 -> res = "Быт 49.8; Втор 33.29"
                36 -> res = "Пс 3.4"
                39 -> res = "Пс 26.2"
                41 -> res = "Быт 49.8"
                43 -> res = "Пс 82.11; Ис 10.6; Иер 8.2"
                44 -> res = "2 Цар 8.6; Пс 59.10"
                47 -> res = "Втор 32.40; Пс 41.3; Иез 14.16"
                50 -> res = "Рим 15.9"
                51 -> res = "2 Цар 8.6; 23.10; Гал 3.16"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "2 Цар 7.12; Кол 3.16"
                2 -> res = "Деян 1.16; Мк 12.36"
                3 -> res = "Исх 17.5"
                4 -> res = "Ин 1.4; Пс 109.3; Притч 4.18"
                5 -> res = "2 Цар 7.15-16"
                6 -> res = "Пс 57.10; Евр 6.8"
                7 -> res = "Ис 1.31"
                8 -> res = "1 Пар 11.11"
                9 -> res = "1 Пар 11.12; 27.4"
                10 -> res = "1 Цар 11.13; 14.45"
                13 -> res = "1 Пар 11.15"
                14 -> res = "1 Пар 11.16"
                15 -> res = "1 Пар 11.17"
                17 -> res = "1 Пар 11.19"
                18 -> res = "1 Пар 11.20; 2 Цар 21.17"
                20 -> res = "1 Пар 11.22; 27.5; Нав 15.21"
                24 -> res = "1 Пар 11.26-27; 27.7"
                29 -> res = "1 Пар 27.15"
                30 -> res = "1 Пар 11.31; 27.14"
                39 -> res = "2 Цар 11.3, 6"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "1 Пар 21.1"
                4 -> res = "1 Пар 21.4; 27.24"
                5 -> res = "Втор 2.36; Нав 13.16"
                9 -> res = "1 Пар 21.5; 27.24"
                10 -> res = "1 Пар 21.8"
                11 -> res = "1 Пар 21.9"
                12 -> res = "1 Пар 21.11-12"
                14 -> res = "Сир 2.18"
                16 -> res = "Иер 42.10"
                17 -> res = "1 Пар 21.17"
                18 -> res = "1 Пар 21.18; 2 Пар 3.1"
                22 -> res = "1 Пар 21.23; 3 Цар 19.21"
                25 -> res = "Быт 12.7; 2 Цар 21.14; 1 Пар 21.26"
            }
        }
        return res
    }

    fun kniga11(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                3 -> res = "Нав 19.18; 3 Цар 2.17; 4 Цар 4.8"
                5 -> res = "2 Цар 3.4; 1 Пар 3.2"
                6 -> res = "2 Цар 3.4; 14.25"
                7 -> res = "3 Цар 2.22"
                8 -> res = "1 Пар 23.7"
                9 -> res = "Быт 31.54; Нав 15.7; 2 Цар 17.17"
                11 -> res = "2 Пар 9.29"
                13 -> res = "Исх 11.5"
                17 -> res = "2 Цар 12.24; 1 Пар 28.5"
                23 -> res = "2 Цар 24.20"
                25 -> res = "1 Цар 10.24"
                29 -> res = "2 Цар 4.9"
                30 -> res = "3 Цар 3.6; 8.20"
                33 -> res = "Быт 41.43; 1 Пар 23.1; 2 Пар 32.30"
                34 -> res = "1 Цар 10.1; 16.12; 3 Цар 19.15"
                35 -> res = "1 Пар 23.1"
                36 -> res = "1 Пар 22.9"
                38 -> res = "2 Цар 8.18; 15.18; 20.7"
                39 -> res = "Исх 30.25; 4 Цар 11.12; Мф 21.9"
                42 -> res = "2 Цар 15.27; 18.31"
                44 -> res = "3 Цар 1.38"
                47 -> res = "Быт 47.31"
                50 -> res = "Исх 27.2"
                51 -> res = "3 Цар 2.28"
                52 -> res = "1 Цар 14.45; Лк 12.7; Деян 27.34"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Нав 23.14"
                3 -> res = "Нав 22.3; 1 Пар 28.9"
                4 -> res = "Пс 131.12; 3 Цар 8.23, 25"
                5 -> res = "2 Цар 3.27; 20.10"
                7 -> res = "2 Цар 19.31"
                8 -> res = "2 Цар 16.13; 19.16; 3 Цар 2.23"
                10 -> res = "Деян 2.29; 13.36"
                11 -> res = "2 Цар 5.4; 1 Пар 29.26"
                12 -> res = "1 Пар 29.23"
                15 -> res = "3 Цар 1.5; 1 Пар 22.9"
                17 -> res = "3 Цар 1.3-4"
                22 -> res = "3 Цар 1.7"
                24 -> res = "2 Цар 7.12, 27"
                26 -> res = "Нав 21.18; Иер 1.1; Чис 4.15"
                27 -> res = "1 Цар 2.31"
                28 -> res = "3 Цар 1.50"
                31 -> res = "Исх 21.14; 2 Цар 23.20"
                32 -> res = "2 Цар 3.27, 37; 20.10"
                33 -> res = "Быт 9.6; Мф 26.52; Откр 13.10"
                34 -> res = "2 Цар 3.39"
                35 -> res = "3 Цар 2.8; 4.29-30; 5.15-16; 6.38; 9.15, 17, 24-25; 11.27"
                37 -> res = "2 Цар 15.23; 4 Цар 23.4; Ин 18.1"
                39 -> res = "1 Цар 21.10; 27.2"
                44 -> res = "2 Цар 16.5; 19.23"
                45 -> res = "1 Мак 2.57"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "3 Цар 7.8"
                2 -> res = "Лев 17.4; 2 Пар 33.17"
                4 -> res = "1 Пар 16.39; 2 Пар 1.3"
                5 -> res = "2 Пар 1.7; 3 Цар 9.2"
                6 -> res = "1 Пар 28.5; 2 Пар 1.8; Прем 9.17"
                7 -> res = "Иер 10.23"
                8 -> res = "2 Пар 1.9"
                9 -> res = "Прем 6.21"
                12 -> res = "3 Цар 4.29; 5.12; 10.23"
                13 -> res = "Прем 7.11"
                14 -> res = "Лев 18.5; Пс 90.16; Притч 3.16"
                26 -> res = "Ис 49.15"
                27 -> res = "Притч 16.10"
                28 -> res = "Прем 8.4"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "2 Пар 1.13"
                2 -> res = "1 Пар 6.9; 2 Цар 8.17"
                3 -> res = "2 Цар 20.24"
                4 -> res = "3 Цар 2.27"
                5 -> res = "2 Цар 15.37"
                6 -> res = "3 Цар 5.14"
                9 -> res = "Нав 19.42-43"
                10 -> res = "Нав 12.17"
                11 -> res = "1 Цар 16.8; Нав 17.11"
                13 -> res = "Втор 4.43; 1 Пар 2.23"
                14 -> res = "Нав 13.26"
                20 -> res = "1 Пар 29.22"
                21 -> res = "Сир 47.14; 2 Пар 9.26"
                24 -> res = "4 Цар 15.16"
                25 -> res = "Лев 26.5"
                26 -> res = "Втор 17.16; 3 Цар 10.26; 2 Пар 1.14"
                29 -> res = "Сир 47.16"
                30 -> res = "Деян 7.22"
                31 -> res = "2 Пар 1.12; 1 Пар 2.6; Пс 88.1"
                32 -> res = "Притч 1.1; Еккл 12.11; Песн 1.1"
                34 -> res = "Мф 12.42; Мк 3.7; Лк 6.18"
            }
        }
        if (glava == 5) {
            when (stih) {
                2 -> res = "2 Пар 2.3"
                3 -> res = "1 Пар 28.3"
                4 -> res = "Сир 47.15"
                5 -> res = "2 Цар 7.13; 3 Цар 6.12; 1 Пар 22.10"
                6 -> res = "2 Пар 2.8"
                7 -> res = "3 Цар 10.9; 2 Пар 2.12"
                8 -> res = "2 Пар 2.8; 2 Цар 5.11"
                11 -> res = "2 Пар 2.10"
                12 -> res = "3 Цар 3.12"
                14 -> res = "3 Цар 4.6; 12.18"
                15 -> res = "1 Пар 22.2; 2 Пар 2.18"
                16 -> res = "2 Пар 2.18"
                17 -> res = "3 Цар 7.9"
                18 -> res = "Нав 13.5; Пс 82.8; Иез 27.9"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "2 Пар 3.1; Деян 7.47"
                2 -> res = "2 Пар 3.3"
                3 -> res = "2 Пар 3.4; Ин 10.23; Деян 3.11"
                4 -> res = "Иез 40.16; 41.16"
                5 -> res = "1 Пар 28.12"
                7 -> res = "3 Цар 5.18; 1 Пет 2.5"
                8 -> res = "Иез 41.7, 11"
                12 -> res = "2 Цар 7.8, 12; 3 Цар 5.5; 9.5; 11.10; 1 Пар 22.10"
                13 -> res = "Лев 26.12; Ин 14.23"
                15 -> res = "2 Пар 3.5"
                16 -> res = "2 Пар 3.8"
                20 -> res = "2 Пар 3.8; 3 Цар 7.48"
                23 -> res = "Исх 25.18; 37.7"
                24 -> res = "2 Пар 3.11"
                29 -> res = "Иез 40.16"
                32 -> res = "Иез 11.18"
                34 -> res = "Иез 41.23"
                36 -> res = "2 Пар 4.9"
                38 -> res = "3 Цар 9.10; Исх 12.2; 13.4"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "3 Цар 9.10"
                2 -> res = "3 Цар 10.17; Ис 22.8"
                7 -> res = "Пс 121.5"
                8 -> res = "3 Цар 3.1"
                9 -> res = "3 Цар 5.17"
                12 -> res = "3 Цар 6.36"
                13 -> res = "2 Пар 2.13"
                14 -> res = "2 Пар 2.14"
                15 -> res = "4 Цар 25.17"
                17 -> res = "2 Пар 3.16"
                21 -> res = "2 Пар 3.17"
                23 -> res = "2 Пар 4.2"
                25 -> res = "2 Пар 4.4"
                26 -> res = "2 Пар 4.5"
                27 -> res = "4 Цар 16.17; 2 Пар 4.14"
                38 -> res = "2 Пар 4.6"
                40 -> res = "4 Цар 25.14; 2 Пар 4.11"
                43 -> res = "3 Цар 7.27"
                46 -> res = "1 Цар 17.1; 2 Пар 4.17"
                47 -> res = "2 Пар 4.18"
                49 -> res = "2 Пар 4.7, 20"
                50 -> res = "4 Цар 12.13"
                51 -> res = "2 Пар 5.1"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "2 Пар 5.2"
                2 -> res = "Лев 23.34; Втор 16.13; 2 Пар 7.9"
                3 -> res = "Чис 4.15"
                4 -> res = "2 Пар 5.5"
                5 -> res = "2 Пар 5.6"
                6 -> res = "2 Пар 5.7; Исх 25.18"
                9 -> res = "Втор 10.5; Евр 9.4"
                10 -> res = "Исх 40.34"
                11 -> res = "Исх 16.10"
                12 -> res = "2 Пар 6.1"
                14 -> res = "2 Пар 6.3"
                16 -> res = "4 Цар 21.4; 2 Пар 6.5-6"
                17 -> res = "2 Цар 7.2"
                19 -> res = "2 Цар 7.5"
                20 -> res = "2 Цар 7.12"
                22 -> res = "2 Пар 6.12; 2 Мак 2.8"
                24 -> res = "2 Пар 6.15"
                25 -> res = "2 Цар 7.12, 16"
                26 -> res = "2 Цар 7.28"
                27 -> res = "2 Пар 6.18; Ис 66.1; Иер 23.24"
                29 -> res = "Втор 12.11; 3 Цар 9.3; 4 Цар 21.4"
                30 -> res = "3 Езд 7.38"
                31 -> res = "2 Пар 6.22"
                32 -> res = "2 Пар 6.23; Втор 25.1; Иез 9.10"
                33 -> res = "2 Пар 6.24; Дан 9.7"
                35 -> res = "Втор 11.17; 2 Пар 6.26"
                36 -> res = "2 Пар 6.27; Пс 85.11; Притч 9.6"
                37 -> res = "Лев 26.16"
                39 -> res = "1 Цар 16.7; 2 Пар 6.30; Пс 7.10"
                41 -> res = "2 Пар 6.32; Деян 8.27; Втор 3.24"
                43 -> res = "Ис 56.7; Мф 21.13"
                44 -> res = "2 Пар 6.34; Дан 6.10"
                45 -> res = "2 Пар 6.35"
                46 -> res = "Еккл 7.20; 1 Ин 1.8; Притч 20.9; 3 Езд 8.35"
                48 -> res = "Втор 30.2; 2 Пар 6.37; Иез 8.16"
                50 -> res = "Неем 2.2; Притч 16.7; Иер 42.12"
                51 -> res = "Втор 4.20"
                52 -> res = "2 Пар 6.40; Пс 120.4"
                53 -> res = "Исх 19.5"
                54 -> res = "2 Пар 7.1"
                56 -> res = "Втор 12.10; Нав 21.45; 23.14"
                57 -> res = "Пс 9.11"
                58 -> res = "Пс 118.112; 140.4"
                59 -> res = "Пс 147.8"
                60 -> res = "Ис 41.4; 43.10; Иер 3.23"
                62 -> res = "2 Пар 7.4"
                63 -> res = "2 Пар 7.5"
                64 -> res = "2 Пар 4.1; 7.7"
                65 -> res = "2 Пар 7.8; Чис 34.5, 8; Лев 23.34"
                66 -> res = "2 Пар 7.10"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "2 Пар 7.11"
                2 -> res = "3 Цар 3.5; 11.9"
                3 -> res = "Втор 12.11; 3 Цар 8.29; 4 Цар 21.4, 7"
                5 -> res = "3 Цар 6.12; 2 Цар 7.12"
                8 -> res = "Втор 29.24; Иер 22.8"
                10 -> res = "3 Цар 7.1; 2 Пар 8.1"
                15 -> res = "4 Цар 12.20; 3 Цар 11.27; Нав 10.33; 11.10"
                16 -> res = "Нав 16.10"
                17 -> res = "Нав 18.13; 2 Пар 8.5"
                18 -> res = "Нав 19.8; 2 Пар 8.6"
                20 -> res = "2 Пар 8.7"
                21 -> res = "Нав 16.10; 2 Пар 8.8"
                22 -> res = "Лев 25.39; 2 Пар 8.9"
                23 -> res = "2 Пар 8.10"
                24 -> res = "2 Пар 8.11"
                25 -> res = "Исх 23.14; 2 Пар 8.12-13"
                26 -> res = "Втор 2.8; 2 Пар 8.17; 20.36"
                28 -> res = "3 Цар 22.48; 2 Пар 3.6; 8.18"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "2 Пар 9.1; Мф 12.42; Лк 11.31"
                3 -> res = "2 Пар 9.2"
                4 -> res = "2 Пар 9.3"
                6 -> res = "2 Пар 9.5"
                8 -> res = "2 Пар 9.7; Лк 2.47; Откр 7.15"
                10 -> res = "2 Пар 9.9"
                12 -> res = "Еккл 2.8"
                13 -> res = "2 Пар 9.12"
                14 -> res = "2 Пар 9.13"
                16 -> res = "3 Цар 14.26"
                17 -> res = "Иер 46.3"
                18 -> res = "2 Пар 9.17"
                21 -> res = "2 Пар 9.20"
                22 -> res = "3 Цар 9.27; 2 Пар 9.21"
                23 -> res = "3 Цар 3.12; 2 Пар 1.1; 9.22"
                26 -> res = "2 Пар 1.14"
                27 -> res = "2 Пар 1.15"
                28 -> res = "Втор 17.16; 2 Пар 1.16"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Втор 17.17"
                2 -> res = "Исх 34.15-16; Втор 7.3"
                4 -> res = "3 Цар 21.25; Сир 47.22"
                5 -> res = "Суд 2.13; 4 Цар 23.13"
                7 -> res = "Чис 21.29; 4 Цар 23.13"
                9 -> res = "3 Цар 9.2"
                10 -> res = "3 Цар 6.12"
                11 -> res = "3 Цар 12.15"
                12 -> res = "3 Цар 12.16"
                13 -> res = "3 Цар 9.3; 11.31"
                15 -> res = "2 Цар 8.14"
                16 -> res = "2 Цар 8.13"
                17 -> res = "3 Цар 22.47; 2 Цар 8.14"
                18 -> res = "Быт 14.6; 25.2; 36.35"
                21 -> res = "3 Цар 2.10; Исх 4.18"
                23 -> res = "2 Цар 8.3"
                24 -> res = "2 Цар 8.3; 10.16"
                26 -> res = "2 Пар 13.6"
                27 -> res = "3 Цар 9.15"
                30 -> res = "3 Цар 12.15; 14.2; 4 Цар 17.21"
                31 -> res = "3 Цар 12.15; 14.8"
                32 -> res = "3 Цар 12.20"
                34 -> res = "2 Цар 7.18; Пс 88.4-5; Сир 47.24"
                36 -> res = "3 Цар 12.15-16; 2 Цар 21.17"
                38 -> res = "1 Цар 2.35; 2 Цар 7.16; 3 Цар 9.4"
                39 -> res = "Лк 1.32-33"
                40 -> res = "3 Цар 14.30"
                41 -> res = "2 Пар 1.1; Сир 47.23"
                43 -> res = "2 Пар 9.31; Мф 1.7"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "2 Пар 10.1"
                2 -> res = "2 Пар 10.2; 3 Цар 11.40"
                5 -> res = "2 Пар 10.5"
                6 -> res = "2 Пар 10.6"
                7 -> res = "2 Пар 10.7; Сир 37.18"
                8 -> res = "2 Пар 10.8; Сир 26.26; 47.28"
                10 -> res = "2 Пар 10.10"
                11 -> res = "2 Пар 10.11"
                12 -> res = "2 Пар 10.12"
                15 -> res = "3 Цар 11.31"
                16 -> res = "2 Пар 10.16"
                17 -> res = "3 Цар 11.32"
                18 -> res = "2 Цар 20.24; 3 Цар 4.6; 5.14"
                19 -> res = "4 Цар 17.21"
                20 -> res = "3 Цар 11.11, 32"
                21 -> res = "2 Пар 11.1"
                22 -> res = "2 Пар 11.2"
                24 -> res = "3 Цар 12.15"
                25 -> res = "Суд 8.17; 9.45; 3 Цар 12.1"
                28 -> res = "Исх 32.8; 4 Цар 17.16"
                29 -> res = "Иер 48.13"
                31 -> res = "2 Пар 11.15; 13.9"
                32 -> res = "Ос 7.5"
                33 -> res = "Ам 3.14; Рим 1.25"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Суд 13.6; 3 Цар 12.33; 17.18"
                2 -> res = "4 Цар 23.16"
                3 -> res = "Втор 13.1"
                6 -> res = "Исх 8.8; 9.28; Деян 8.24"
                8 -> res = "Чис 22.18"
                11, 31 -> res = "4 Цар 23.18"
                18 -> res = "2 Кор 11.13; Гал 1.8; Рим 7.11"
                22 -> res = "3 Цар 14.13; Ис 14.19; Иер 22.19"
                24 -> res = "3 Цар 20.36"
                25 -> res = "3 Цар 13.11"
                30 -> res = "3 Цар 13.22"
                33 -> res = "Исх 28.41; Лев 7.37"
                34 -> res = "3 Цар 12.30; 14.16; 1 Цар 2.25"
            }
        }
        if (glava == 14) {
            when (stih) {
                2, 8 -> res = "3 Цар 11.31"
                3 -> res = "1 Цар 9.7"
                7 -> res = "3 Цар 1.35; 11.29; 16.2"
                9 -> res = "Неем 9.26"
                10, 14 -> res = "3 Цар 15.29"
                13 -> res = "3 Цар 13.22; 14.18; Прем 4.14"
                15 -> res = "2 Пар 13.17; 4 Цар 17.6"
                16 -> res = "3 Цар 12.28"
                17 -> res = "3 Цар 11.26; 16.8"
                18 -> res = "3 Цар 14.13; 2 Пар 10.15"
                19 -> res = "2 Пар 10.15; 13.2"
                21 -> res = "2 Пар 12.13"
                22 -> res = "2 Пар 12.1"
                23 -> res = "Исх 20.4; Втор 12.2; 4 Цар 16.4"
                24 -> res = "Втор 18.9; 4 Цар 21.11; 2 Пар 33.2"
                25 -> res = "2 Пар 12.2"
                26 -> res = "3 Цар 10.16"
                27 -> res = "2 Пар 12.10"
                29 -> res = "2 Пар 12.15"
                30 -> res = "3 Цар 15.6, 16"
                31 -> res = "Втор 31.16; 2 Пар 12.16"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "2 Пар 13.1"
                2 -> res = "2 Пар 11.20"
                3 -> res = "2 Пар 12.14; 3 Цар 14.8"
                4 -> res = "3 Цар 11.36; 4 Цар 8.19"
                5 -> res = "2 Цар 11.4, 17; 12.9"
                7 -> res = "2 Пар 13.3"
                8 -> res = "2 Пар 14.1"
                10 -> res = "2 Пар 13.2"
                12 -> res = "Втор 23.17; 3 Цар 14.24"
                13 -> res = "2 Пар 15.16"
                14 -> res = "Лев 26.30; 3 Цар 22.43; 2 Пар 15.17"
                16 -> res = "3 Цар 14.30; 2 Пар 16.9"
                17 -> res = "2 Пар 16.1"
                18 -> res = "4 Цар 12.18; 16.8; 2 Пар 16.2"
                20 -> res = "2 Пар 16.4; Быт 14.14"
                21 -> res = "2 Пар 16.5"
                22 -> res = "Нав 18.24"
                23 -> res = "2 Пар 14.2; 16.11-12"
                24 -> res = "2 Пар 16.13; 17.1"
                26 -> res = "3 Цар 12.33; 16.19, 26; 22.52"
                27 -> res = "3 Цар 14.14; 16.9; Нав 19.44"
                28 -> res = "3 Цар 16.7"
                29 -> res = "3 Цар 14.10; 16.3; 21.22; 4 Цар 9.9"
                30 -> res = "Сир 47.29"
                31 -> res = "3 Цар 16.5"
                32 -> res = "3 Цар 15.16; 2 Пар 16.9"
                34 -> res = "3 Цар 15.26; 16.19, 25; 22.52"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "1 Пар 25.4"
                3 -> res = "4 Цар 9.9; 3 Цар 15.29"
                4 -> res = "3 Цар 21.24"
                5 -> res = "2 Пар 16.11"
                7 -> res = "4 Цар 9.9; 3 Цар 15.28-29"
                8 -> res = "3 Цар 14.17; 15.21"
                10 -> res = "4 Цар 9.31"
                12 -> res = "3 Цар 16.1-3, 7"
                13 -> res = "3 Цар 15.34"
                15 -> res = "3 Цар 15.27"
                16 -> res = "4 Цар 8.26"
                17 -> res = "4 Цар 15.14"
                18 -> res = "Мих 6.16"
                19 -> res = "3 Цар 15.26, 34"
                26 -> res = "3 Цар 15.26"
                30 -> res = "4 Цар 10.18"
                31 -> res = "Откр 2.20"
                33 -> res = "Втор 7.5; 4 Цар 13.6"
                34 -> res = "Нав 6.25"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Сир 48.3; Иак 5.17"
                4 -> res = "Пс 146.9"
                9 -> res = "Авд 1.20; Лк 21.2; Деян 28.2"
                10 -> res = "Лк 4.26"
                12 -> res = "3 Цар 18.10"
                19 -> res = "4 Цар 4.32"
                20 -> res = "Деян 28.8"
                21 -> res = "3 Езд 7.39; Деян 20.10"
                22 -> res = "Евр 11.35"
                23 -> res = "3 Цар 17.18"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "3 Цар 17.8"
                4 -> res = "3 Цар 16.31"
                10 -> res = "3 Цар 17.12"
                12 -> res = "4 Цар 2.16; Иез 3.12; Лк 4.1"
                15 -> res = "4 Цар 3.14"
                17 -> res = "2 Пар 18.19; Лк 23.2; Деян 24.5"
                19 -> res = "Нав 19.26; 4 Цар 2.25; Ис 35.2"
                20 -> res = "2 Пар 18.5"
                21 -> res = "Иак 1.8; Сир 2.12"
                22 -> res = "3 Цар 22.6"
                24 -> res = "Лев 9.24"
                27 -> res = "Втор 32.37"
                28 -> res = "Лев 19.28; Втор 14.1"
                29 -> res = "Исх 29.39; Дан 9.21; Деян 3.1"
                31 -> res = "Быт 32.28; 4 Цар 17.34"
                32 -> res = "Быт 13.18; Втор 12.13"
                36 -> res = "Исх 3.6; 4.5; 1 Пар 29.18"
                38 -> res = "Лев 9.24; Суд 6.21; 2 Пар 7.1"
                39 -> res = "Зах 13.9"
                40 -> res = "Суд 4.7; Втор 13.5; 1 Цар 15.33"
                42 -> res = "Иак 5.16"
                45 -> res = "Иов 37.6; Иак 5.18; 3 Цар 17.1"
                46 -> res = "Лк 1.66"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "3 Цар 18.40"
                2 -> res = "3 Цар 2.23; 20.10"
                3 -> res = "Быт 21.31"
                4 -> res = "Суд 16.30; Иак 5.17; Иов 7.16"
                8 -> res = "Исх 3.1; 24.18; Мф 4.2"
                9 -> res = "3 Цар 18.9"
                10 -> res = "Рим 11.3"
                11 -> res = "Исх 33.22; Иов 38.1; Деян 2.2"
                13 -> res = "Исх 3.6"
                14 -> res = "3 Цар 19.10; Пс 68.10; Рим 11.3"
                16 -> res = "4 Цар 9.1-2; Сир 48.8"
                17 -> res = "4 Цар 9.24; 2 Пар 22.8"
                18 -> res = "Рим 11.4"
                19 -> res = "4 Цар 1.8; Зах 13.4"
                21 -> res = "1 Цар 6.14"
            }
        }
        if (glava == 20) {
            when (stih) {
                10 -> res = "3 Цар 19.2"
                11 -> res = "3 Цар 22.27"
                13 -> res = "3 Цар 18.4; 22.8"
                27 -> res = "1 Мак 3.16"
                28 -> res = "4 Цар 19.22; Исх 15.3"
                30 -> res = "3 Цар 20.26; 22.25; 2 Пар 18.24"
                31 -> res = "4 Цар 6.26; 2 Мак 10.25"
                34 -> res = "3 Цар 22.3"
                36 -> res = "3 Цар 13.24"
                42 -> res = "3 Цар 22.35"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "3 Цар 18.45"
                2 -> res = "Лев 25.14; Втор 11.10"
                3 -> res = "Лев 25.23; Чис 36.7; Иез 46.18"
                7 -> res = "Мф 6.24"
                10 -> res = "2 Цар 19.21; Иов 1.5"
                13 -> res = "Пс 34.11; Мф 26.60; Лев 24.11, 14"
                15 -> res = "Иов 24.6"
                19 -> res = "3 Цар 22.38"
                20 -> res = "4 Цар 17.17"
                21 -> res = "4 Цар 9.8"
                22 -> res = "3 Цар 15.29"
                23 -> res = "4 Цар 9.36"
                24 -> res = "3 Цар 14.11; 16.4"
                25 -> res = "3 Цар 21.20"
                26 -> res = "Лев 26.30"
                29 -> res = "2 Пар 12.7"
            }
        }
        if (glava == 22) {
            when (stih) {
                2 -> res = "2 Пар 18.2"
                3 -> res = "3 Цар 4.13; 20.34"
                4 -> res = "2 Пар 18.3; 4 Цар 3.7"
                5 -> res = "2 Пар 18.4"
                6 -> res = "2 Пар 18.5"
                7 -> res = "2 Пар 18.6"
                8 -> res = "3 Цар 20.13; 2 Тим 4.3; Гал 4.16"
                11 -> res = "2 Пар 18.10; Иер 28.14"
                13 -> res = "2 Пар 18.12"
                14 -> res = "Иер 23.28; 42.4"
                15 -> res = "2 Пар 18.14"
                16 -> res = "2 Пар 18.15"
                17 -> res = "Чис 27.17; 2 Пар 18.16"
                18 -> res = "2 Пар 18.17"
                19 -> res = "Ис 6.1; Дан 4.14; 7.9"
                21 -> res = "2 Пар 18.20; Иов 1.6"
                22 -> res = "2 Пар 18.21; Иез 14.9; Мф 6.13"
                23 -> res = "2 Фес 2.11"
                24 -> res = "2 Пар 18.23; Иер 20.2"
                25 -> res = "2 Пар 18.24"
                27 -> res = "3 Цар 20.11; Пс 79.6"
                29 -> res = "2 Пар 18.28"
                30 -> res = "2 Пар 18.29"
                32 -> res = "2 Пар 18.31"
                34 -> res = "2 Пар 18.33"
                35 -> res = "3 Цар 20.42; 2 Пар 18.34"
                38 -> res = "3 Цар 21.19"
                39 -> res = "Ам 3.15; 2 Пар 18.2"
                41 -> res = "2 Пар 17.1"
                43 -> res = "3 Цар 15.14; 2 Пар 15.17"
                44 -> res = "2 Пар 19.2"
                45 -> res = "2 Пар 18.1"
                46 -> res = "3 Цар 15.12"
                47 -> res = "2 Цар 8.14; 3 Цар 11.17"
                48 -> res = "3 Цар 9.28; 2 Пар 20.36"
                49 -> res = "2 Пар 19.2"
                50 -> res = "2 Пар 21.1"
                52 -> res = "3 Цар 15.26"
                53 -> res = "Суд 2.11"
            }
        }
        return res
    }

    fun kniga12(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "2 Цар 8.2; 4 Цар 3.5"
                2 -> res = "Ис 19.3; Мф 10.25; Нав 15.45"
                4 -> res = "Пс 54.24"
                8 -> res = "Ис 20.2; Зах 13.4; Мф 3.4"
                9 -> res = "Суд 13.6; 3 Цар 17.18; 1 Тим 6.11"
                10 -> res = "Лк 9.54; Откр 11.5"
                12 -> res = "Лк 9.54"
                17 -> res = "4 Цар 3.1"
                18 -> res = "2 Пар 22.1"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Втор 11.30; Нав 4.19"
                2 -> res = "Быт 12.8; 4 Цар 4.30; Руфь 1.16"
                4 -> res = "Втор 34.3"
                8 -> res = "Исх 14.21; Нав 3.16; 4.23"
                9 -> res = "3 Цар 3.5; Мк 6.22"
                11 -> res = "Сир 48.13; 1 Мак 2.58"
                12 -> res = "Евр 11.5"
                15 -> res = "4 Цар 2.7; 3 Цар 18.12"
                17 -> res = "4 Цар 8.11"
                19 -> res = "Исх 15.23"
                24 -> res = "Втор 18.19; Пс 43.6; Прем 11.18"
                25 -> res = "Нав 19.26"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "4 Цар 1.17"
                2 -> res = "3 Цар 16.32"
                3 -> res = "3 Цар 12.28; 15.26"
                5 -> res = "4 Цар 1.1; 3 Цар 21.29"
                7 -> res = "3 Цар 22.4"
                9 -> res = "2 Пар 21.9"
                11 -> res = "3 Цар 22.5"
                14 -> res = "1 Цар 15.26"
                15 -> res = "1 Цар 16.16; 4 Цар 4.27"
                20 -> res = "Исх 29.39"
                27 -> res = "Быт 22.2; Лев 20.2; Пс 105.37"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Лев 25.39"
                2 -> res = "3 Цар 17.14"
                16 -> res = "Быт 18.10, 14"
                18 -> res = "Иудифь 8.2"
                25 -> res = "Нав 19.46; 4 Цар 2.25"
                27 -> res = "4 Цар 3.15"
                29 -> res = "Лк 10.4"
                35 -> res = "4 Цар 8.1"
                36 -> res = "3 Цар 17.22"
                37 -> res = "Евр 11.35"
                42 -> res = "Чис 18.19"
                43 -> res = "Ин 6.7"
                44 -> res = "Мф 15.37"
            }
        }
        if (glava == 5) {
            when (stih) {
                7 -> res = "Втор 32.39"
                10 -> res = "Ин 9.7; Лк 17.14"
                14 -> res = "Лк 4.27"
                15 -> res = "Нав 15.19; 1 Цар 25.27"
                27 -> res = "2 Цар 3.29; Исх 4.6; Чис 12.10"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "4 Цар 4.38"
                13 -> res = "Быт 37.17"
                16 -> res = "2 Пар 32.7; 1 Ин 4.4"
                17 -> res = "Чис 24.4; Деян 27.23; Евр 1.14"
                18 -> res = "Быт 19.11"
                22 -> res = "3 Цар 20.31; Притч 25.22; Рим 12.20"
                25 -> res = "4 Цар 7.18"
                28 -> res = "Втор 28.53"
                29 -> res = "Лев 26.29; Плач 4.10; Иез 5.10"
                30 -> res = "4 Цар 5.7"
            }
        }
        if (glava == 7) {
            when (stih) {
                2 -> res = "4 Цар 5.18"
                3 -> res = "Лев 13.46"
                6 -> res = "4 Цар 19.7"
                17, 19 -> res = "4 Цар 7.2"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "4 Цар 4.35"
                8 -> res = "4 Цар 5.5"
                11 -> res = "4 Цар 2.17; Иер 14.17; Лк 19.41"
                12 -> res = "4 Цар 10.32; 12.17; 13.3"
                13 -> res = "3 Цар 19.15"
                16 -> res = "2 Пар 21.3"
                17 -> res = "2 Пар 21.20"
                18 -> res = "4 Цар 16.3; 2 Пар 18.1; 21.6"
                19 -> res = "2 Цар 7.16"
                20 -> res = "Быт 27.40; 2 Пар 21.8"
                22 -> res = "Нав 21.13"
                24 -> res = "2 Пар 22.1"
                26 -> res = "4 Цар 11.1"
                27 -> res = "2 Пар 22.3"
                28 -> res = "3 Цар 22.29"
                29 -> res = "4 Цар 9.15"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "3 Цар 18.46; 4 Цар 4.29"
                2 -> res = "3 Цар 19.16"
                6 -> res = "2 Пар 22.7"
                7 -> res = "3 Цар 21.22; Ос 1.4; Откр 2.20"
                8 -> res = "3 Цар 21.21"
                9 -> res = "3 Цар 15.29; 16.3"
                10, 36, 35, 33 -> res = "3 Цар 21.23"
                14 -> res = "3 Цар 19.16-17"
                15 -> res = "4 Цар 8.29"
                16 -> res = "4 Цар 8.29; 2 Пар 22.6"
                17 -> res = "Иез 33.2"
                21 -> res = "3 Цар 21.1"
                22 -> res = "Евр 12.14"
                24 -> res = "2 Пар 22.8"
                26 -> res = "3 Цар 22.38"
                27 -> res = "2 Пар 22.9; Нав 17.11"
                31 -> res = "3 Цар 16.10"
                34 -> res = "3 Цар 16.31"
            }
        }
        if (glava == 10) {
            when (stih) {
                4 -> res = "4 Цар 9.21, 27"
                10 -> res = "3 Цар 8.56; 21.19, 22"
                13 -> res = "2 Пар 22.8"
                14 -> res = "Ос 1.4"
                15 -> res = "Иер 35.6"
                16 -> res = "3 Цар 19.10"
                17 -> res = "3 Цар 21.21"
                18 -> res = "3 Цар 16.32"
                24 -> res = "3 Цар 20.39"
                25 -> res = "3 Цар 18.40"
                26 -> res = "Втор 7.5; 12.3; 4 Цар 11.18"
                29 -> res = "3 Цар 12.30; 4 Цар 13.2, 11"
                30 -> res = "4 Цар 15.12"
                31 -> res = "3 Цар 15.26"
                32 -> res = "3 Цар 19.17; 4 Цар 8.12"
                34 -> res = "2 Пар 22.7"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "2 Пар 22.10"
                2 -> res = "2 Пар 22.11; 4 Цар 8.19"
                3 -> res = "2 Пар 22.12"
                4 -> res = "2 Пар 23.3"
                6 -> res = "2 Пар 23.4-5; 4 Цар 15.35"
                7 -> res = "1 Пар 9.25; 3 Цар 2.3"
                10 -> res = "2 Пар 23.9"
                12 -> res = "2 Пар 23.11; Втор 17.18; 1 Цар 10.24"
                13 -> res = "2 Пар 23.12"
                14 -> res = "4 Цар 23.3; 3 Цар 8.22; 2 Пар 23.13"
                15 -> res = "2 Пар 23.14"
                16 -> res = "2 Пар 23.15"
                17 -> res = "2 Пар 23.16"
                18 -> res = "4 Цар 10.26; 2 Пар 23.17"
                19 -> res = "2 Пар 23.20"
                20 -> res = "2 Пар 23.21"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "2 Пар 24.1"
                2 -> res = "4 Цар 14.3"
                3 -> res = "3 Цар 15.14"
                4 -> res = "Исх 25.2; 30.13"
                5, 7 -> res = "2 Пар 24.5"
                9 -> res = "2 Пар 24.8"
                10 -> res = "2 Пар 24.11"
                11 -> res = "4 Цар 22.4; 2 Пар 24.12-13"
                13 -> res = "3 Цар 7.50; 2 Пар 24.14"
                15 -> res = "4 Цар 22.7"
                16 -> res = "Лев 5.15"
                17 -> res = "4 Цар 8.12; 13.25"
                18 -> res = "3 Цар 15.18; 4 Цар 16.8; 2 Пар 24.23"
                19 -> res = "3 Цар 14.19; 15.7"
                20 -> res = "2 Пар 24.25"
                21 -> res = "2 Пар 24.27"
            }
        }
        if (glava == 13) {
            when (stih) {
                2 -> res = "4 Цар 10.29; 14.24; 15.9"
                3 -> res = "3 Цар 19.15, 17; 4 Цар 8.12; Ам 1.4"
                5 -> res = "4 Цар 14.17"
                7 -> res = "4 Цар 8.12; 2 Пар 24.23"
                11 -> res = "4 Цар 13.2; 14.24"
                12 -> res = "2 Пар 25.17; 4 Цар 14.8"
                13 -> res = "4 Цар 14.16"
                14 -> res = "4 Цар 2.12"
                21 -> res = "Сир 48.14"
                23 -> res = "Быт 17.7; Исх 2.24; Лев 26.42"
            }
        }
        if (glava == 14) {
            when (stih) {
                2 -> res = "2 Пар 25.1"
                4 -> res = "3 Цар 3.2; 15.14; 4 Цар 12.3"
                6 -> res = "Втор 24.16; 2 Пар 25.4; Иез 18.20"
                7 -> res = "2 Пар 25.11"
                8 -> res = "4 Цар 13.12; 2 Пар 25.17"
                9 -> res = "Суд 9.14; 2 Пар 25.18"
                11 -> res = "2 Пар 25.20"
                12 -> res = "2 Пар 25.22"
                13 -> res = "Зах 14.10"
                14 -> res = "2 Пар 25.24"
                15, 18 -> res = "2 Пар 25.26"
                16 -> res = "4 Цар 13.13"
                17 -> res = "2 Пар 25.25"
                19 -> res = "3 Цар 15.27; 4 Цар 12.20"
                20 -> res = "2 Пар 25.28"
                21 -> res = "4 Цар 15.1-2; 2 Пар 26.1"
                22 -> res = "Втор 2.8; 2 Пар 26.2"
                23 -> res = "Ос 1.1; Ам 1.1; 7.9"
                24 -> res = "3 Цар 15.26; 4 Цар 13.2"
                25 -> res = "Чис 34.3, 8; Иона 1.1"
                26 -> res = "4 Цар 13.4; Втор 32.36"
                28 -> res = "2 Пар 12.15"
                29 -> res = "4 Цар 15.8"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "4 Цар 14.21; 2 Пар 26.1"
                2 -> res = "4 Цар 14.21"
                3 -> res = "4 Цар 14.3; 2 Пар 26.4"
                4 -> res = "3 Цар 22.43"
                5 -> res = "Лев 13.46; 2 Пар 26.21"
                6 -> res = "2 Пар 26.1, 17"
                7 -> res = "2 Пар 26.23"
                8 -> res = "4 Цар 14.29"
                9, 24 -> res = "4 Цар 10.29"
                10 -> res = "2 Пар 28.12; Ам 7.9"
                12 -> res = "4 Цар 10.30"
                14 -> res = "3 Цар 16.8, 17"
                18 -> res = "4 Цар 13.2"
                19 -> res = "1 Пар 5.26; Иер 50.17; Иез 23.5"
                20 -> res = "4 Цар 23.35; 2 Пар 24.6; 30.6"
                25 -> res = "3 Цар 16.9; 4 Цар 14.19"
                28 -> res = "3 Цар 14.16"
                29 -> res = "1 Пар 5.26"
                30 -> res = "4 Цар 12.20; 14.21"
                31 -> res = "2 Пар 28.6"
                32 -> res = "Мих 1.1"
                33 -> res = "2 Пар 27.1"
                35 -> res = "3 Цар 15.14; 2 Пар 27.2"
                36 -> res = "2 Пар 27.1"
                37 -> res = "4 Цар 16.5; Ис 7.1"
                38 -> res = "2 Цар 5.7, 9; 2 Пар 27.9"
            }
        }
        if (glava == 16) {
            when (stih) {
                2 -> res = "2 Пар 28.1"
                3 -> res = "4 Цар 8.18; 2 Пар 28.2; Лев 18.21"
                5 -> res = "Ис 7.1"
                6 -> res = "4 Цар 14.22"
                7 -> res = "2 Пар 28.16; Ос 7.11; Иер 50.17"
                8 -> res = "3 Цар 15.18; 4 Цар 12.18; Ис 7.20"
                10 -> res = "2 Пар 28.23"
                14 -> res = "2 Пар 4.1"
                17 -> res = "3 Цар 7.23, 28"
                18 -> res = "2 Пар 28.24"
                19 -> res = "2 Пар 28.1-2"
                20 -> res = "2 Пар 28.27; Ис 14.28"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "4 Цар 15.30; 18.9"
                3 -> res = "Ис 36.1; Иер 50.17; Ос 10.6"
                4 -> res = "Ос 7.12"
                5, 6 -> res = "4 Цар 18.10"
                8 -> res = "Лев 18.3; 4 Цар 16.3; Ос 7.8"
                9 -> res = "Пс 35.3; Ис 5.20"
                10 -> res = "Лев 26.1"
                12 -> res = "Исх 20.4, 23; 23.13; Втор 5.7"
                13 -> res = "Иер 25.5"
                14 -> res = "Исх 32.9; Втор 31.27"
                15 -> res = "Рим 1.21; Лев 18.24"
                16 -> res = "Исх 32.8; Втор 4.19; 3 Цар 16.31"
                17 -> res = "Лев 18.21; Втор 18.10; Ос 13.2"
                18 -> res = "4 Цар 23.27; Иер 7.15; 3 Цар 11.32"
                21 -> res = "3 Цар 12.16"
                22 -> res = "3 Цар 12.30; 4 Цар 13.2"
                23 -> res = "Иер 25.4"
                24 -> res = "1 Езд 4.10"
                25 -> res = "Лев 26.22"
                28 -> res = "1 Езд 4.2"
                29 -> res = "Иона 1.5; Рим 1.23"
                31 -> res = "Ис 36.19"
                33 -> res = "Ин 4.20; Лк 11.23; 1 Кор 10.21"
                34 -> res = "Иез 20.18; Быт 32.28; 3 Цар 18.31"
                35 -> res = "Исх 20.2-3; 23.13; Суд 6.10"
                36 -> res = "Исх 6.6"
                37 -> res = "Быт 26.5"
                41 -> res = "1 Езд 4.3; Ин 4.22"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "2 Пар 28.27"
                2 -> res = "2 Пар 29.1"
                4 -> res = "Чис 21.9"
                5 -> res = "Притч 3.5; Ис 33.6"
                6 -> res = "Втор 17.11"
                7 -> res = "Притч 16.20; Ис 36.7"
                8 -> res = "Ис 14.29"
                9 -> res = "4 Цар 17.5-6"
                11 -> res = "4 Цар 17.6"
                13 -> res = "2 Пар 32.1; Ис 36.1; Сир 48.20"
                14 -> res = "Мих 1.13"
                15 -> res = "3 Цар 15.18; 4 Цар 12.18; 16.8"
                17 -> res = "2 Пар 32.9; Ис 20.1; 36.2 "
                18 -> res = "4 Цар 19.2; Ис 22.20"
                19 -> res = "2 Пар 32.10"
                21 -> res = "Ис 20.5; 36.6; Иез 29.6"
                22 -> res = "2 Пар 32.11; Исх 20.24; Втор 12.5"
                24 -> res = "Ис 36.9"
                26 -> res = "Ис 22.20; 2 Пар 32.18"
                27 -> res = "4 Цар 6.25"
                29 -> res = "4 Цар 19.10; 2 Пар 32.11; Ис 36.14"
                31 -> res = "3 Цар 4.25"
                33 -> res = "2 Пар 32.13; Ис 36.18"
                35 -> res = "Дан 3.15; 2 Пар 32.14"
                36 -> res = "Ис 36.21"
                37 -> res = "Ис 22.20; Быт 37.29"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "Ис 37.1"
                2 -> res = "4 Цар 18.18"
                3 -> res = "Ис 13.8; 26.18; 37.3"
                5 -> res = "Ис 37.6"
                7 -> res = "4 Цар 7.6; 19.9"
                9 -> res = "Ис 37.9"
                10 -> res = "4 Цар 18.30"
                12 -> res = "4 Цар 18.33; 2 Пар 32.19"
                14 -> res = "Ис 37.14"
                15 -> res = "1 Цар 4.4; Пс 98.1"
                16 -> res = "1 Цар 17.10"
                19 -> res = "Сир 36.5"
                20 -> res = "2 Пар 32.20; Ис 37.21"
                21 -> res = "Ис 1.8"
                23 -> res = "Ис 37.24; Зах 11.2"
                24 -> res = "Ис 37.25"
                25 -> res = "Ис 43.13; 44.7"
                26 -> res = "Пс 36.2; 91.8; Ис 37.27"
                28 -> res = "3 Цар 20.28; Иез 29.4"
                29 -> res = "Ис 37.30; Лев 25.3"
                31 -> res = "Ис 37.32"
                34 -> res = "4 Цар 20.6; 3 Цар 11.13"
                35 -> res = "Сир 48.24; Ис 37.36; 1 Мак 7.41; 2 Мак 8.19; 15.22; 2 Пар 32.21"
                37 -> res = "Тов 1.21; 1 Езд 4.2"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "2 Пар 32.24; Ис 38.1"
                3 -> res = "3 Цар 2.4"
                6 -> res = "Ис 38.5; Евр 11.34; 4 Цар 19.34"
                7 -> res = "Ис 38.21"
                8 -> res = "Суд 6.17"
                9 -> res = "Сир 48.26"
                11 -> res = "Иов 9.7"
                12 -> res = "Ис 39.1"
                13 -> res = "2 Пар 32.27"
                15 -> res = "4 Цар 20.13"
                17 -> res = "4 Цар 24.13; 2 Пар 32.25; Иер 52.17"
                19 -> res = "Ис 39.8; 2 Пар 32.26"
                20 -> res = "4 Цар 18.17; Неем 3.16; 2 Пар 29.1"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "2 Пар 33.1"
                2 -> res = "Втор 18.9; 2 Пар 28.3"
                3 -> res = "2 Пар 33.3"
                4 -> res = "Втор 12.5, 11; 2 Цар 7.13; 3 Цар 8.29; 9.3; Иер 32.34"
                6 -> res = "Лев 19.26; Втор 18.10-11; 1 Цар 28.9; Иер 32.35"
                7 -> res = "3 Цар 9.3"
                8 -> res = "2 Пар 33.8"
                9 -> res = "2 Пар 33.9"
                10, 17 -> res = "2 Пар 33.18"
                11 -> res = "4 Цар 24.3"
                12 -> res = "1 Цар 3.11; Иер 19.3"
                13 -> res = "Ис 34.11; Плач 2.8; Ам 7.9"
                15 -> res = "Иер 15.4"
                16 -> res = "4 Цар 24.4; Иез 22.4"
                18 -> res = "2 Пар 33.20"
                19 -> res = "2 Пар 33.21"
                20 -> res = "2 Пар 33.22"
                22 -> res = "3 Цар 11.33"
                23 -> res = "4 Цар 12.20"
                24 -> res = "4 Цар 14.5; 2 Пар 33.25"
                25 -> res = "2 Пар 33.21"
                26 -> res = "2 Пар 33.25"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "2 Пар 34.1"
                2 -> res = "Сир 49.4"
                3 -> res = "2 Пар 34.8"
                4 -> res = "1 Пар 6.13; 2 Пар 34.9"
                5 -> res = "2 Пар 34.10"
                7 -> res = "4 Цар 12.15"
                8 -> res = "Втор 31.26; 2 Пар 34.14"
                9 -> res = "2 Пар 34.16-17"
                10 -> res = "2 Пар 34.18"
                12 -> res = "2 Пар 34.20; Иер 26.24"
                14 -> res = "Иер 26.24; 2 Пар 34.22"
                15 -> res = "2 Пар 34.23"
                16 -> res = "4 Цар 24.2; 2 Пар 34.24"
                17 -> res = "Втор 31.29; 4 Цар 23.26; Иер 7.20"
                19 -> res = "Иер 24.9; 44.12; Ис 38.5"
                20 -> res = "Ис 57.2; 4 Цар 23.30; 2 Пар 35.24"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "2 Пар 34.29"
                2 -> res = "2 Пар 34.30"
                3 -> res = "3 Цар 8.22; Нав 24.25; 2 Пар 15.12"
                4 -> res = "Сир 49.3"
                5 -> res = "2 Пар 34.33"
                6 -> res = "4 Цар 21.3, 7"
                7 -> res = "Втор 23.17"
                8, 14 -> res = "2 Пар 34.5"
                10 -> res = "Лев 18.21"
                12 -> res = "Суд 6.25; 4 Цар 11.18; 21.5"
                13 -> res = "3 Цар 11.7"
                15 -> res = "3 Цар 12.28"
                16 -> res = "3 Цар 13.2"
                17 -> res = "3 Цар 13.2, 30"
                18 -> res = "3 Цар 13.31"
                21 -> res = "2 Пар 35.1; 2 Езд 1.1"
                22 -> res = "2 Пар 35.18"
                23 -> res = "2 Пар 35.19"
                24 -> res = "2 Пар 35.2"
                25 -> res = "4 Цар 18.5; Сир 49.4"
                26 -> res = "4 Цар 22.17; Иер 15.4"
                27 -> res = "4 Цар 17.18; 24.3; 3 Цар 8.29"
                28 -> res = "2 Пар 34.1"
                29 -> res = "2 Пар 35.20"
                30 -> res = "4 Цар 22.20; 2 Пар 35.23; 36.1"
                31 -> res = "2 Пар 36.2; 4 Цар 24.18"
                33 -> res = "2 Пар 36.3"
                34 -> res = "2 Пар 36.4; Иер 1.3"
                35 -> res = "2 Пар 36.4"
                37 -> res = "4 Цар 24.9"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "2 Пар 36.6; Дан 1.1"
                2 -> res = "4 Цар 22.15; Иер 13.9"
                3 -> res = "4 Цар 21.11"
                4 -> res = "4 Цар 21.16"
                5 -> res = "2 Пар 36.5"
                6 -> res = "Мф 1.11"
                7 -> res = "Быт 15.18"
                8 -> res = "2 Пар 36.9"
                9, 19 -> res = "4 Цар 23.32"
                10 -> res = "Дан 1.1"
                12 -> res = "Иер 22.24; 29.2"
                13 -> res = "2 Пар 36.10; 1 Езд 1.7; Дан 5.2"
                14 -> res = "Есф 2.6; Ис 3.3; Иер 29.2"
                15 -> res = "2 Пар 36.10; Есф 2.6"
                17 -> res = "Иер 37.1"
                18 -> res = "2 Пар 36.11; Иер 52.1"
                20 -> res = "4 Цар 17.18; 2 Пар 36.13"
            }
        }
        if (glava == 25) {
            when (stih) {
                1 -> res = "Иер 39.1; 52.4"
                3 -> res = "Иер 52.6; Плач 4.10"
                4 -> res = "Иер 52.7"
                5 -> res = "Иер 52.8"
                6 -> res = "Иер 38.23; 52.9; Иез 17.16"
                7 -> res = "Иер 39.6; 52.11"
                8 -> res = "Иер 52.12"
                9 -> res = "Пс 73.7; Иез 16.41"
                10 -> res = "2 Пар 36.19"
                11 -> res = "2 Пар 36.20"
                12 -> res = "Иер 52.16"
                13 -> res = "Иер 27.19"
                14 -> res = "3 Цар 7.40; Иер 52.18"
                15 -> res = "Иер 52.19"
                16 -> res = "3 Цар 7.15, 23"
                17 -> res = "3 Цар 7.15; 2 Пар 3.15; Иер 52.21"
                18 -> res = "Иер 52.24"
                19 -> res = "Иер 52.25"
                21 -> res = "Иер 52.27"
                22 -> res = "Иер 40.5"
                23 -> res = "Иер 42.1"
                24 -> res = "Иер 40.9"
                25 -> res = "Иер 41.2, 6-7"
                26 -> res = "Иер 41.17; Ос 9.3"
                27 -> res = "Иер 52.31"
            }
        }
        return res
    }

    fun kniga13(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Быт 4.25; 5.3, 6"
                4 -> res = "Быт 9.18"
                5 -> res = "Быт 10.2"
                10 -> res = "Быт 10.8"
                17 -> res = "Быт 10.22; 11.10"
                19 -> res = "Быт 10.25; 11.16"
                24 -> res = "Быт 11.11"
                25 -> res = "Быт 11.14"
                26 -> res = "Быт 11.22, 24"
                27 -> res = "Быт 17.5"
                28 -> res = "Быт 16.11; 17.19"
                29 -> res = "Быт 25.12"
                32 -> res = "Быт 25.2"
                33 -> res = "Быт 25.4"
                34 -> res = "Быт 25.25-26"
                35 -> res = "Быт 36.10"
                38 -> res = "Быт 36.20"
                40 -> res = "Быт 36.23"
                43 -> res = "Быт 36.31"
                49 -> res = "Быт 36.38"
                51 -> res = "Быт 36.40"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Быт 29.32"
                2 -> res = "Быт 35.18, 25"
                3 -> res = "Быт 38.3"
                4 -> res = "1 Пар 4.1; Быт 38.29; Мф 1.3; Руфь 4.18"
                7 -> res = "Нав 7.1; 22.20"
                10 -> res = "Руфь 4.19"
                15 -> res = "Мф 1.6"
                50 -> res = "Нав 9.17"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "2 Цар 3.2"
                5 -> res = "2 Цар 5.14"
                9 -> res = "2 Цар 13.1"
                10 -> res = "Мф 1.7"
                15 -> res = "4 Цар 23.30, 34; 24.17"
                16 -> res = "Мф 1.11"
                19 -> res = "1 Езд 5.2"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "1 Пар 2.4; Быт 38.29; 46.12"
                24 -> res = "Быт 46.10; Исх 6.15"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Быт 35.22-23; 46.8; 49.3-4; Исх 6.14; Чис 26.5"
                2 -> res = "Быт 49.10"
                3 -> res = "Быт 46.9; Исх 6.14"
                6 -> res = "4 Цар 15.29"
                10 -> res = "Пс 82.7"
                11 -> res = "Нав 13.24"
                16 -> res = "Ис 33.9"
                17 -> res = "4 Цар 15.7"
                19 -> res = "Быт 25.15"
                20 -> res = "Исх 17.11; 1 Мак 4.10; Пс 144.19"
                22 -> res = "1 Цар 17.3"
                23 -> res = "Втор 3.9"
                25 -> res = "4 Цар 17.7"
                26 -> res = "4 Цар 15.29; 16.7"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "1 Пар 23.6; Быт 46.11; Исх 6.16; Чис 3.17; 26.57"
                3 -> res = "Исх 6.20"
                4 -> res = "Исх 6.25; 28.1"
                6 -> res = "1 Езд 7.3"
                8 -> res = "2 Цар 8.17; 15.27"
                13 -> res = "4 Цар 22.4"
                14 -> res = "4 Цар 25.18; 1 Езд 7.1; Иер 52.24"
                16 -> res = "Исх 6.16"
                18 -> res = "Исх 6.18; 1 Пар 23.12"
                22 -> res = "Исх 6.24"
                27 -> res = "1 Цар 1.1"
                28 -> res = "1 Цар 8.2"
                33, 44, 39 -> res = "1 Пар 15.17"
                54 -> res = "Нав 21.10"
                57 -> res = "Нав 21.13"
                67 -> res = "Нав 21.21"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Быт 46.13"
                6 -> res = "1 Пар 8.1; Быт 46.21"
                12 -> res = "Быт 46.21; Чис 26.42"
                13 -> res = "Быт 46.24"
                14 -> res = "Чис 26.29; Нав 17.1"
                15 -> res = "Чис 26.33; 27.1"
                20 -> res = "Чис 26.35"
                28 -> res = "Нав 16.1; Быт 48.22"
                29 -> res = "Нав 17.11"
                30 -> res = "Быт 46.17"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "1 Пар 7.6; Быт 46.21"
                6 -> res = "1 Цар 11.4"
                12 -> res = "Неем 11.35"
                13 -> res = "Нав 19.42"
                29 -> res = "1 Пар 9.35"
                32 -> res = "1 Пар 9.38"
                33 -> res = "1 Пар 9.39; 1 Цар 14.51"
                34 -> res = "2 Цар 4.4; 9.9"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "4 Цар 24.15"
                2 -> res = "Неем 11.3"
                11 -> res = "4 Цар 22.8"
                18 -> res = "4 Цар 16.18; Иез 46.1"
                19 -> res = "Пс 41.1"
                20 -> res = "Чис 25.11"
                22 -> res = "Пс 83.11; 1 Цар 9.11"
                30 -> res = "Исх 30.34"
                31 -> res = "Лев 2.5"
                32 -> res = "Исх 25.30"
                35 -> res = "1 Пар 8.29"
                38 -> res = "1 Пар 8.32"
                39 -> res = "1 Пар 8.33"
                41 -> res = "1 Пар 8.35"
                44 -> res = "1 Пар 8.38"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "1 Цар 31.1"
                4 -> res = "1 Цар 31.4; Суд 9.54"
                7 -> res = "1 Цар 31.7"
                10 -> res = "1 Цар 31.10"
                11 -> res = "Суд 21.8; 1 Цар 31.11"
                12 -> res = "1 Цар 31.13; 2 Цар 2.5"
                13 -> res = "1 Цар 15.23; 28.8, 16-17"
                14 -> res = "1 Цар 16.13; 2 Цар 12.7"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "2 Цар 5.1"
                2 -> res = "1 Цар 16.13; 18.13; Пс 77.71"
                3 -> res = "1 Пар 12.38; 1 Цар 16.13"
                4 -> res = "2 Цар 5.6"
                6 -> res = "2 Цар 5.8"
                9 -> res = "2 Цар 5.10"
                10, 11 -> res = "2 Цар 23.8"
                12 -> res = "2 Цар 23.9"
                14 -> res = "2 Цар 23.12"
                17 -> res = "2 Цар 23.15"
                20 -> res = "2 Цар 23.18"
                21 -> res = "2 Цар 23.19"
                22 -> res = "2 Цар 23.20"
                23 -> res = "1 Цар 17.7"
                25 -> res = "2 Цар 23.23"
                26 -> res = "2 Цар 23.24"
                30 -> res = "2 Цар 23.28"
                41 -> res = "2 Цар 11.3"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "1 Цар 27.6"
                2 -> res = "Суд 20.16"
                8 -> res = "1 Цар 23.14; 2 Цар 2.18"
                15 -> res = "Нав 3.15; Сир 24.28"
                18 -> res = "Суд 6.34"
                19 -> res = "1 Цар 29.4"
                21 -> res = "1 Цар 27.8"
                23 -> res = "1 Цар 16.12; 2 Цар 5.1; 1 Пар 11.3"
                28 -> res = "2 Цар 8.17; 15.24"
                29 -> res = "2 Цар 3.6"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "2 Цар 6.2"
                5 -> res = "2 Цар 6.1"
                6 -> res = "1 Цар 4.4; 2 Цар 6.2; 4 Цар 19.15"
                7 -> res = "Чис 4.15; 2 Цар 6.3"
                9 -> res = "2 Цар 6.6"
                10 -> res = "Чис 4.15"
                11 -> res = "2 Цар 6.8"
                14 -> res = "2 Цар 6.11"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "2 Цар 5.11"
                3 -> res = "2 Цар 5.13"
                4 -> res = "2 Цар 5.14; 1 Пар 3.5"
                8 -> res = "2 Цар 5.17, 20"
                11 -> res = "2 Цар 5.20"
                12 -> res = "Втор 7.5"
                13 -> res = "2 Цар 5.22"
                16 -> res = "2 Цар 5.25"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "2 Цар 6.17"
                2 -> res = "Чис 4.15"
                3 -> res = "1 Пар 13.5"
                12 -> res = "Чис 8.6"
                13 -> res = "1 Пар 13.11; 2 Цар 6.7"
                15 -> res = "Исх 25.14"
                16, 25 -> res = "2 Цар 6.12"
                17 -> res = "1 Пар 16.37"
                18 -> res = "1 Пар 16.38"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "2 Цар 6.17"
                2 -> res = "2 Цар 6.18"
                3, 43 -> res = "2 Цар 6.19"
                8 -> res = "Пс 104; Ис 12.4"
                15 -> res = "Быт 17.9; Исх 2.24; Лев 26.42"
                16 -> res = "Быт 12.7; 22.16; Лк 1.73"
                19 -> res = "Втор 32.9"
                22 -> res = "Пс 104.15"
                23 -> res = "Пс 95.1"
                24 -> res = "Пс 95.3"
                25 -> res = "Пс 94.3; Исх 15.11; 18.11"
                27 -> res = "Пс 95.6"
                34 -> res = "1 Езд 3.11"
                35 -> res = "Втор 30.3"
                36 -> res = "Пс 40.14; Втор 27.15; Неем 8.6"
                40 -> res = "Исх 27.21; Чис 28.3"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "2 Цар 7.2"
                2 -> res = "2 Цар 7.3"
                3 -> res = "2 Цар 7.4-5"
                4 -> res = "3 Цар 8.19"
                5 -> res = "Исх 7.5"
                7 -> res = "1 Цар 16.12"
                9 -> res = "2 Цар 7.10"
                10 -> res = "Пс 17.48"
                11 -> res = "2 Цар 7.12; Гал 3.16; Мф 1.1"
                13 -> res = "2 Цар 7.14"
                14 -> res = "1 Тим 3.15; Ис 55.3; Лк 1.32"
                15 -> res = "2 Цар 7.17"
                16 -> res = "2 Цар 7.18"
                17 -> res = "2 Цар 7.19"
                18 -> res = "Пс 138.1"
                20 -> res = "2 Цар 7.22"
                21 -> res = "Втор 4.7"
                23 -> res = "2 Цар 7.25"
                25 -> res = "2 Цар 7.27"
                27 -> res = "2 Цар 7.29"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "2 Цар 8.1"
                2 -> res = "2 Цар 8.2; Пс 29.2"
                6 -> res = "2 Цар 8.14"
                7 -> res = "2 Цар 8.7"
                8 -> res = "2 Цар 8.8; 3 Цар 7.23"
                9 -> res = "2 Цар 8.9"
                12 -> res = "1 Пар 2.16; 2 Цар 8.13; Пс 59.2"
                14 -> res = "2 Цар 8.15; Пс 100.1"
                15 -> res = "2 Цар 8.16"
                16 -> res = "1 Пар 24.6"
                17 -> res = "2 Цар 8.18"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "2 Цар 10.1"
                3 -> res = "2 Цар 10.3"
                4 -> res = "2 Цар 10.4"
                11 -> res = "2 Цар 10.10"
                13 -> res = "1 Цар 3.18; 2 Цар 10.12; 1 Мак 3.60"
                16 -> res = "2 Цар 10.15"
                19 -> res = "2 Цар 10.19"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "2 Цар 11.1; 12.26"
                2 -> res = "2 Цар 12.30"
                4 -> res = "2 Цар 21.18"
                5 -> res = "2 Цар 21.19"
                6 -> res = "2 Цар 21.20"
                7 -> res = "1 Цар 16.9; 17.10"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "2 Цар 24.1"
                4 -> res = "2 Цар 24.4"
                7 -> res = "1 Пар 27.24"
                8 -> res = "2 Цар 24.10"
                9 -> res = "2 Цар 24.11; 1 Цар 9.9"
                11 -> res = "2 Цар 24.13"
                13 -> res = "2 Цар 24.14; Плач 3.22; Сир 2.18"
                15 -> res = "2 Цар 24.16"
                17 -> res = "2 Цар 24.17"
                18 -> res = "2 Цар 24.18; 2 Пар 3.1"
                21 -> res = "2 Цар 14.4"
                26 -> res = "2 Цар 24.25; Лев 9.24; 3 Цар 18.38"
                29 -> res = "2 Цар 6.17; 2 Пар 1.3"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "Втор 12.5; 1 Пар 21.26"
                2 -> res = "2 Пар 2.17; 3 Цар 5.15"
                5 -> res = "1 Пар 29.1"
                7 -> res = "1 Пар 17.1"
                8 -> res = "1 Пар 28.3"
                9 -> res = "2 Цар 7.11; 12.24"
                10 -> res = "2 Цар 7.13; 3 Цар 5.5; 9.5; Евр 1.5"
                13 -> res = "Втор 31.6; Нав 1.7; 3 Цар 2.2"
                14 -> res = "1 Пар 29.2"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "3 Цар 1.33"
                3 -> res = "Чис 4.3; 8.24"
                4 -> res = "Втор 16.18"
                5 -> res = "1 Пар 9.22; Иез 40.44; 2 Пар 29.25"
                6 -> res = "2 Пар 8.14; 1 Пар 6.1; Исх 6.16; Чис 3.17; 26.57"
                12 -> res = "Исх 6.18"
                13 -> res = "Исх 6.20; Чис 3.10; Евр 5.4"
                15 -> res = "Исх 2.22; 18.3"
                19 -> res = "1 Пар 24.23-24"
                21 -> res = "Исх 6.19; 1 Пар 6.19"
                22 -> res = "1 Пар 24.28"
                24 -> res = "Чис 8.24"
                28 -> res = "2 Пар 31.17"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "Чис 3.2"
                2 -> res = "Чис 3.4; 26.61"
                5 -> res = "Лк 1.5"
                6 -> res = "1 Пар 18.16"
                9 -> res = "Иер 21.1"
                19 -> res = "2 Пар 31.2; 4 Цар 11.5"
                23 -> res = "1 Пар 23.19"
                28 -> res = "1 Пар 23.22"
                30 -> res = "1 Пар 23.23"
                31 -> res = "1 Пар 25.8"
            }
        }
        if (glava == 25) {
            when (stih) {
                1 -> res = "Чис 4.23; Сир 47.11; 2 Пар 5.12"
                4 -> res = "3 Цар 16.1"
                7 -> res = "1 Цар 10.5"
                8 -> res = "1 Пар 24.31"
            }
        }
        if (glava == 26) {
            when (stih) {
                1 -> res = "Пс 41.1"
                13 -> res = "1 Пар 24.31"
                20, 26 -> res = "3 Цар 7.51"
                21 -> res = "1 Пар 23.8"
                24 -> res = "1 Пар 23.16"
                27 -> res = "Чис 31.28"
                28 -> res = "1 Цар 9.9; 1 Пар 9.22"
                31 -> res = "1 Пар 23.19"
            }
        }
        if (glava == 27) {
            when (stih) {
                4 -> res = "2 Цар 23.9; 1 Пар 11.12"
                5 -> res = "2 Цар 23.20"
                6 -> res = "2 Цар 23.22"
                11 -> res = "2 Цар 21.18"
                14 -> res = "2 Цар 23.20, 30"
                15 -> res = "2 Цар 23.29"
                23 -> res = "Чис 1.3; Быт 15.5; 22.17"
                24 -> res = "1 Пар 21.7"
                29 -> res = "Ис 33.9"
                32 -> res = "2 Цар 13.3; 21.21"
                33 -> res = "2 Цар 15.12, 37"
                34 -> res = "2 Цар 8.16; 20.23"
            }
        }
        if (glava == 28) {
            when (stih) {
                2 -> res = "2 Цар 7.2; 1 Пар 17.1; Деян 7.46"
                3 -> res = "1 Пар 22.8"
                4 -> res = "Быт 49.8, 10; 1 Цар 16.12"
                5 -> res = "3 Цар 3.6; 2 Пар 1.8; Прем 9.7"
                6 -> res = "2 Цар 7.13; 3 Цар 5.5; 1 Пар 17.11"
                7 -> res = "2 Цар 7.13; 1 Пар 17.12"
                9 -> res = "1 Цар 16.7; Пс 7.10; Иер 11.20; 17.10; 20.12; Откр 2.23"
                11 -> res = "Исх 25.9"
                12 -> res = "3 Цар 6.5"
                20 -> res = "Втор 31.6; 1 Пар 22.13; Евр 13.5"
            }
        }
        if (glava == 29) {
            when (stih) {
                1 -> res = "1 Пар 22.5"
                2 -> res = "1 Пар 22.14; Деян 7.46"
                5 -> res = "Исх 32.29; 35.5"
                9 -> res = "2 Пар 31.8"
                11 -> res = "Мф 6.13; 1 Тим 1.17; Откр 4.10"
                12 -> res = "2 Пар 20.6"
                14 -> res = "Иов 35.7; Флп 2.13"
                15 -> res = "Пс 38.13; 89.9; Прем 2.5"
                17 -> res = "1 Пар 28.9; Деян 1.24"
                18 -> res = "Исх 3.6; 4.5"
                22 -> res = "3 Цар 1.33; 2.35; 4.20"
                23 -> res = "3 Цар 2.12"
                25 -> res = "3 Цар 3.13"
                26 -> res = "3 Цар 2.11"
                27 -> res = "2 Цар 5.5"
                28 -> res = "Быт 25.8"
            }
        }
        return res
    }

    fun kniga14(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "3 Цар 2.12; 3.1"
                3 -> res = "3 Цар 3.4; 1 Пар 16.39; Исх 40.18"
                4 -> res = "2 Цар 6.17"
                5 -> res = "Исх 31.2; 38.1"
                7 -> res = "3 Цар 3.5"
                8 -> res = "1 Пар 28.5"
                9 -> res = "3 Цар 3.8; Прем 9.7"
                10 -> res = "3 Цар 3.12; Прем 7.7; Чис 27.17"
                11 -> res = "3 Цар 3.11-12"
                12 -> res = "3 Цар 3.13; 4.31; 2 Пар 9.22"
                14 -> res = "3 Цар 10.26"
                15 -> res = "3 Цар 10.27"
                16 -> res = "3 Цар 10.28"
                17 -> res = "3 Цар 10.29"
            }
        }
        if (glava == 2) {
            when (stih) {
                2, 18 -> res = "3 Цар 5.15"
                3 -> res = "3 Цар 5.2"
                5 -> res = "Втор 10.17; Пс 88.7"
                6 -> res = "3 Цар 8.27; Ис 66.1; Иер 23.24"
                8 -> res = "3 Цар 10.12"
                9 -> res = "3 Цар 5.6"
                10 -> res = "3 Цар 5.11"
                12 -> res = "3 Цар 5.7"
                13 -> res = "3 Цар 7.13"
                14 -> res = "Исх 31.4; 3 Цар 7.14"
                17 -> res = "1 Пар 22.2"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "3 Цар 6.1; 1 Пар 21.18; 2 Цар 24.18"
                3 -> res = "3 Цар 6.2"
                4 -> res = "3 Цар 6.3"
                5 -> res = "3 Цар 6.15, 21"
                6 -> res = "3 Цар 9.28"
                8 -> res = "3 Цар 6.16, 20, 28"
                10 -> res = "Исх 25.18; 3 Цар 6.23"
                11 -> res = "3 Цар 6.24"
                13 -> res = "Исх 25.20"
                14 -> res = "Исх 26.1, 31"
                15 -> res = "4 Цар 25.13; Иер 52.17"
                16 -> res = "3 Цар 7.17"
                17 -> res = "3 Цар 7.21"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Исх 27.1; 3 Цар 8.64"
                2 -> res = "3 Цар 7.23"
                4 -> res = "3 Цар 7.25"
                5 -> res = "3 Цар 7.26"
                6 -> res = "3 Цар 7.38"
                7 -> res = "3 Цар 7.49; 1 Пар 28.15"
                8 -> res = "1 Пар 28.16"
                11 -> res = "3 Цар 7.40, 45"
                12 -> res = "3 Цар 7.15; 2 Пар 3.15-16"
                14 -> res = "3 Цар 7.27"
                17 -> res = "3 Цар 7.46"
                18 -> res = "3 Цар 7.47"
                19 -> res = "3 Цар 7.48"
                20 -> res = "3 Цар 7.49"
                22 -> res = "3 Цар 6.31"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "3 Цар 7.51"
                2 -> res = "3 Цар 8.1"
                3 -> res = "3 Цар 8.2, 65"
                4 -> res = "Чис 4.15; 1 Пар 15.2"
                6 -> res = "3 Цар 8.5"
                7 -> res = "3 Цар 8.6"
                9 -> res = "3 Цар 8.8"
                10 -> res = "Исх 25.16, 21; 3 Цар 8.9; Евр 9.4"
                11 -> res = "3 Цар 8.10"
                12 -> res = "1 Пар 25.1"
                13 -> res = "1 Езд 3.11; Пс 135.1; Плач 3.22"
                14 -> res = "Исх 40.35; 3 Цар 8.11"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "3 Цар 8.12"
                3 -> res = "2 Цар 6.18; 3 Цар 8.14, 55"
                4 -> res = "3 Цар 8.15"
                5 -> res = "2 Цар 7.6; 3 Цар 8.16"
                7 -> res = "2 Цар 7.2; 3 Цар 8.17; 1 Пар 17.1"
                9 -> res = "3 Цар 8.19; Прем 9.8"
                10 -> res = "3 Цар 8.20"
                12 -> res = "3 Цар 8.22; 1 Езд 9.5"
                13 -> res = "3 Цар 8.22; 2 Мак 2.8; Еф 3.14"
                14 -> res = "2 Мак 2.10; 3 Цар 8.23"
                16 -> res = "3 Цар 8.25; 2 Цар 7.16"
                17 -> res = "3 Цар 8.17"
                18 -> res = "3 Цар 8.27; 2 Пар 2.6; Ис 66.1"
                20 -> res = "3 Цар 8.29; Втор 12.5; 31.11"
                21 -> res = "3 Цар 8.30"
                22 -> res = "3 Цар 8.31; Исх 22.11"
                23 -> res = "3 Цар 8.32"
                24 -> res = "3 Цар 8.33-34; Втор 28.25"
                26 -> res = "Лев 26.19; Втор 11.17; 3 Цар 8.35"
                28 -> res = "2 Пар 20.9"
                32 -> res = "3 Цар 8.41; Ис 55.5-6"
                36 -> res = "3 Цар 8.46; Притч 20.9; Еккл 7.20; 3 Езд 8.35; 1 Ин 1.8"
                37 -> res = "Дан 9.13; Чис 14.40"
                38 -> res = "1 Цар 7.6; 3 Цар 8.47-48"
                39 -> res = "Пс 33.16"
                41 -> res = "Чис 10.36; Пс 131.8-9"
                42 -> res = "2 Цар 7.13, 15"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "2 Мак 2.10"
                2 -> res = "3 Цар 8.11"
                3 -> res = "2 Пар 5.13; 1 Езд 3.11"
                4 -> res = "3 Цар 8.62"
                5 -> res = "3 Цар 8.63"
                6 -> res = "1 Пар 16.5; Чис 10.10; Сир 50.18"
                7 -> res = "3 Цар 8.64"
                8 -> res = "3 Цар 8.65; Чис 13.22"
                9 -> res = "Ин 7.37; 3 Цар 8.2, 65"
                10 -> res = "3 Цар 8.66"
                11 -> res = "3 Цар 9.1"
                12 -> res = "Втор 12.5"
                14 -> res = "Пс 105.6; Втор 28.10; Ам 9.12"
                15 -> res = "2 Пар 6.40"
                16 -> res = "3 Цар 9.3"
                18 -> res = "2 Цар 7.12; 3 Цар 9.5; 1 Пар 17.12"
                19 -> res = "3 Цар 9.6"
                20 -> res = "Втор 4.26; Нав 23.16; Иер 7.15"
                21 -> res = "Втор 29.24; 3 Цар 9.8; Иер 22.8"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "3 Цар 9.10"
                2 -> res = "3 Цар 9.11-12"
                3 -> res = "Чис 13.22"
                5 -> res = "3 Цар 9.17"
                6 -> res = "3 Цар 9.18-19"
                7 -> res = "3 Цар 9.20"
                8 -> res = "Нав 16.10; Суд 1.28; 3 Цар 9.21"
                10 -> res = "3 Цар 9.23"
                11 -> res = "3 Цар 9.24"
                13 -> res = "Исх 23.14; Лев 24.8; 3 Цар 9.25"
                14 -> res = "1 Пар 24.1; 27.1"
                17 -> res = "3 Цар 9.26-27"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "3 Цар 10.1; Мф 12.42; Лк 11.31"
                2 -> res = "3 Цар 10.3"
                3 -> res = "3 Цар 10.4-5"
                5 -> res = "3 Цар 10.6"
                7 -> res = "3 Цар 10.8; Мф 13.16-17"
                8 -> res = "3 Цар 10.9; 2 Пар 2.11"
                9 -> res = "3 Цар 10.10"
                10 -> res = "3 Цар 10.11"
                12 -> res = "3 Цар 10.13"
                13 -> res = "3 Цар 10.14"
                15 -> res = "3 Цар 10.16; 14.26"
                17 -> res = "3 Цар 10.18"
                20 -> res = "3 Цар 10.21"
                21 -> res = "3 Цар 10.22"
                22 -> res = "3 Цар 10.23; 2 Пар 1.12"
                23 -> res = "Иак 1.5"
                25 -> res = "3 Цар 4.26; 10.26"
                26 -> res = "3 Цар 4.21"
                27 -> res = "3 Цар 10.27; 2 Пар 1.15"
                29 -> res = "3 Цар 1.11; 11.41"
                30 -> res = "3 Цар 11.42"
                31 -> res = "3 Цар 11.43"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "3 Цар 12.1"
                2 -> res = "3 Цар 11.40; 12.2"
                5 -> res = "3 Цар 12.5"
                8 -> res = "3 Цар 12.8"
                10 -> res = "3 Цар 12.10"
                12 -> res = "3 Цар 12.12; Сир 47.28"
                15 -> res = "3 Цар 11.29, 31; 12.15"
                16 -> res = "3 Цар 12.16; 2 Цар 20.1"
                18 -> res = "3 Цар 4.6; 12.18"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "3 Цар 12.21"
                2 -> res = "3 Цар 12.22"
                4 -> res = "3 Цар 12.24; 2 Пар 10.15"
                6 -> res = "Быт 35.19"
                14 -> res = "Чис 35.2; 3 Цар 12.31"
                15 -> res = "3 Цар 12.31; 2 Пар 13.9"
                17 -> res = "2 Пар 12.1"
                18 -> res = "1 Цар 16.6"
                20 -> res = "2 Пар 13.2"
                21 -> res = "3 Цар 15.2"
                22 -> res = "3 Цар 15.1"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "2 Пар 11.17; Втор 32.15; 3 Цар 14.22"
                2 -> res = "3 Цар 14.25"
                5 -> res = "2 Пар 15.2"
                6 -> res = "Дан 9.14"
                7 -> res = "Иер 18.8"
                9 -> res = "3 Цар 10.16-17; 14.26; 2 Пар 9.15"
                10 -> res = "3 Цар 14.27"
                12 -> res = "3 Цар 14.13; 21.29"
                13 -> res = "3 Цар 14.21"
                15 -> res = "3 Цар 14.29; 15.6"
                16 -> res = "3 Цар 14.31"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "3 Цар 15.1"
                2 -> res = "3 Цар 15.2; 2 Пар 11.20"
                3 -> res = "3 Цар 15.7"
                6 -> res = "3 Цар 11.26"
                8 -> res = "3 Цар 12.28"
                9 -> res = "2 Пар 11.15; 3 Цар 12.31"
                11 -> res = "Исх 27.21; Лев 8.35; 24.4, 6"
                12 -> res = "Втор 20.4; Чис 10.9; 14.41"
                14 -> res = "Чис 10.9; Нав 6.3"
                18 -> res = "Пс 105.42"
                19 -> res = "3 Цар 12.29; Ин 11.54"
                22 -> res = "3 Цар 15.3"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "3 Цар 15.8"
                2 -> res = "3 Цар 15.11"
                3 -> res = "3 Цар 15.12"
                9 -> res = "2 Пар 16.8"
                11 -> res = "1 Цар 14.6"
                12 -> res = "2 Пар 13.15; 16.8"
                14 -> res = "2 Пар 17.10; 20.29"
            }
        }
        if (glava == 15) {
            when (stih) {
                2 -> res = "Втор 20.1; 31.16-17; Ис 55.6"
                3 -> res = "Ос 3.4; Ам 8.11"
                4 -> res = "Прем 1.2"
                6 -> res = "Мф 24.6"
                7 -> res = "Лк 21.19; 1 Кор 15.58; Гал 6.9"
                12 -> res = "Нав 24.24-25; Втор 6.5"
                13 -> res = "2 Пар 22.9"
                16 -> res = "3 Цар 15.13"
                17 -> res = "3 Цар 15.14; 22.43; Лк 1.6"
                18 -> res = "2 Пар 5.1"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "3 Цар 15.17"
                2 -> res = "3 Цар 15.18; 4 Цар 12.18"
                4 -> res = "3 Цар 15.20"
                5 -> res = "3 Цар 15.21"
                6 -> res = "Нав 18.24"
                7 -> res = "2 Пар 19.2"
                8 -> res = "2 Пар 14.9; Ис 20.5"
                9 -> res = "2 Мак 9.5"
                13 -> res = "3 Цар 15.24"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "3 Цар 15.24; 22.41"
                3 -> res = "2 Пар 19.3"
                5 -> res = "3 Цар 22.44; 2 Пар 18.1"
                10 -> res = "2 Пар 14.14"
                16 -> res = "Чис 6.2"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "2 Пар 17.5; 4 Цар 8.18"
                2 -> res = "3 Цар 22.2"
                3 -> res = "3 Цар 22.4"
                5 -> res = "3 Цар 22.6"
                6 -> res = "3 Цар 22.7"
                8 -> res = "3 Цар 22.9"
                10 -> res = "3 Цар 22.11"
                12 -> res = "3 Цар 22.13"
                16 -> res = "Чис 27.17; 3 Цар 22.17"
                20 -> res = "3 Цар 22.21; Иов 1.6"
                21 -> res = "Ин 8.44; 1 Ин 4.6; 3 Цар 22.22"
                22 -> res = "Ис 19.14; Иез 14.9"
                23 -> res = "Иер 20.2; Мк 14.65; Ин 18.22"
                24 -> res = "3 Цар 20.30, 39; 22.25"
                29 -> res = "3 Цар 22.30"
                31 -> res = "3 Цар 22.32; Пс 65.9"
                33 -> res = "3 Цар 22.34"
                34 -> res = "3 Цар 22.35"
            }
        }
        if (glava == 19) {
            when (stih) {
                2 -> res = "3 Цар 16.1"
                3 -> res = "3 Цар 14.13; 2 Пар 12.12; Неем 9.8"
                5 -> res = "Втор 16.18"
                6 -> res = "Втор 1.17; Пс 81.2; Прем 6.4"
                7 -> res = "Втор 10.17; Иов 34.19; Прем 6.7; Сир 35.12; Деян 10.34; 1 Пет 1.17; Рим 2.11; Гал 2.6; Еф 6.9; Кол 3.25"
                10 -> res = "Втор 17.8"
                11 -> res = "Зах 3.7"
            }
        }
        if (glava == 20) {
            when (stih) {
                2 -> res = "Быт 14.7; Нав 15.62"
                3 -> res = "2 Пар 17.3"
                6 -> res = "Пс 8.2; 46.8-9; 2 Пар 14.11"
                7 -> res = "Ис 41.8; Ин 8.33; Иак 2.23"
                9 -> res = "2 Пар 6.28"
                10 -> res = "Втор 2.9"
                12 -> res = "Пс 24.15; 120.1; Мф 8.25"
                14 -> res = "Суд 11.29; 2 Пар 24.20"
                15 -> res = "Исх 14.13; Нав 10.14; Ис 33.2"
                17 -> res = "Исх 14.13; Чис 14.9"
                20 -> res = "2 Цар 14.2; Пс 45.1-2; Исх 14.31"
                23 -> res = "Суд 7.22; 1 Цар 14.20"
                29 -> res = "2 Пар 14.14"
                30 -> res = "2 Пар 14.6; 15.15"
                31 -> res = "3 Цар 22.42"
                33 -> res = "3 Цар 22.43"
                34 -> res = "3 Цар 22.45"
                35 -> res = "3 Цар 22.4"
                36 -> res = "3 Цар 22.48"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "3 Цар 22.50"
                4 -> res = "4 Цар 8.16"
                5 -> res = "4 Цар 8.17"
                6 -> res = "4 Цар 8.18; 16.3; 2 Пар 18.1"
                7 -> res = "2 Цар 7.12"
                8 -> res = "Быт 27.40; 4 Цар 8.20"
                11 -> res = "Лев 17.7; 20.5; 3 Цар 13.2"
                12 -> res = "3 Цар 15.26"
                20 -> res = "4 Цар 8.17, 24"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "4 Цар 8.24"
                2 -> res = "4 Цар 8.26; 11.1"
                3 -> res = "4 Цар 8.27"
                5 -> res = "4 Цар 8.28; Нав 20.8"
                6 -> res = "4 Цар 8.29; 9.15-16"
                7 -> res = "3 Цар 12.15; 19.16; 4 Цар 9.6"
                8 -> res = "3 Цар 19.17; 4 Цар 9.24"
                9 -> res = "4 Цар 9.27-28"
                10 -> res = "4 Цар 11.1"
                11 -> res = "4 Цар 11.2"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "4 Цар 11.4"
                3 -> res = "2 Цар 7.13"
                4 -> res = "4 Цар 11.5"
                5 -> res = "4 Цар 11.6"
                6 -> res = "Чис 8.6; 16.5; 1 Езд 8.28-29"
                9 -> res = "4 Цар 11.10"
                11 -> res = "4 Цар 11.12; Втор 17.18"
                12 -> res = "4 Цар 11.13"
                13 -> res = "4 Цар 11.14; Чис 10.10"
                14 -> res = "4 Цар 11.15"
                15 -> res = "4 Цар 11.16"
                16 -> res = "4 Цар 11.17"
                17 -> res = "4 Цар 11.18"
                18 -> res = "2 Пар 29.25; Лев 1.3"
                20 -> res = "4 Цар 11.19"
                21 -> res = "4 Цар 11.20"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "4 Цар 12.1"
                2, 17 -> res = "4 Цар 12.2"
                5 -> res = "4 Цар 12.5"
                6, 9 -> res = "Исх 35.5"
                7 -> res = "4 Цар 11.1; 12.8"
                8 -> res = "4 Цар 12.9"
                11 -> res = "4 Цар 12.10"
                12 -> res = "4 Цар 12.11; 22.4-5"
                13 -> res = "4 Цар 12.14"
                14 -> res = "4 Цар 12.11"
                19 -> res = "2 Пар 33.10"
                20 -> res = "2 Пар 15.2; 20.14"
                21 -> res = "Мф 23.35; Лк 11.50-51"
                23 -> res = "4 Цар 12.18"
                24 -> res = "2 Пар 12.1; 22.8"
                25 -> res = "4 Цар 12.20; 21.18, 26"
                26 -> res = "4 Цар 12.21"
                27 -> res = "4 Цар 12.1, 21; 14.1"
            }
        }
        if (glava == 25) {
            when (stih) {
                1 -> res = "4 Цар 14.2"
                2 -> res = "4 Цар 14.3; 2 Пар 26.4"
                3 -> res = "4 Цар 14.5; 2 Пар 24.25"
                4 -> res = "Втор 24.16; 4 Цар 14.6; Иез 18.20"
                5 -> res = "Чис 1.3"
                8 -> res = "2 Пар 20.15; Пс 32.17; 61.7"
                11 -> res = "4 Цар 14.7"
                15 -> res = "Втор 32.37; Суд 10.14"
                17 -> res = "4 Цар 13.12; 14.8"
                18 -> res = "3 Езд 4.13"
                20 -> res = "4 Цар 14.11; 2 Пар 22.7"
                22 -> res = "4 Цар 14.12"
                23 -> res = "4 Цар 14.13"
                24 -> res = "4 Цар 14.14; 1 Пар 26.15"
                25 -> res = "4 Цар 14.17"
                26 -> res = "4 Цар 14.1"
                27 -> res = "3 Цар 15.27; 4 Цар 14.19"
            }
        }
        if (glava == 26) {
            when (stih) {
                1 -> res = "4 Цар 14.21; 15.1"
                3 -> res = "4 Цар 15.2"
                4 -> res = "4 Цар 15.3; 2 Пар 25.2"
                5 -> res = "4 Цар 12.2"
                6 -> res = "Ам 1.8"
                16 -> res = "4 Цар 15.6; 2 Пар 25.19; Исх 30.7"
                17 -> res = "1 Пар 6.10"
                18 -> res = "Чис 18.7; Евр 5.4"
                19 -> res = "4 Цар 5.27; 15.5"
                21 -> res = "4 Цар 15.5"
                23 -> res = "4 Цар 15.7"
            }
        }
        if (glava == 27) {
            when (stih) {
                1 -> res = "4 Цар 15.33"
                2 -> res = "4 Цар 15.34"
                3 -> res = "Неем 3.26-27; 11.21"
                7 -> res = "4 Цар 15.32"
                9 -> res = "4 Цар 15.38"
            }
        }
        if (glava == 28) {
            when (stih) {
                1 -> res = "4 Цар 16.2"
                2 -> res = "4 Цар 16.3"
                3 -> res = "Втор 18.9; 4 Цар 14.24; Ос 13.1"
                4 -> res = "Втор 12.2"
                5 -> res = "4 Цар 16.5"
                9 -> res = "2 Пар 15.1-2; 1 Езд 9.7"
                10 -> res = "Лев 25.42; Втор 15.9"
                13 -> res = "Чис 18.5; Нав 22.20"
                15 -> res = "Втор 15.13; 34.3"
                16 -> res = "4 Цар 16.7"
                18 -> res = "4 Цар 18.8"
                19 -> res = "Иер 15.4; Исх 32.25"
                21 -> res = "4 Цар 16.8; Иер 2.36"
                23 -> res = "4 Цар 16.10"
                24 -> res = "4 Цар 16.4"
                26 -> res = "4 Цар 16.1"
                27 -> res = "4 Цар 16.20; Ис 14.28"
            }
        }
        if (glava == 29) {
            when (stih) {
                1 -> res = "4 Цар 18.2"
                2 -> res = "4 Цар 18.3"
                3, 19 -> res = "2 Пар 28.24"
                5 -> res = "Неем 12.30"
                6 -> res = "3 Цар 8.48; Иер 2.27; Иез 20.16"
                7 -> res = "Чис 28.6"
                8 -> res = "Втор 28.25; 3 Цар 9.8; Иер 51.37"
                11 -> res = "Втор 10.8"
                12 -> res = "1 Пар 6.44"
                15 -> res = "Исх 19.10"
                17 -> res = "4 Цар 23.12"
                21 -> res = "Лев 4.13-14"
                22 -> res = "Лев 8.15"
                23 -> res = "Исх 29.10; Лев 1.4"
                25 -> res = "1 Пар 6.31; 23.5; 24.19"
                26 -> res = "Чис 10.10"
                28 -> res = "2 Пар 23.18"
                31 -> res = "Лев 7.12"
                34 -> res = "2 Пар 35.11"
                35 -> res = "Лев 3.3"
            }
        }
        if (glava == 30) {
            when (stih) {
                1 -> res = "Исх 12.11, 18; Лев 23.5; 4 Цар 23.21"
                2 -> res = "Исх 12.6; 13.4; Чис 9.11"
                5 -> res = "Исх 12.3"
                6 -> res = "Исх 3.6; 4.5; 4 Цар 15.19"
                7 -> res = "2 Пар 29.8; Исх 32.8; Иер 13.16; Лк 17.18"
                9 -> res = "Исх 34.6; Иер 3.12"
                12 -> res = "Деян 4.32; 11.21; Иер 32.39"
                13 -> res = "Ин 11.55"
                15 -> res = "Чис 9.11, 21"
                18 -> res = "Чис 9.6; Исх 12.3; Лев 22.4"
                25 -> res = "Исх 12.43, 48"
                27 -> res = "Чис 6.23, 27"
            }
        }
        if (glava == 31) {
            when (stih) {
                1 -> res = "4 Цар 18.4; Втор 7.5"
                2 -> res = "1 Пар 24.19"
                3 -> res = "Чис 28.2-3"
                4 -> res = "Чис 18.8; Неем 13.10"
                5 -> res = "Исх 23.19; 34.26; Лев 2.14"
                6 -> res = "Чис 31.28"
                14 -> res = "Лев 2.3; Чис 18.9"
                20 -> res = "4 Цар 18.3, 5"
                21 -> res = "4 Цар 18.6; 2 Пар 26.5"
            }
        }
        if (glava == 32) {
            when (stih) {
                1 -> res = "4 Цар 18.13; Сир 48.20; Ис 36.1"
                5 -> res = "2 Пар 25.23"
                7 -> res = "4 Цар 6.16; 1 Ин 4.4; Ис 31.3"
                9 -> res = "4 Цар 18.17; Мих 1.13"
                10 -> res = "4 Цар 18.19"
                11 -> res = "4 Цар 18.29"
                12 -> res = "4 Цар 18.22"
                13 -> res = "4 Цар 18.33-34; 19.12; Ис 10.9"
                14 -> res = "Втор 2.34; 4 Цар 18.35"
                17 -> res = "4 Цар 19.14; Ис 37.10, 14"
                18 -> res = "4 Цар 18.26, 28"
                19 -> res = "4 Цар 18.33; 19.12"
                20 -> res = "4 Цар 19.1, 14"
                21 -> res = "4 Цар 19.35; Ис 37.36"
                24 -> res = "4 Цар 20.1; Сир 48.26; Ис 38.1"
                25 -> res = "Лк 17.18; Ис 39.2"
                26 -> res = "4 Цар 20.17-18"
                30 -> res = "4 Цар 20.20"
                31 -> res = "Ис 39.1; 4 Цар 20.11; Втор 8.2; 13.3"
                32 -> res = "Ис 36.1; 4 Цар 18.1; 19.1"
                33 -> res = "4 Цар 20.21"
            }
        }
        if (glava == 33) {
            when (stih) {
                1 -> res = "4 Цар 21.1"
                2 -> res = "Втор 18.9"
                3 -> res = "4 Цар 21.3; Исх 34.13; Деян 7.42"
                4 -> res = "Втор 12.11; 3 Цар 8.29; Иер 32.34"
                5 -> res = "Втор 4.19"
                6 -> res = "Лев 18.21; 19.26; 20.2"
                7 -> res = "4 Цар 21.7; 3 Цар 9.3"
                8 -> res = "2 Цар 7.10; 3 Цар 8.16; 4 Цар 21.8"
                9 -> res = "4 Цар 21.9"
                13 -> res = "Дан 4.33"
                14 -> res = "Неем 3.3, 26; 2 Пар 27.3"
                18 -> res = "4 Цар 21.16-17"
                20 -> res = "4 Цар 21.18"
                25 -> res = "4 Цар 21.24"
            }
        }
        if (glava == 34) {
            when (stih) {
                1 -> res = "4 Цар 22.1"
                2 -> res = "4 Цар 22.2; Втор 5.32"
                4 -> res = "Лев 26.30"
                5 -> res = "4 Цар 23.8, 14, 16"
                8 -> res = "4 Цар 22.3"
                9 -> res = "4 Цар 22.4"
                12 -> res = "4 Цар 12.15"
                14 -> res = "4 Цар 22.8"
                16 -> res = "4 Цар 22.9"
                22 -> res = "Лев 26.14; Втор 28.15"
                24 -> res = "Лев 26.14, 16; Втор 28.15"
                26 -> res = "4 Цар 22.18"
                27 -> res = "Втор 20.3"
                28 -> res = "Иер 34.4; 4 Цар 22.20"
                30 -> res = "4 Цар 23.2"
                31 -> res = "4 Цар 23.3"
                33 -> res = "4 Цар 23.4"
            }
        }
        if (glava == 35) {
            when (stih) {
                1 -> res = "4 Цар 23.21; 2 Езд 1.1"
                3 -> res = "3 Цар 6.1"
                6 -> res = "Исх 12.3"
                7 -> res = "Чис 28.19"
                8 -> res = "Лев 7.16"
                13 -> res = "Исх 12.8; Втор 16.7"
                15 -> res = "1 Пар 25.1"
                17 -> res = "Исх 12.15"
                18 -> res = "4 Цар 23.22"
                19 -> res = "4 Цар 23.23"
                20 -> res = "4 Цар 23.24-25"
                22 -> res = "Зах 12.11"
                23 -> res = "4 Цар 23.29"
                24 -> res = "4 Цар 23.30"
                25 -> res = "Иер 22.10"
                26 -> res = "4 Цар 22.1"
            }
        }
        if (glava == 36) {
            when (stih) {
                1 -> res = "4 Цар 23.30"
                3 -> res = "4 Цар 23.33"
                4 -> res = "4 Цар 23.34; Мф 1.13"
                5 -> res = "4 Цар 23.36"
                6 -> res = "4 Цар 24.1"
                7 -> res = "Дан 1.2"
                8 -> res = "4 Цар 24.5, 8; Иер 22.24; 1 Пар 3.16"
                9 -> res = "4 Цар 24.8"
                10 -> res = "4 Цар 24.15"
                11 -> res = "Иер 1.3; 52.1"
                12 -> res = "Иер 37.2"
                14 -> res = "Втор 18.5"
                15 -> res = "Иер 25.4; Дан 9.10; Мф 21.36"
                16 -> res = "Иер 36.23; Зах 1.4; Иез 33.32"
                17 -> res = "4 Цар 25.1"
                18 -> res = "4 Цар 25.13; Иер 27.19, 22"
                19 -> res = "4 Цар 25.9"
                20 -> res = "4 Цар 25.11"
                21 -> res = "Иер 25.11"
                22 -> res = "2 Езд 2.1"
                23 -> res = "Ис 44.28; 45.1, 13; Дан 2.38"
            }
        }
        if (glava == 37) {
            when (stih) {
                1 -> res = "Исх 3.6, 15-16"
                2 -> res = "Иов 23.13"
                3 -> res = "Пс 129.3"
                4 -> res = "Пс 102.17; Еф 4.32"
                5 -> res = "Иез 18.23, 32"
                6 -> res = "Мф 9.12-13; Лк 15.7"
                7 -> res = "Лк 18.13"
                8 -> res = "2 Пар 33.11"
                9 -> res = "4 Цар 21.2; 2 Пар 33.2"
                10 -> res = "Еф 3.14; Притч 28.13; 1 Ин 1.9"
                11 -> res = "Пс 6.6; Ис 38.18"
            }
        }
        return res
    }

    fun kniga15(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "2 Пар 36.22; 2 Езд 2.1; Иер 25.12; 29.10; Дан 9.2"
                7 -> res = "Дан 1.2; 4 Цар 24.13; 25.14"
                8 -> res = "1 Езд 5.14"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Неем 7.6"
                2 -> res = "Неем 7.7"
                5 -> res = "Неем 7.10"
                6 -> res = "Неем 7.11"
                10 -> res = "Неем 7.15"
                23 -> res = "Иер 1.1"
                29 -> res = "1 Цар 21.1"
                36 -> res = "1 Пар 24.7"
                37 -> res = "1 Пар 24.14"
                38 -> res = "1 Пар 9.12"
                39 -> res = "1 Пар 24.8"
                40 -> res = "1 Езд 3.9; Неем 7.43"
                43 -> res = "Нав 9.27; 1 Пар 9.2; Неем 10.28"
                55 -> res = "3 Цар 9.21; Неем 11.3"
                59 -> res = "Неем 7.61"
                61 -> res = "Неем 7.63; 2 Цар 17.27"
                62 -> res = "Неем 7.64"
                63 -> res = "Неем 7.65; Лев 21.22; Исх 28.30"
                64 -> res = "Неем 7.66"
                65 -> res = "Неем 7.67"
                69 -> res = "Неем 7.72; 2 Кор 8.3; 1 Пет 4.11"
            }
        }
        if (glava == 3) {
            when (stih) {
                2 -> res = "2 Езд 5.47; 6.2; Сир 49.13-14; Лев 6.9"
                3 -> res = "Исх 27.21"
                4 -> res = "Исх 23.15-16; Лев 23.34"
                5 -> res = "Лев 7.16; Втор 12.6"
                9 -> res = "1 Езд 2.40; Неем 7.43"
                10 -> res = "1 Езд 5.2; 2 Пар 29.26"
                11 -> res = "1 Пар 16.34; 2 Пар 5.13; 7.3"
                12 -> res = "Агг 2.3-4"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "4 Цар 17.28; 2 Езд 5.49"
                3 -> res = "4 Цар 17.33, 41; 1 Кор 10.21"
                4 -> res = "Неем 6.9"
                6 -> res = "2 Езд 2.16"
                10 -> res = "4 Цар 17.24"
                13 -> res = "1 Езд 7.24"
                16 -> res = "Неем 4.2"
                20 -> res = "Нав 1.4; 2 Пар 18.1; Втор 11.24"
                21 -> res = "1 Езд 5.3"
                24 -> res = "2 Езд 6.6"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "2 Езд 6.1; Агг 1.1; Зах 1.1"
                2 -> res = "1 Пар 3.19; Мф 1.12"
                3 -> res = "2 Езд 6.4"
                5 -> res = "Зах 4.10"
                8 -> res = "Втор 10.17"
                11 -> res = "3 Цар 6.1-2"
                12 -> res = "2 Пар 36.16; 4 Цар 24.20"
                13 -> res = "2 Пар 36.22; 1 Езд 1.1"
                14 -> res = "1 Езд 1.7"
                16 -> res = "1 Езд 1.8"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "2 Езд 6.23"
                3 -> res = "2 Пар 36.22; 1 Езд 1.1"
                5 -> res = "1 Езд 1.7; 5.14"
                8 -> res = "1 Езд 7.20"
                10 -> res = "1 Тим 2.2"
                14 -> res = "2 Езд 7.4"
                16 -> res = "Чис 7.10; 3 Цар 8.10"
                17 -> res = "3 Цар 8.63"
                18 -> res = "Чис 3.6"
                19 -> res = "Исх 12.6, 18"
                20 -> res = "Неем 12.30; 2 Пар 29.24"
                22 -> res = "Исх 12.15; 1 Езд 7.27"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "2 Езд 8.1"
                3 -> res = "1 Пар 6.6"
                10 -> res = "Мф 5.19"
                15 -> res = "1 Езд 8.25"
                20 -> res = "1 Езд 6.8"
                25 -> res = "1 Езд 10.4-5"
                27 -> res = "1 Езд 6.22"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "2 Езд 8.28"
                15 -> res = "1 Езд 7.7"
                18 -> res = "1 Езд 7.6, 28; Исх 6.19"
                20 -> res = "Нав 9.21, 27; 1 Езд 2.43; Неем 10.28"
                21 -> res = "2 Пар 20.3"
                22 -> res = "1 Езд 8.31; Ис 22.17"
                23 -> res = "Пс 142.1"
                25 -> res = "1 Езд 7.15"
                35 -> res = "1 Езд 6.17"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "2 Езд 8.65"
                2 -> res = "Исх 34.16; Втор 7.3; Суд 3.6"
                4 -> res = "Ис 66.2; Исх 29.39"
                6 -> res = "Дан 9.7"
                9 -> res = "2 Езд 8.75, 77-78; Пс 79.13; Ис 5.2, 5"
                11 -> res = "Втор 7.1"
                12 -> res = "Исх 23.32; 34.16"
                15 -> res = "Дан 9.16"
            }
        }
        if (glava == 10) {
            when (stih) {
                2 -> res = "1 Езд 9.2; Неем 13.23"
                4 -> res = "2 Езд 8.91"
                5 -> res = "Неем 10.29"
                6 -> res = "2 Езд 9.1"
                8 -> res = "Неем 13.28"
                9 -> res = "1 Цар 12.17"
                10 -> res = "1 Езд 9.1-2"
                18 -> res = "Мал 2.7-8"
                19 -> res = "Лев 4.3"
                21 -> res = "1 Езд 2.39"
            }
        }
        return res
    }

    fun kniga16(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "1 Езд 2.2"
                3 -> res = "4 Цар 25.10; 2 Пар 36.19"
                5 -> res = "Неем 9.32; Дан 9.4"
                6 -> res = "3 Цар 8.29"
                7 -> res = "1 Езд 9.14"
                8 -> res = "Втор 28.64"
                9 -> res = "Втор 12.11; 30.4; 2 Мак 2.18"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Неем 1.1"
                3 -> res = "Дан 2.4; 3.9; 5.10"
                6 -> res = "Неем 5.14; 13.6"
                8 -> res = "3 Цар 5.6; 1 Езд 7.6, 9, 28; 8.22"
                10 -> res = "Неем 4.1"
                14 -> res = "Неем 3.15"
                19 -> res = "Неем 4.1; Иов 12.4"
                20 -> res = "Еф 2.12"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Неем 12.10; Втор 20.5; Иер 31.38"
                7 -> res = "Иер 31.40"
                13, 20 -> res = "2 Пар 26.9"
                16 -> res = "4 Цар 18.17; 20.20"
                25 -> res = "Иер 32.2"
                26 -> res = "2 Пар 27.3; 33.14; Неем 11.21"
                28 -> res = "4 Цар 11.16; Иер 31.40"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Неем 2.10; 13.28"
                3 -> res = "Неем 13.4"
                5 -> res = "Пс 5.11; Иер 18.23"
                14 -> res = "Чис 14.9; Исх 15.11"
                15 -> res = "Пс 32.10; Иов 5.12-13"
                20 -> res = "Исх 14.14; Втор 1.30; 3.22"
            }
        }
        if (glava == 5) {
            when (stih) {
                5 -> res = "Неем 9.37"
                7 -> res = "Исх 22.25; Лев 25.36-37"
                8 -> res = "Лев 25.47-48"
                9 -> res = "Рим 2.24; 2 Кор 6.3; 1 Тим 6.1"
                13 -> res = "Чис 5.22"
                14 -> res = "Неем 2.6; 12.26; Деян 20.33"
                15 -> res = "Притч 16.6"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Неем 13.21, 28"
                11 -> res = "Чис 18.7"
                16 -> res = "Исх 8.19"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Сир 49.15"
                5 -> res = "Неем 2.12"
                6 -> res = "1 Езд 2.1"
                10 -> res = "1 Езд 2.5"
                11 -> res = "1 Езд 2.6"
                15 -> res = "1 Езд 2.10"
                43 -> res = "1 Езд 3.9"
                46 -> res = "Неем 10.28"
                61 -> res = "1 Езд 2.59"
                63 -> res = "1 Езд 2.61"
                64 -> res = "1 Езд 2.62"
                65 -> res = "Исх 28.30; 1 Езд 2.63; 2 Езд 5.40"
                72 -> res = "1 Езд 2.69"
                73 -> res = "1 Езд 2.70"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Неем 9.1; 1 Езд 3.1; Втор 31.9"
                2 -> res = "Лев 23.34"
                3 -> res = "Неем 13.1"
                4 -> res = "Неем 9.4; Мф 23.2"
                6 -> res = "Чис 5.22"
                9 -> res = "1 Езд 2.63; Лев 23.24; Втор 16.11"
                10 -> res = "Есф 9.19; Притч 31.6"
                14 -> res = "Исх 23.16"
                18 -> res = "Втор 31.10-11; Лев 23.36"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Неем 8.1; 1 Езд 10.1"
                3 -> res = "Мф 20.1, 3, 5; Ин 11.9"
                4 -> res = "Неем 8.4"
                6 -> res = "Ис 44.6; Пс 32.6; Деян 4.24"
                7 -> res = "Быт 12.1; 17.5"
                8 -> res = "Быт 12.6-7; 15.18; 1 Езд 9.15"
                9 -> res = "Исх 2.24; 14.17"
                11 -> res = "Исх 14.21"
                12 -> res = "Исх 13.21"
                13 -> res = "Исх 19.18; Втор 4.12"
                14 -> res = "Исх 20.8"
                15 -> res = "Исх 16.4, 13; 17.6; Чис 20.10"
                16 -> res = "Ос 13.6"
                17 -> res = "Исх 32.8; 33.3, 5; Чис 14.4"
                18 -> res = "Исх 32.4"
                19 -> res = "Исх 13.21"
                20 -> res = "Чис 11.17; Нав 5.12; Исх 17.6"
                21 -> res = "Втор 29.5"
                22 -> res = "Чис 21.21, 25-26; 32.33"
                23 -> res = "Быт 15.5; 22.17"
                24 -> res = "Нав 6.1; 12.1-2"
                25 -> res = "Втор 6.11"
                26 -> res = "Втор 28.47"
                27 -> res = "Суд 2.14; 3.8; 4 Цар 13.5"
                28 -> res = "Суд 4.1"
                29 -> res = "Лев 18.5; Иез 20.11; Рим 10.5; Гал 3.12"
                30 -> res = "Ис 42.20"
                32 -> res = "Неем 1.5; Дан 9.4"
                33 -> res = "Исх 32.8"
                34 -> res = "Дан 9.8"
                35 -> res = "Втор 32.14; Ос 13.6"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Неем 9.38; 1 Езд 2.63"
                14 -> res = "1 Езд 2.3; Неем 7.8"
                28 -> res = "Нав 9.23; 1 Езд 2.43"
                29 -> res = "Втор 29.18; 4 Цар 23.3; 2 Пар 15.12"
                31 -> res = "Исх 20.10; Лев 23.3; 25.4"
                32 -> res = "Исх 30.13"
                33 -> res = "Исх 25.30; 29.40; Чис 29.2"
                34 -> res = "Лев 6.12"
                35 -> res = "Исх 23.19; 34.26; Лев 19.24"
                36 -> res = "Исх 13.2"
                37 -> res = "Лев 23.17; Чис 18.12; Втор 14.22"
                38 -> res = "Втор 14.23"
            }
        }
        if (glava == 11) {
            when (stih) {
                2 -> res = "Суд 5.2; 1 Пар 9.3"
                11 -> res = "1 Пар 9.11"
                12 -> res = "Неем 12.7"
                21 -> res = "Неем 3.26-27"
                25 -> res = "Нав 15.21; 20.7; 21.11"
                32 -> res = "1 Цар 21.1"
                33 -> res = "2 Цар 4.3"
                35 -> res = "Неем 6.2"
            }
        }
        if (glava == 12) {
            when (stih) {
                4, 17 -> res = "Лк 1.5"
                7 -> res = "Неем 11.12"
                9 -> res = "Неем 11.17"
                10 -> res = "Агг 1.1; Зах 3.1; Неем 13.4"
                11 -> res = "Неем 12.22"
                22 -> res = "Неем 12.11"
                24 -> res = "Неем 11.12; 1 Пар 25.1"
                25 -> res = "1 Пар 9.15; Неем 11.17"
                26 -> res = "Неем 2.6; 1 Езд 7.6"
                27 -> res = "Втор 20.5; 1 Езд 6.16; Ин 10.22"
                29 -> res = "Втор 11.30; Нав 5.9"
                30 -> res = "Исх 19.10"
                39 -> res = "Неем 3.1"
                44 -> res = "Втор 1.15"
                46 -> res = "1 Пар 25.1"
                47 -> res = "Чис 18.24, 26"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Втор 23.3"
                2 -> res = "Чис 22.5-6"
                4 -> res = "Неем 4.3; 12.10"
                9 -> res = "2 Пар 29.5; Лев 2.1"
                10 -> res = "2 Пар 31.4"
                12 -> res = "Неем 10.37"
                14 -> res = "Неем 5.19; Евр 6.10"
                15 -> res = "Иер 17.21; Неем 10.31; Ам 8.5"
                18 -> res = "Иер 17.21, 27"
                22 -> res = "Неем 5.19"
                23 -> res = "1 Езд 9.2; 10.2"
                25 -> res = "Втор 7.3-4; 1 Езд 9.2"
                26 -> res = "3 Цар 3.13; 11.3; 2 Пар 1.12; 2 Цар 12.24"
                28 -> res = "Неем 2.19; 1 Езд 10.8"
                29 -> res = "Неем 6.14"
                31 -> res = "Неем 5.19; 10.34; Ис 38.3"
            }
        }
        return res
    }

    fun kniga17(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "4 Цар 23.21; 2 Пар 35.1"
                25 -> res = "4 Цар 23.29; 2 Пар 35.20"
                34 -> res = "4 Цар 23.30; 2 Пар 36.1"
                46 -> res = "4 Цар 24.18; 2 Пар 36.11"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "2 Пар 36.22; 1 Езд 1.1"
                16 -> res = "1 Езд 4.6"
            }
        }
        if (glava == 4) {
            if (stih == 20) {
                res = "Быт 2.24"
            }
        }
        if (glava == 5) {
            when (stih) {
                8 -> res = "Неем 7.6-7"
                40 -> res = "Неем 7.65"
                47 -> res = "1 Езд 3.2"
                54 -> res = "1 Езд 3.8"
                64 -> res = "1 Езд 4.1"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Агг 1.1; 1 Езд 5.1"
                2 -> res = "1 Езд 3.2; Сир 49.13-14"
                23 -> res = "1 Езд 6.1"
                24 -> res = "1 Езд 6.3"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "1 Езд 6.13"
                4 -> res = "1 Езд 6.14"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "1 Езд 7.1"
                5 -> res = "1 Езд 7.7"
                28 -> res = "1 Езд 8.1"
                49 -> res = "1 Езд 8.21"
                66 -> res = "1 Езд 9.1"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "1 Езд 10.6"
                38 -> res = "Неем 8.1"
            }
        }
        return res
    }

    fun kniga18(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                2 -> res = "4 Цар 17.3"
                5 -> res = "3 Цар 12.30"
                6 -> res = "Исх 22.29"
                9 -> res = "Чис 36.6"
                11 -> res = "Дан 1.8"
                14 -> res = "Тов 4.20"
                17 -> res = "Ис 58.7"
                18 -> res = "Ис 37.37"
                21 -> res = "4 Цар 19.37; 2 Пар 32.21"
            }
        }
        if (glava == 2) {
            when (stih) {
                6 -> res = "Ам 8.10; 1 Мак 1.39"
                7 -> res = "Тов 12.12"
                8 -> res = "Тов 1.18"
                9 -> res = "Чис 19.16"
                13 -> res = "Втор 22.1"
                14 -> res = "Иов 2.9"
            }
        }
        if (glava == 3) {
            when (stih) {
                4 -> res = "Втор 28.15"
                11 -> res = "3 Цар 8.44; Дан 6.10"
                16 -> res = "Мф 18.10; Евр 1.14"
            }
        }
        if (glava == 4) {
            when (stih) {
                3 -> res = "Исх 20.12; Сир 7.29"
                5 -> res = "Еккл 12.1"
                7 -> res = "Притч 3.9; Сир 4.8; 14.13; Лк 14.13"
                8 -> res = "Сир 35.9"
                10 -> res = "Сир 29.15"
                14 -> res = "Лев 19.13; Втор 24.14"
                15 -> res = "Мф 7.12; Лк 6.31"
                16 -> res = "Лк 14.13"
                20 -> res = "Тов 1.14"
            }
        }
        if (glava == 6) {
            if (stih == 12) {
                res = "Чис 27.8; 36.7"
            }
        }
        if (glava == 7) {
            if (stih == 12) {
                res = "Чис 36.6"
            }
        }
        if (glava == 8) {
            if (stih == 6) {
                res = "Быт 2.18"
            }
        }
        if (glava == 12) {
            when (stih) {
                12 -> res = "Тов 2.7"
                19 -> res = "Быт 18.8; Суд 13.16"
            }
        }
        if (glava == 13) {
            when (stih) {
                2 -> res = "Втор 32.39; 1 Цар 2.6; Прем 16.13"
                11 -> res = "Ис 51.11; 60.4-5; Деян 2.47; Откр 21.24"
                16 -> res = "Откр 21.18-19"
                17 -> res = "Ис 54.11; Откр 21.11, 18"
            }
        }
        if (glava == 14) {
            when (stih) {
                4 -> res = "Ис 3.8; Наум 3.7; Соф 2.15"
                5 -> res = "1 Езд 6.15; Зах 8.8"
                6 -> res = "Соф 2.11; Зах 13.2"
                9 -> res = "Втор 6.13; Нав 24.14; 1 Цар 7.3"
            }
        }
        return res
    }

    fun kniga19(glava: Int, stih: Int): String {
        if (glava == 2) {
            if (stih == 1) {
                res = "Иудифь 1.12"
            }
        }
        if (glava == 5) {
            when (stih) {
                7 -> res = "Быт 11.31; Нав 24.2"
                13 -> res = "Исх 14.21"
            }
        }
        if (glava == 8) {
            if (stih == 14) {
                res = "Пс 63.7; Рим 11.34"
            }
        }
        if (glava == 9) {
            when (stih) {
                2 -> res = "Быт 34.25"
                3 -> res = "Исх 20.14"
            }
        }
        if (glava == 12) {
            if (stih == 2) {
                res = "Тов 1.11; Дан 1.8"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Исх 15.21"
                14 -> res = "Пс 103.30; 148.5"
            }
        }
        return res
    }

    fun kniga20(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "1 Езд 4.6"
                2 -> res = "Дан 8.2"
                7 -> res = "Иез 23.41"
                8 -> res = "Дан 5.3"
            }
        }
        if (glava == 2) {
            when (stih) {
                6 -> res = "4 Цар 24.15"
                18 -> res = "Есф 1.3"
                20 -> res = "Есф 4.8"
                23 -> res = "Есф 6.2"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "1 Цар 15.8, 32; Есф 5.11; 6.6"
                3 -> res = "Дан 3.12; 6.13"
                7 -> res = "Есф 9.24; Притч 14.32"
                8 -> res = "Чис 23.9"
                10 -> res = "Быт 41.42"
                13 -> res = "Есф 8.13; 9.1"
                15 -> res = "Есф 4.8; 8.15"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Чис 14.6; Нав 7.6"
                3 -> res = "Иона 3.6"
                7 -> res = "Есф 3.9"
                8 -> res = "Есф 2.7, 20; 3.15"
                11 -> res = "Есф 5.1-2; 8.4"
                16 -> res = "Есф 5.1"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Есф 4.16"
                2 -> res = "2 Цар 14.20"
                3 -> res = "Есф 7.2"
                9 -> res = "Притч 26.26; Сир 11.32"
                10 -> res = "Есф 6.13"
                11 -> res = "Есф 3.1"
                13 -> res = "Притч 14.31"
                14 -> res = "Есф 6.4; Сир 10.15-16"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Есф 2.23"
                4 -> res = "Притч 4.16; 5.22; Пс 7.17"
                12 -> res = "2 Пар 26.20"
                13 -> res = "Ин 18.6; Притч 16.18"
            }
        }
        if (glava == 7) {
            when (stih) {
                2 -> res = "Есф 5.3, 6"
                4 -> res = "Пс 100.5"
                7 -> res = "Притч 10.24; 16.14; 20.2"
                10 -> res = "Есф 6.4; Притч 26.27; Еккл 10.8"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "Есф 3.10"
                3, 9 -> res = "Есф 3.12"
                4 -> res = "Есф 4.11"
                16 -> res = "2 Цар 22.29; Иов 18.6"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Есф 3.13"
                4 -> res = "Есф 8.17"
                6 -> res = "Притч 11.8"
                10 -> res = "Исх 17.14"
                24 -> res = "Есф 3.7"
                25 -> res = "Есф 9.14"
                29 -> res = "Есф 2.15"
            }
        }
        return res
    }

    fun kniga21(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Иез 14.14, 20; Иак 5.11"
                5 -> res = "Исх 19.10; Чис 11.18"
                6 -> res = "Мф 18.10; 3 Цар 22.21; Откр 12.10"
                21 -> res = "Еккл 5.14; Прем 7.6; 1 Тим 6.7"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Иов 1.6"
                3 -> res = "Иов 1.1"
                5 -> res = "Иов 1.11"
                7 -> res = "Иов 7.5"
                9 -> res = "Тов 2.14"
                10 -> res = "Еккл 7.14; Иов 1.22"
                11 -> res = "Быт 25.3"
            }
        }
        if (glava == 3) {
            when (stih) {
                3 -> res = "Иер 20.14"
                8 -> res = "Иов 40.20"
                13 -> res = "Еккл 4.3"
                21 -> res = "Откр 9.6"
                25 -> res = "Притч 28.14"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Иов 15.1; 22.1"
                3 -> res = "Евр 12.12"
                4 -> res = "Ис 35.3"
                8 -> res = "Иов 15.35; Пс 7.15"
                9 -> res = "2 Цар 22.16; 2 Фес 2.8"
                10 -> res = "Пс 57.7; Наум 2.12"
                13 -> res = "Иов 33.15"
                14 -> res = "Дан 10.8"
                17 -> res = "Иов 9.2; 15.14; 25.4"
                18 -> res = "Иов 15.15; 2 Пет 2.4; Иуд 1.6"
                19 -> res = "Иов 25.6; 2 Кор 5.1"
                20 -> res = "Пс 36.2"
            }
        }
        if (glava == 5) {
            when (stih) {
                3 -> res = "Пс 36.35"
                7 -> res = "Иов 14.1"
                9 -> res = "Иов 9.10; Пс 71.18"
                10 -> res = "Иов 36.27; Пс 146.8"
                13 -> res = "1 Кор 3.19-20"
                14 -> res = "Втор 28.29"
                17 -> res = "Притч 3.11; Иак 1.12; Евр 12.5; Откр 3.19"
                18 -> res = "Втор 32.39"
                19 -> res = "Пс 90.10; Ис 43.2"
                20 -> res = "Пс 32.19"
                21 -> res = "Пс 54.22; Притч 26.22"
                23 -> res = "Пс 90.12; Ис 11.6"
            }
        }
        if (glava == 6) {
            when (stih) {
                3 -> res = "Притч 27.3"
                4 -> res = "Втор 32.23; Пс 37.3"
                9 -> res = "Иов 7.16; 13.21"
                12 -> res = "1 Кор 10.13"
                15 -> res = "Иов 19.13; Пс 87.19"
                26 -> res = "Иов 16.6"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Иов 14.6"
                4 -> res = "Втор 28.67"
                5 -> res = "Иов 2.7"
                6 -> res = "Иов 8.9; Пс 89.6; Ис 38.12"
                8 -> res = "Пс 38.14"
                9 -> res = "Прем 2.1"
                17 -> res = "Пс 8.5"
                20 -> res = "Иов 9.29"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Иов 18.1; 25.1"
                3 -> res = "Втор 32.4; 2 Пар 19.7; Дан 9.14"
                5 -> res = "Иов 22.23"
                7 -> res = "Иов 42.10"
                8 -> res = "Втор 4.32"
                9 -> res = "Иов 14.2; Пс 143.4"
                12 -> res = "Пс 128.6; Иер 17.6"
                13 -> res = "Пс 111.10; Притч 10.28"
                20 -> res = "Пс 36.18"
            }
        }
        if (glava == 9) {
            when (stih) {
                2 -> res = "Иов 4.17"
                4 -> res = "Иов 37.23"
                5 -> res = "Иер 51.25; Мф 17.20"
                7 -> res = "Нав 10.13; 4 Цар 20.11"
                8 -> res = "Иер 51.15"
                10 -> res = "Иов 5.9"
                12 -> res = "Ис 10.15; 14.27"
                13 -> res = "Наум 1.6"
                15 -> res = "Иов 10.7"
                21, 35 -> res = "1 Кор 4.4"
                22 -> res = "Иов 34.9"
                25 -> res = "Иов 7.7; Пс 89.10"
                26 -> res = "Прем 5.10"
                29 -> res = "Иов 7.20"
                30 -> res = "Иер 2.22"
                32 -> res = "Еккл 6.10; Иер 49.19"
                34 -> res = "Пс 88.33"
            }
        }
        if (glava == 10) {
            when (stih) {
                2 -> res = "Иов 34.10"
                4 -> res = "1 Цар 16.7"
                5 -> res = "Пс 101.28"
                7 -> res = "Иов 9.15; Тов 13.2"
                8 -> res = "Пс 118.73"
                9 -> res = "Быт 2.7; 3.19"
                11 -> res = "2 Мак 7.11"
                14 -> res = "Пс 89.8"
                15 -> res = "Иов 35.2"
                17 -> res = "Иов 19.12"
                18 -> res = "Иов 3.11; Иер 20.14"
                20 -> res = "Пс 38.14"
                21 -> res = "Иов 16.22"
                22 -> res = "Ис 5.14"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Иов 2.11; 20.1"
                2 -> res = "Притч 10.14"
                6 -> res = "Пс 50.8"
                7 -> res = "Рим 11.33; 1 Кор 2.11"
                8 -> res = "Пс 138.8; Иер 23.24"
                11 -> res = "Пс 93.9"
                14 -> res = "Ис 1.16-18"
                15 -> res = "1 Ин 3.21"
                16 -> res = "Иер 12.11"
                17 -> res = "Пс 36.6; Ис 58.8"
                19 -> res = "Лев 26.5"
                20 -> res = "Иов 8.13; 14.19"
            }
        }
        if (glava == 12) {
            when (stih) {
                4 -> res = "Иов 17.6; Прем 5.3"
                6 -> res = "Иов 21.7; Пс 72.3; Иер 12.1"
                9 -> res = "Притч 16.4; Ам 3.6"
                10 -> res = "Деян 17.28"
                11 -> res = "Иов 34.3"
                12 -> res = "Иов 15.10"
                13 -> res = "Прем 7.25"
                14 -> res = "Ис 22.22; Откр 3.7"
                15 -> res = "Быт 7.11"
                17 -> res = "Ис 29.14"
                20 -> res = "2 Фес 2.11"
                21 -> res = "Ис 28.15"
                24 -> res = "Пс 75.13"
                25 -> res = "Ис 29.9; 59.10"
            }
        }
        if (glava == 13) {
            when (stih) {
                2 -> res = "Иов 12.3; 15.9"
                4 -> res = "Иов 16.2"
                5 -> res = "Притч 17.28"
                10 -> res = "Втор 10.17"
                16 -> res = "Мф 7.23"
                21 -> res = "Иов 6.9"
                22 -> res = "Иов 38.3"
                24 -> res = "Пс 43.25; Иов 19.11; 33.10"
                26 -> res = "Пс 24.7"
                28 -> res = "Иов 4.19; Ис 51.8"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Сир 18.8"
                2 -> res = "Иов 8.9; Пс 143.4"
                4 -> res = "Пс 50.7; Ис 64.6"
                6 -> res = "Иов 7.1-2"
                12 -> res = "Иов 19.25; Дан 12.2"
                15 -> res = "Иов 10.8"
                16 -> res = "Иов 31.4; Пс 138.2"
                17 -> res = "Ос 13.12; Иез 18.22"
                21 -> res = "Еккл 2.19"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Иов 4.1; 22.1"
                6 -> res = "Мф 12.37"
                7 -> res = "Притч 8.25"
                8 -> res = "Ис 40.13; Иер 23.18"
                9 -> res = "Иов 13.2"
                14 -> res = "Быт 6.5; 3 Цар 8.46; 2 Пар 6.36"
                15 -> res = "Иов 4.18"
                16 -> res = "Кол 2.13"
                20 -> res = "Притч 28.1; Ис 48.22"
                21 -> res = "Лев 26.36"
                23 -> res = "Иов 18.11; Пс 108.10"
                25 -> res = "Лев 26.21"
                27 -> res = "Втор 32.15-16; Пс 16.10; 118.70"
                30 -> res = "Иов 4.9; 2 Фес 2.8"
                32 -> res = "Иов 22.16; Пс 54.24; 72.19; Еккл 7.17"
                34 -> res = "Ис 9.19"
                35 -> res = "Пс 7.15; Ис 59.4"
            }
        }
        if (glava == 16) {
            when (stih) {
                2 -> res = "Иов 21.34"
                7 -> res = "Иов 10.17"
                12 -> res = "Пс 101.14; Втор 32.23"
                16 -> res = "Иов 17.7; Пс 6.7-8"
                17 -> res = "1 Тим 2.8"
                22 -> res = "Нав 23.14; Иов 7.21; 10.21"
            }
        }
        if (glava == 17) {
            when (stih) {
                4 -> res = "Мф 11.25"
                5 -> res = "Иов 11.20"
                6 -> res = "Иов 12.4; 30.9; Иез 33.32"
                7 -> res = "Пс 6.8"
                14 -> res = "Сир 10.13"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "Иов 8.1; 25.1"
                5 -> res = "Иов 21.17"
                6 -> res = "Иов 29.3; Притч 13.9"
                7 -> res = "Есф 7.9"
                9 -> res = "Иов 5.5"
                11 -> res = "Иов 27.20"
                14 -> res = "Иов 11.20"
                15 -> res = "Быт 19.24"
                16 -> res = "Ам 2.9"
                17 -> res = "Притч 2.22"
                19 -> res = "Пс 36.28; Прем 3.16"
                20 -> res = "Пс 36.13"
                21 -> res = "Иов 20.29"
            }
        }
        if (glava == 19) {
            when (stih) {
                4 -> res = "Рим 14.12-13; Гал 6.5"
                6 -> res = "Ос 7.12"
                7 -> res = "Пс 68.4; Иер 20.8"
                8 -> res = "Плач 3.7, 9"
                11 -> res = "Иов 33.10"
                12 -> res = "Иов 25.3"
                13 -> res = "Пс 30.12"
                17 -> res = "Иов 2.9"
                25 -> res = "Гал 3.14; Откр 5.9; Иез 37.3; 2 Мак 7.11; Ин 11.25"
                27 -> res = "Ин 8.56; Авв 2.4"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "Иов 11.1"
                5 -> res = "Евр 11.25"
                7 -> res = "1 Фес 5.3; Пс 36.36"
                8 -> res = "Пс 72.19; Ис 29.7"
                9 -> res = "Пс 36.10; 102.16"
                10 -> res = "Иов 21.19; 27.14"
                12 -> res = "Пс 54.22"
                18 -> res = "Иер 12.13"
                19 -> res = "Ис 5.8"
                20 -> res = "Притч 10.2; 11.4; Сир 5.10; Иез 7.19"
                23 -> res = "Чис 11.33"
                24 -> res = "Ис 24.18; Иер 48.44"
                25 -> res = "Пс 7.13; Иез 21.10"
                26 -> res = "Втор 32.22; Иер 15.14; 17.4"
                29 -> res = "Иов 18.21; 27.13"
            }
        }
        if (glava == 21) {
            when (stih) {
                5 -> res = "Мих 7.16"
                7 -> res = "Иер 12.1; Авв 1.13"
                9 -> res = "Пс 72.4; 143.12"
                12 -> res = "Ис 5.12; Ам 6.5-6"
                14 -> res = "Иов 22.17; Иер 2.20"
                15 -> res = "Мал 3.14"
                16 -> res = "Иов 22.18"
                17 -> res = "Иов 18.5-6; 29.3; 38.15"
                18 -> res = "Пс 1.4; Ис 29.5; Ос 13.3"
                21 -> res = "Пс 54.24; 57.10"
                26 -> res = "Иов 17.14"
                30 -> res = "Пс 72.18-19; Притч 16.4"
                34 -> res = "Иов 16.2"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "Иов 4.1; 15.1"
                3 -> res = "Иов 35.7"
                6 -> res = "Иез 18.7; Ис 58.7"
                7 -> res = "Мф 25.42"
                10 -> res = "2 Цар 22.6"
                11 -> res = "2 Цар 22.17"
                13 -> res = "Иов 24.15; Пс 93.7; Ис 29.15"
                15 -> res = "1 Пет 4.2"
                16 -> res = "Иов 15.32"
                18 -> res = "Иов 21.16"
                19 -> res = "Пс 106.42"
                20 -> res = "Иез 28.18"
                23 -> res = "Иов 8.5-6"
                27 -> res = "Пс 49.15; Ис 58.9; 65.24"
                29 -> res = "Притч 29.23; Лк 18.14"
                30 -> res = "Пс 17.21"
            }
        }
        if (glava == 23) {
            when (stih) {
                10 -> res = "Иов 31.4; 33.9"
                11 -> res = "Пс 118.51"
            }
        }
        if (glava == 24) {
            when (stih) {
                2 -> res = "Втор 19.14; Притч 22.28"
                6 -> res = "3 Цар 21.15"
                7 -> res = "Иов 22.6"
                10 -> res = "Ис 58.7"
                12 -> res = "Иов 35.9"
                15 -> res = "Иов 22.13-14; Притч 7.9"
                18 -> res = "Быт 49.4"
                24 -> res = "Пс 36.2; 72.18"
            }
        }
        if (glava == 25) {
            when (stih) {
                1 -> res = "Иов 8.1; 18.1"
                3 -> res = "Пс 102.20"
                4 -> res = "Иов 4.17; 9.2; 15.14"
                5 -> res = "Иов 15.15"
                6 -> res = "Пс 21.7"
            }
        }
        if (glava == 26) {
            when (stih) {
                5 -> res = "Ис 14.9"
                6 -> res = "Притч 15.11; Евр 4.13"
                7 -> res = "Иов 38.6; Евр 1.3"
                8 -> res = "Иов 38.37; Притч 8.28"
                10 -> res = "Иов 38.8; Притч 8.29; Иер 5.22"
                11 -> res = "2 Цар 22.8"
                12 -> res = "Пс 88.10; Ис 51.10; Лк 8.25"
            }
        }
        if (glava == 27) {
            when (stih) {
                4 -> res = "Пс 14.2"
                6 -> res = "1 Кор 4.4"
                7 -> res = "Иов 42.7"
                8 -> res = "Иак 4.3"
                9 -> res = "Пс 17.42; Притч 1.28; 28.9"
                10 -> res = "Притч 15.8"
                12 -> res = "Пс 4.3"
                13 -> res = "Иов 20.29"
                14 -> res = "Втор 28.41; Иов 20.10"
                15 -> res = "Пс 77.63"
                17 -> res = "Пс 48.11"
                19 -> res = "Пс 48.18"
                20 -> res = "Иов 15.20-21; 18.11"
                21 -> res = "Иез 17.10"
                23 -> res = "Иез 25.6; Наум 3.19; Соф 2.15"
            }
        }
        if (glava == 28) {
            when (stih) {
                15 -> res = "Пс 18.11; 118.72"
                16 -> res = "Притч 8.11; Прем 7.9"
                23 -> res = "Вар 3.32"
                26 -> res = "Иов 38.25"
                28 -> res = "Притч 1.7"
            }
        }
        if (glava == 29) {
            when (stih) {
                3 -> res = "Иов 18.6"
                12 -> res = "Пс 71.12"
                14 -> res = "Пс 131.9"
                15 -> res = "Лев 19.14"
                16 -> res = "Иов 31.18; Притч 29.7; Сир 4.10"
                17 -> res = "Притч 30.14"
                19 -> res = "Втор 28.4"
                20 -> res = "Быт 49.24"
            }
        }
        if (glava == 30) {
            when (stih) {
                9 -> res = "Иов 17.6"
                10 -> res = "Иов 19.19; Чис 12.14"
                14 -> res = "Иов 6.4"
                16 -> res = "Пс 21.15; 41.5; Плач 2.19"
                19 -> res = "Быт 18.27; Иов 16.15; Сир 10.9"
                20 -> res = "Иов 19.7"
                23 -> res = "Евр 9.27"
                24 -> res = "Иов 3.17"
                25 -> res = "Рим 12.15"
                26 -> res = "Иер 14.19"
                29 -> res = "Пс 101.7-8; Ис 38.14; Мих 1.8"
                30 -> res = "Пс 118.83"
                31 -> res = "Ам 8.10; Вар 4.34"
            }
        }
        if (glava == 31) {
            when (stih) {
                1 -> res = "Быт 34.1-2; Сир 9.5; Мф 5.28"
                4 -> res = "Иов 23.10; 34.21; Пс 138.3"
                7 -> res = "Пс 7.4"
                8 -> res = "Лев 26.16; Втор 28.30, 38"
                9 -> res = "Иов 24.15"
                10 -> res = "Втор 28.30"
                11 -> res = "Быт 38.24; Лев 20.10"
                12 -> res = "Ис 47.14"
                13 -> res = "Еф 6.9; Кол 4.1"
                16 -> res = "1 Ин 3.17; Иак 2.15-16"
                17 -> res = "Лк 14.13"
                18 -> res = "Иов 29.16; Сир 4.10"
                19 -> res = "Ис 58.7"
                20 -> res = "Втор 24.13"
                21 -> res = "Ис 58.4"
                22 -> res = "Зах 11.17"
                23 -> res = "Быт 50.19"
                24 -> res = "Пс 61.11; Мк 10.24"
                26 -> res = "Втор 4.19; Иез 8.16"
                27 -> res = "3 Цар 19.18"
                28 -> res = "Тит 1.16"
                29 -> res = "Притч 24.17"
                32 -> res = "Быт 19.2; Рим 12.13; Евр 13.2"
                33 -> res = "Быт 3.8; Ос 6.7"
                39 -> res = "Иак 5.11"
            }
        }
        if (glava == 32) {
            when (stih) {
                1 -> res = "Иов 2.11"
                2 -> res = "Иов 35.2"
                6 -> res = "Иов 15.10"
                7 -> res = "Иов 12.12"
                8 -> res = "Ис 11.2; Притч 2.6"
                9 -> res = "Дан 2.21; Пс 118.100"
                18 -> res = "Иер 20.9; Мих 3.8"
                21 -> res = "Иер 17.16"
            }
        }
        if (glava == 33) {
            when (stih) {
                4 -> res = "Быт 1.2; Пс 32.6; 103.30"
                6 -> res = "Иов 10.9; Еккл 12.7"
                9 -> res = "Иов 10.7; 16.17; 23.10"
                10 -> res = "Иов 13.24; 19.11"
                11 -> res = "Иов 13.27"
                12 -> res = "Иов 34.7"
                14 -> res = "Чис 23.19; 1 Цар 15.29"
                15 -> res = "Иов 4.13"
                16 -> res = "2 Цар 7.27; Ис 50.4"
                20 -> res = "Пс 106.18"
                23 -> res = "Быт 48.16; Зах 3.1; 1 Тим 2.5"
                24 -> res = "Пс 90.15; Ис 43.1-2; Ос 13.14"
                26 -> res = "Пс 49.15; Ис 58.9"
                28 -> res = "1 Кор 11.32"
                30 -> res = "Пс 55.14; 102.4"
            }
        }
        if (glava == 34) {
            when (stih) {
                3 -> res = "Иов 12.11"
                5 -> res = "Иов 13.18; 23.10; 35.2"
                6 -> res = "Иов 6.4"
                7 -> res = "Иов 15.16"
                9 -> res = "Иов 9.22; Мал 3.14"
                10 -> res = "Иов 8.3; 36.23"
                11 -> res = "Притч 24.12; Рим 2.6"
                13 -> res = "Иов 38.4"
                14 -> res = "Пс 103.29"
                15 -> res = "Быт 3.19"
                19 -> res = "Втор 10.17; 2 Пар 19.7; Прем 6.7; Сир 35.12; Деян 10.34; 1 Пет 1.17; Рим 2.11; Гал 2.6; Еф 6.9"
                24 -> res = "Притч 5.21"
                25 -> res = "Иов 27.20"
                27 -> res = "Пс 27.5"
                28 -> res = "Пс 9.13"
                29 -> res = "Ин 14.27; Рим 8.34"
                30 -> res = "Ос 13.11"
            }
        }
        if (glava == 35) {
            when (stih) {
                2 -> res = "Иов 32.2; 34.5"
                6 -> res = "Иер 7.19"
                7 -> res = "Иов 22.3"
                9 -> res = "Иов 24.12"
                10 -> res = "Пс 41.9"
                11 -> res = "2 Пет 2.12"
                12 -> res = "Иов 27.9; Притч 15.29"
                13 -> res = "Ис 1.15; Ин 9.31"
                14 -> res = "Иов 23.9; Еккл 3.17; 12.14"
            }
        }
        if (glava == 36) {
            when (stih) {
                3 -> res = "Пс 50.6"
                4 -> res = "2 Кор 2.172 Кор 2.17"
                7 -> res = "Пс 32.18; 112.7"
                8 -> res = "Пс 106.10"
                10 -> res = "Иов 33.16"
                11 -> res = "2 Пар 33.13"
                12 -> res = "Лк 19.42"
                13 -> res = "Мф 23.27"
                15 -> res = "Пс 34.10; Ис 66.2"
                16 -> res = "2 Пар 18.31; Пс 17.20"
                18 -> res = "1 Цар 12.3; Притч 11.4"
                21 -> res = "Евр 6.11"
                22 -> res = "1 Цар 3.18"
                26 -> res = "1 Тим 6.16; Пс 101.28; Дан 6.26"
                29 -> res = "Пс 103.2; Притч 8.28"
            }
        }
        if (glava == 37) {
            when (stih) {
                3 -> res = "Пс 17.15"
                5 -> res = "Пс 28.3; 76.19; Иов 5.9"
                6 -> res = "Пс 32.9; 147.5"
                8 -> res = "Пс 103.22"
                14 -> res = "Пс 110.2"
                18 -> res = "Ис 44.24"
                23 -> res = "Иов 9.4; 12.13, 16; Пс 144.3"
            }
        }
        if (glava == 38) {
            when (stih) {
                1 -> res = "Исх 19.18; 3 Цар 19.11; Иез 1.4"
                3 -> res = "Иов 40.2"
                4 -> res = "Быт 1.1"
                5 -> res = "Притч 30.4"
                6 -> res = "Иов 26.7"
                7 -> res = "Дан 7.10"
                8 -> res = "Иов 26.10"
                10 -> res = "Притч 8.29; Пс 103.9"
                15 -> res = "Иов 18.5-6; Иез 30.22"
                16 -> res = "Пс 76.20"
                17 -> res = "Иов 10.21; Ис 14.9"
                21 -> res = "Пс 38.5"
                23 -> res = "Исх 9.14-15; Нав 10.11"
                25 -> res = "Пс 134.7; Иер 10.13"
                27 -> res = "Пс 106.35"
                28 -> res = "Иов 5.10; 36.27; Иер 14.22"
                31 -> res = "Иов 9.9; Ис 13.10"
                33 -> res = "Иер 31.35"
                36 -> res = "Иов 32.8"
                37 -> res = "Иов 26.8"
                39 -> res = "Пс 103.21"
                41 -> res = "Пс 146.9"
            }
        }
        if (glava == 39) {
            when (stih) {
                6 -> res = "Пс 106.34"
                24 -> res = "Притч 21.31"
            }
        }
        if (glava == 40) {
            if (stih == 2) {
                res = "Иов 38.3"
            }
        }
        if (glava == 41) {
            when (stih) {
                1 -> res = "Иер 50.44"
                2 -> res = "Исх 19.5; Втор 10.14; Пс 23.1"
            }
        }
        if (glava == 42) {
            when (stih) {
                2 -> res = "Быт 18.14; Мф 19.26"
                3 -> res = "Иов 38.2; Пс 39.6"
                5 -> res = "Ис 55.3; Лк 5.8"
                7 -> res = "Иов 2.11; 27.7"
                8 -> res = "Быт 20.7; Иак 5.16"
                10 -> res = "Втор 30.3; Евр 11.34; Мк 10.30"
                12 -> res = "Иов 1.3"
                16 -> res = "Притч 3.16"
            }
        }
        return res
    }

    fun kniga22(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Пс 25.4; Иер 15.17; Притч 10.30"
                2 -> res = "Нав 1.8"
                3 -> res = "Пс 91.13; Иер 17.8"
                4 -> res = "Иов 21.18; Ис 29.5"
                5 -> res = "Мф 25.32"
                6 -> res = "Наум 1.7; Ин 10.14; 2 Тим 2.19"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Деян 4.25"
                4 -> res = "Втор 28.63; Притч 1.26"
                6 -> res = "Пс 92.1; Ин 18.37; Евр 12.22"
                7 -> res = "Деян 13.33; Евр 1.5; 5.5"
                8 -> res = "Пс 21.28"
                9 -> res = "Откр 2.27; 19.15"
                10 -> res = "Прем 6.2"
                12 -> res = "Пс 33.9; Притч 16.20; Ис 30.18; 1 Пет 2.6"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "2 Цар 15.14"
                4 -> res = "Пс 27.7"
                7 -> res = "Лк 12.4"
                9 -> res = "Ис 43.11; Ос 13.4"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "Пс 3.2"
                3 -> res = "Иов 27.12"
                5 -> res = "Еф 4.26"
                6 -> res = "Пс 50.19; 61.9"
                7 -> res = "Пс 30.17; Мф 6.10"
                9 -> res = "Иов 11.19"
            }
        }
        if (glava == 5) {
            when (stih) {
                2 -> res = "Пс 4.2; 16.1"
                3 -> res = "Пс 83.4"
                5 -> res = "Втор 32.4; Притч 3.32; Ин 9.31"
                6 -> res = "Гал 5.21"
                7 -> res = "Пс 54.24; Ис 1.15"
                10 -> res = "Рим 3.13"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Пс 37.2; Иер 10.24"
                6 -> res = "Пс 29.10"
                8 -> res = "Иов 17.7"
                9 -> res = "Пс 118.115; Мф 7.23"
                11 -> res = "Пс 34.4"
            }
        }
        if (glava == 7) {
            when (stih) {
                4 -> res = "Иов 31.7"
                5 -> res = "1 Цар 24.7; 26.9"
                9 -> res = "Быт 18.25; Пс 25.1"
                10 -> res = "1 Цар 16.7; 1 Пар 28.9; Иер 11.20; 17.10; 20.12; Откр 2.23"
                13 -> res = "Плач 2.4; 3.12"
                15 -> res = "Иов 15.35; Ис 59.4"
                16 -> res = "Пс 9.16; 56.7; Притч 5.22"
                17 -> res = "Неем 4.5; Пс 139.10"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "Пс 109.1"
                3 -> res = "Мф 21.16"
                5 -> res = "Иов 7.17; Пс 143.3; Евр 2.6"
                7 -> res = "Быт 1.28; 9.2; 1 Кор 15.27"
            }
        }
        if (glava == 9) {
            when (stih) {
                3 -> res = "Пс 30.8"
                6 -> res = "2 Цар 22.15; Пс 33.17; Притч 10.7"
                9 -> res = "Пс 95.13; Деян 17.31"
                10 -> res = "Пс 31.7"
                13 -> res = "Быт 4.9; Втор 32.43"
                16 -> res = "Пс 7.16"
                19 -> res = "Пс 33.7"
                21 -> res = "Ис 31.3"
                28 -> res = "Рим 3.14"
                29 -> res = "Деян 23.15"
                30 -> res = "Пс 16.12"
                31 -> res = "Ис 3.15"
                32 -> res = "Иов 22.13"
                33 -> res = "Мк 4.38"
                35 -> res = "Пс 67.6-7"
                36 -> res = "Иез 30.24"
                37 -> res = "Иер 10.10; Дан 6.26"
                1 -> {
                }
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Пс 54.23; 1 Цар 24.2; 26.20"
                4 -> res = "Ис 66.1; Авв 2.20; Мф 5.34"
                6 -> res = "Быт 19.24; Иер 23.19"
            }
        }
        if (glava == 11) {
            when (stih) {
                2 -> res = "Ис 57.1; Мих 7.2"
                3 -> res = "Пс 27.3"
                4 -> res = "Гал 5.12"
                5 -> res = "Исх 5.2; Иов 21.15; Дан 3.15"
                7 -> res = "2 Цар 22.31; Притч 30.5"
            }
        }
        if (glava == 12) {
            when (stih) {
                2 -> res = "Пс 76.8; Авв 1.2"
                4 -> res = "1 Езд 9.8; Иер 51.39"
                6 -> res = "Ис 66.14; Пс 102.2"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Пс 9.27; 52.2"
                2 -> res = "Пс 32.13; Зах 9.1"
                3 -> res = "Рим 3.10"
                6 -> res = "Еккл 9.16"
                7 -> res = "Пс 52.7; Ис 59.20"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Пс 23.3; 83.5"
                2 -> res = "Ис 33.15"
                3 -> res = "Иов 27.4; Еф 4.25"
                4 -> res = "4 Цар 3.14"
                5 -> res = "Исх 22.25; Втор 23.19"
            }
        }
        if (glava == 15) {
            when (stih) {
                3 -> res = "Ин 11.5"
                4 -> res = "Ис 1.11"
                5 -> res = "Плач 3.24"
                8 -> res = "Деян 2.25"
                10 -> res = "Деян 13.35"
                11 -> res = "Деян 2.28"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Пс 4.2"
                3 -> res = "Пс 7.10; 65.10; Иер 11.20"
                5 -> res = "1 Цар 2.9"
                8 -> res = "Втор 32.10; Зах 2.8; Руфь 2.12"
                10 -> res = "Иов 15.27"
                15 -> res = "Мф 5.8; 1 Ин 3.20; 1 Кор 13.10"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "2 Цар 22.1-2"
                3 -> res = "Евр 2.13"
                6 -> res = "Иов 22.10"
                7 -> res = "Пс 33.6; Ис 26.16; Иона 2.3, 8"
                8 -> res = "2 Цар 22.8; Иер 10.10"
                9 -> res = "Втор 4.24; Иез 10.2; Евр 12.29"
                12 -> res = "Ис 50.3"
                14 -> res = "1 Цар 2.10; 7.10; Иер 51.16"
                17 -> res = "Пс 65.12; 68.2"
                20, 37 -> res = "Пс 30.9"
                21 -> res = "Иов 22.30"
                28 -> res = "1 Цар 2.8; Пс 112.7"
                29 -> res = "Ис 42.16"
                30 -> res = "Пс 59.14"
                31 -> res = "Пс 11.7; 18.8; Притч 30.5"
                32 -> res = "2 Цар 22.32; Ис 43.11; 44.6"
                34 -> res = "Авв 3.19"
                35 -> res = "Пс 143.1"
                41 -> res = "Быт 49.8"
                42 -> res = "Иов 27.9"
                43 -> res = "4 Цар 13.7; Пс 82.11; Ис 10.6"
                44 -> res = "Рим 15.9"
                47 -> res = "Втор 32.40"
                48 -> res = "1 Пар 17.10"
                50 -> res = "Рим 15.9"
            }
        }
        if (glava == 18) {
            when (stih) {
                2 -> res = "Пс 96.6; Деян 14.17; Рим 1.20"
                5 -> res = "Рим 10.18"
                7 -> res = "Еккл 1.5"
                8 -> res = "Пс 11.7"
                9 -> res = "2 Пет 1.19; Еф 1.18"
                11 -> res = "Пс 118.72"
                15 -> res = "Пс 39.14"
            }
        }
        if (glava == 19) {
            when (stih) {
                2 -> res = "Пс 17.7"
                5 -> res = "Пс 20.3; Ис 41.16"
                6 -> res = "2 Цар 8.6"
                8 -> res = "4 Цар 19.23"
            }
        }
        if (glava == 20) {
            when (stih) {
                3 -> res = "Пс 144.19"
                4 -> res = "Евр 2.9"
                5 -> res = "Ис 53.9-10"
                7 -> res = "Ис 19.24"
                9 -> res = "Мф 24.51"
                11 -> res = "Пс 33.17; Ис 14.22"
            }
        }
        if (glava == 21) {
            when (stih) {
                2 -> res = "Мф 27.46; Мк 15.34"
                5 -> res = "Пс 106.6"
                6 -> res = "Пс 24.2"
                8 -> res = "Мф 27.39"
                9 -> res = "Мф 27.43; Прем 2.18"
                10 -> res = "Пс 70.6"
                13 -> res = "Ам 4.1; Мф 27.20"
                16 -> res = "Ин 19.28"
                17 -> res = "Мф 27.27"
                18 -> res = "Лк 23.35"
                19 -> res = "Мф 27.35; Мк 15.24; Лк 23.34; Ин 19.24"
                23 -> res = "Ин 20.17; Евр 2.12"
                25 -> res = "Евр 5.7"
                26 -> res = "Пс 34.18"
                27 -> res = "Песн 5.1; Ис 65.13; Лк 1.53"
                28 -> res = "Пс 2.8; Ис 60.14"
                29 -> res = "Дан 7.27; Мф 6.10"
                30 -> res = "Ис 25.6; 49.23"
                31 -> res = "Ис 53.10"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "Ис 40.11; Иер 23.4; Иез 34.23; Ин 10.11-12; 1 Пет 2.25"
                4 -> res = "Пс 117.6; Рим 8.31 "
                5 -> res = "Притч 9.2; Пс 111.10; Ис 25.6"
                6 -> res = "Пс 26.4"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "Исх 19.5; Пс 49.12; 1 Кор 10.26"
                2 -> res = "Иов 38.6"
                3 -> res = "Пс 14.1; Ис 33.15"
                4 -> res = "Мф 5.8"
                5 -> res = "Ис 48.18; Ос 10.12"
                6 -> res = "1 Пет 2.9; Ис 51.2"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "Пс 85.4"
                3 -> res = "Пс 21.6"
                4 -> res = "Пс 26.11"
                6 -> res = "Пс 102.17; Иер 33.11"
                7 -> res = "Иов 13.26"
                8 -> res = "Втор 32.4"
                10 -> res = "Ос 14.10; Дан 4.34"
                11 -> res = "Пс 78.9"
                13 -> res = "Ис 60.21"
                14 -> res = "Втор 29.29; Лк 8.10"
                15 -> res = "Иов 16.20; Пс 120.1"
                17 -> res = "2 Цар 22.7; Плач 1.20"
                19 -> res = "Ин 15.25"
            }
        }
        if (glava == 25) {
            when (stih) {
                2 -> res = "Пс 7.10"
                4 -> res = "Иов 31.5"
                5 -> res = "Пс 118.128"
                6 -> res = "Втор 21.6; Пс 22.6; 41.3"
                8 -> res = "Лк 2.37; Пс 26.4"
                12 -> res = "Пс 21.23"
            }
        }
        if (glava == 26) {
            when (stih) {
                1 -> res = "Пс 117.6; Мих 7.8"
                3 -> res = "Пс 3.7"
                4 -> res = "Пс 22.6"
                5 -> res = "Пс 30.21"
                7 -> res = "Пс 4.2"
                8 -> res = "Пс 49.15"
                9 -> res = "3 Цар 8.57"
                10 -> res = "Ис 63.16; 64.8"
                11 -> res = "Пс 24.4; 85.11"
                12 -> res = "Пс 30.9"
                13 -> res = "Ис 38.11"
                14 -> res = "Ис 25.9; Авв 2.9"
            }
        }
        if (glava == 27) {
            when (stih) {
                1 -> res = "Пс 142.7"
                2 -> res = "Пс 4.2"
                3 -> res = "Пс 11.3; Иер 9.8"
                4 -> res = "Мф 16.27"
                5 -> res = "Иов 34.27; Ис 5.12"
                7 -> res = "Пс 3.4"
                8 -> res = "Пс 26.1"
            }
        }
        if (glava == 28) {
            when (stih) {
                1 -> res = "Пс 95.7; Откр 21.24"
                3 -> res = "2 Цар 22.14; Иов 37.4"
                5 -> res = "Ис 30.31"
                6 -> res = "Деян 9.5"
                9 -> res = "Иов 39.4"
                10 -> res = "Быт 6.17; 1 Пет 3.20-21"
            }
        }
        if (glava == 29) {
            when (stih) {
                1 -> res = "2 Цар 5.11"
                2 -> res = "Пс 34.19"
                3 -> res = "Втор 32.39"
                4 -> res = "1 Цар 2.6; Пс 85.13"
                5 -> res = "Пс 96.12"
                6 -> res = "Ис 54.8"
                7 -> res = "Иов 29.18"
                10 -> res = "Пс 6.6; Ис 38.18"
                13 -> res = "Пс 15.9"
            }
        }
        if (glava == 30) {
            when (stih) {
                2 -> res = "Ис 49.23"
                4 -> res = "Пс 17.3"
                6 -> res = "Лк 23.46"
                7 -> res = "Втор 32.21; Пс 61.11"
                9 -> res = "Пс 17.20"
                10 -> res = "Пс 6.8"
                11 -> res = "Пс 108.24"
                12 -> res = "Иов 19.13"
                13 -> res = "Еккл 9.5; Иер 48.38"
                14 -> res = "Пс 2.2"
                16 -> res = "Пс 38.5; 138.16"
                17 -> res = "Чис 6.25; Пс 4.7; Дан 9.18"
                20 -> res = "Ис 64.4"
                21 -> res = "1 Цар 25.29; Пс 26.5"
                22 -> res = "Пс 4.4"
                23 -> res = "Пс 144.19"
                24 -> res = "Иов 22.29; Притч 29.23; 1 Пет 5.5"
            }
        }
        if (glava == 31) {
            when (stih) {
                1 -> res = "Рим 4.7"
                2 -> res = "2 Кор 5.19"
                4 -> res = "Пс 37.5"
                5 -> res = "Притч 28.13; 1 Ин 1.9"
                6 -> res = "Ис 55.6"
                7 -> res = "Пс 9.10"
                8 -> res = "Пс 24.12; Притч 4.11; Втор 11.12"
                9 -> res = "Притч 26.3"
                10 -> res = "Ис 57.20"
            }
        }
        if (glava == 32) {
            when (stih) {
                1 -> res = "Пс 31.11; 146.1"
                2 -> res = "Пс 91.4"
                3 -> res = "Пс 39.4; Ис 42.10; Откр 5.9"
                6 -> res = "Быт 1.6-8; Ин 1.3"
                7 -> res = "Иов 38.8; Иер 5.22"
                9 -> res = "Быт 1.3; Иудифь 16.14"
                10 -> res = "Иов 5.12"
                11 -> res = "Притч 19.21; Ис 46.4"
                12 -> res = "Пс 64.5; 143.15"
                13 -> res = "2 Пар 16.9; Иов 28.24"
                17 -> res = "Притч 21.31"
                18 -> res = "Иов 36.7; Пс 33.16; 1 Пет 3.12"
                21 -> res = "Ис 66.14"
            }
        }
        if (glava == 33) {
            when (stih) {
                1 -> res = "1 Цар 21.13"
                3 -> res = "Лк 1.47"
                5 -> res = "Ис 65.24"
                6 -> res = "Мих 7.7"
                7 -> res = "Пс 17.7; 68.34"
                8 -> res = "Быт 32.1"
                9 -> res = "Пс 2.12; Притч 16.20"
                10 -> res = "Нав 4.24"
                11 -> res = "Лк 1.53"
                13 -> res = "1 Пет 3.10"
                15 -> res = "Иов 28.28; Пс 36.37"
                16 -> res = "Пс 32.18; Сир 15.19"
                19 -> res = "Пс 144.18"
                20 -> res = "Деян 7.10; Рим 8.17"
                21 -> res = "Ис 66.14"
                22 -> res = "Притч 22.8"
                23 -> res = "Рим 8.1"
            }
        }
        if (glava == 34) {
            when (stih) {
                1 -> res = "Ис 49.25"
                4 -> res = "Пс 69.3"
                5 -> res = "Иов 21.18; Пс 1.4; Ис 29.5; Ос 13.3"
                7 -> res = "Лк 23.4"
                8 -> res = "Пс 7.16; Дан 6.24"
                10 -> res = "Иов 36.13"
                11 -> res = "Мф 26.60; Деян 6.13; 24.26"
                15 -> res = "Иов 30.9; Лк 23.35"
                18 -> res = "Пс 21.26"
                19 -> res = "Ин 15.25"
                21 -> res = "Иов 16.9; Пс 39.16; Плач 2.16"
                23 -> res = "Пс 43.24"
                26 -> res = "Иов 8.22; Пс 6.11"
                27 -> res = "Пс 39.17"
            }
        }
        if (glava == 35) {
            when (stih) {
                2 -> res = "Быт 20.11"
                3 -> res = "4 Цар 17.9"
                5 -> res = "Мих 2.1; Рим 12.9"
                6 -> res = "Пс 56.11"
                7 -> res = "Рим 11.33; Иона 4.11; 1 Кор 9.9"
                8 -> res = "Иов 36.11; Пс 16.8"
                9 -> res = "Ис 25.6; 2 Кор 8.9; Откр 21.6"
            }
        }
        if (glava == 36) {
            when (stih) {
                1 -> res = "Притч 23.17; 24.1"
                2 -> res = "Пс 128.6; Ис 37.27; Сир 14.19"
                5 -> res = "Пс 54.23"
                6 -> res = "Ис 58.8"
                8 -> res = "Еф 4.26"
                9 -> res = "Ис 34.17"
                11, 29 -> res = "Мф 5.5"
                16 -> res = "Мк 8.8"
                17 -> res = "Иер 48.25"
                19 -> res = "Иов 5.20; Пс 32.19"
                20 -> res = "Пс 67.3"
                22 -> res = "Пс 24.13; Притч 2.21"
                24 -> res = "Пс 144.14; Притч 24.16"
                25 -> res = "Сир 2.10"
                26 -> res = "Пс 111.5"
                27 -> res = "Пс 33.15; Ис 1.16"
                28 -> res = "3 Цар 8.57"
                30 -> res = "Притч 10.31; Мф 12.35"
                31 -> res = "Ис 51.7"
                32 -> res = "Пс 11.9; Мк 3.2"
                35 -> res = "Пс 72.6; Иез 31.3"
                36 -> res = "Иов 4.20; 5.3; 20.7"
                37 -> res = "Быт 39.8; Лк 16.25; Рим 2.10"
                39 -> res = "Есф 8.16; Пс 45.2"
                40 -> res = "Прем 3.9; Дан 6.23"
            }
        }
        if (glava == 37) {
            when (stih) {
                2 -> res = "Пс 6.2; Иер 10.24"
                3 -> res = "Втор 32.23; Иов 6.4"
                5 -> res = "Пс 31.4; Иез 33.10"
                7 -> res = "Пс 41.10"
                12 -> res = "Иов 19.13; 30.10; Пс 30.12"
                14 -> res = "Ис 53.7; Мф 27.12; Деян 8.32"
                19 -> res = "Пс 31.5; 2 Кор 7.10"
                21 -> res = "Пс 108.5"
            }
        }
        if (glava == 38) {
            when (stih) {
                1 -> res = "1 Пар 16.42"
                2 -> res = "Пс 140.3"
                3 -> res = "Пс 107.14"
                4 -> res = "Деян 17.16"
                5 -> res = "Рим 13.11"
                6 -> res = "Пс 89.6; 143.4"
                7 -> res = "Иов 8.9; Иер 17.11; Лк 12.20"
                10 -> res = "Мф 11.5"
                12 -> res = "Ис 51.8"
                13 -> res = "1 Пар 29.15; 2 Кор 5.6-7; Флп 3.20; Евр 11.13 "
            }
        }
        if (glava == 39) {
            when (stih) {
                3 -> res = "Иов 30.19; Лк 6.48"
                4 -> res = "Пс 32.3; Откр 5.9"
                5 -> res = "Пс 2.12; Притч 16.20; Иер 17.7"
                7 -> res = "Пс 50.18"
                8 -> res = "Ин 5.46"
                9 -> res = "Ис 50.5"
                10 -> res = "Пс 34.18"
                11 -> res = "Мф 12.35"
                13 -> res = "Пс 30.11"
                14 -> res = "Пс 21.20"
                15 -> res = "Пс 34.4"
                16 -> res = "Пс 34.21"
                18 -> res = "Пс 69.6"
            }
        }
        if (glava == 40) {
            when (stih) {
                2 -> res = "Притч 14.21; Дан 4.24; Лк 14.1"
                4 -> res = "Мф 9.22; Лк 7.7"
                5 -> res = "Пс 6.3"
                8 -> res = "Мф 22.15"
                9 -> res = "Мк 12.13; Мф 27.66"
                10 -> res = "Ин 13.18; Деян 1.16"
                14 -> res = "Пс 39.17"
            }
        }
        if (glava == 41) {
            when (stih) {
                1 -> res = "1 Пар 6.22; 9.19; 26.1"
                3 -> res = "Пс 83.3"
                5 -> res = "Иов 30.16"
                6, 12 -> res = "Пс 42.5"
                8 -> res = "Пс 68.3"
                9 -> res = "Пс 118.62"
                10 -> res = "Пс 37.7"
            }
        }
        if (glava == 42) {
            when (stih) {
                2 -> res = "Пс 37.7"
                3 -> res = "2 Цар 15.25"
                5 -> res = "Пс 41.6"
            }
        }
        if (glava == 43) {
            when (stih) {
                1 -> res = "Пс 41.1"
                2 -> res = "Втор 6.21; Пс 77.3"
                3 -> res = "Исх 15.17"
                4 -> res = "Втор 33.29"
                6 -> res = "Пс 59.14; Ис 33.22"
                7 -> res = "Пс 19.8"
                10 -> res = "Пс 59.3"
                13 -> res = "1 Цар 12.9; Ис 52.3"
                14 -> res = "Пс 78.4; Иер 24.9"
                18 -> res = "Ис 26.8"
                22 -> res = "Пс 7.10"
                23 -> res = "Рим 8.36"
                24 -> res = "Мф 8.24-25"
                25 -> res = "Пс 12.2"
                26 -> res = "Ис 51.23"
            }
        }
        if (glava == 44) {
            when (stih) {
                1 -> res = "Еф 1.6"
                3 -> res = "Лк 4.22"
                4 -> res = "Пс 23.8; Ис 11.5; Евр 4.12; Откр 1.16; 19.15"
                6 -> res = "Иов 6.4; Пс 37.3"
                7 -> res = "Евр 1.8; Ис 32.1"
                8 -> res = "Пс 14.2; Ис 61.1"
                9 -> res = "Песн 1.3; Еф 5.2"
                10 -> res = "Ис 61.10"
                11 -> res = "Ос 2.19"
                12 -> res = "Ис 62.4; Откр 19.7"
                13 -> res = "Пс 71.10"
                14 -> res = "Иез 16.10; Мф 22.11"
                15 -> res = "Ис 61.10; 1 Пет 3.3"
                17 -> res = "Рим 9.5; Откр 1.6; 5.10"
            }
        }
        if (glava == 45) {
            when (stih) {
                1 -> res = "Пс 41.1"
                2 -> res = "Пс 17.3; Притч 18.11; Авв 3.19"
                6 -> res = "Ис 33.20; Иез 48.35; Зах 2.5"
                8, 12 -> res = "Рим 8.31"
                9 -> res = "Пс 65.5"
                10 -> res = "Пс 75.4; Ос 2.18"
                11 -> res = "Ис 64.2"
            }
        }
        if (glava == 46) {
            when (stih) {
                3 -> res = "Зах 14.9; Мал 1.14; Откр 19.15"
                6 -> res = "Пс 67.19; Деян 1.9; Еф 4.10"
                7 -> res = "Ис 12.5"
                9 -> res = "Пс 21.29; 79.2; Евр 8.1"
            }
        }
        if (glava == 47) {
            when (stih) {
                2 -> res = "Пс 144.3; Евр 12.22; Откр 14.1"
                3 -> res = "Иез 40.2"
                4 -> res = "2 Пар 20.8; Зах 8.3; Мал 1.14"
                6 -> res = "4 Цар 19.35-36"
                7 -> res = "4 Цар 19.3; Ис 21.3"
                8 -> res = "Ис 27.8"
                11 -> res = "4 Цар 19.15; Деян 19.17"
                15 -> res = "Ис 25.9"
            }
        }
        if (glava == 48) {
            when (stih) {
                5 -> res = "Пс 77.2; Мф 13.35"
                7 -> res = "Иов 36.18; Пс 51.9; Притч 11.4"
                8 -> res = "1 Ин 3.16"
                9 -> res = "Мф 16.26; Мк 8.37; 1 Пет 1.19"
                11 -> res = "Притч 11.4; Еккл 2.16; 6.2"
                13 -> res = "Еккл 3.19"
                15 -> res = "Ис 14.11; Откр 2.27"
                16 -> res = "Пс 15.10"
                18 -> res = "Иов 27.18"
                19 -> res = "Втор 29.19"
                21 -> res = "Еккл 3.19; Лк 12.20"
            }
        }
        if (glava == 49) {
            when (stih) {
                1 -> res = "Втор 10.17"
                2 -> res = "Пс 47.3"
                3 -> res = "Пс 2.5"
                4 -> res = "Втор 31.28"
                5 -> res = "Мф 24.31"
                7 -> res = "Пс 80.9"
                9 -> res = "Ис 66.3; Иер 6.20; Ос 5.6"
                12 -> res = "Исх 19.5; Пс 23.1; Иов 41.3"
                14 -> res = "Пс 115.8; Рим 12.1"
                15 -> res = "Пс 26.8; Зах 13.9"
                16 -> res = "Рим 2.21; 1 Кор 9.27"
                17 -> res = "Мф 7.3"
                18 -> res = "Мф 24.49; Еф 5.7"
                19 -> res = "Мих 6.12"
                21 -> res = "Ис 42.14; 47.11; 57.11"
                23 -> res = "Лк 8.39; Ин 7.17"
            }
        }
        if (glava == 50) {
            when (stih) {
                2 -> res = "2 Цар 12.1"
                3 -> res = "Пс 56.2; Ис 33.2; Евр 9.14"
                5 -> res = "Пс 31.5"
                6 -> res = "Рим 3.4"
                7 -> res = "Иов 14.4"
                8 -> res = "1 Кор 2.7"
                9 -> res = "Лев 14.6"
                12 -> res = "2 Кор 5.17; Гал 6.15; Еф 2.10"
                13 -> res = "Мф 6.13; Иер 7.15"
                15 -> res = "Мф 7.5"
                16 -> res = "2 Цар 11.15-16; 12.9"
                17 -> res = "Пс 70.8"
                18 -> res = "Пс 39.7"
                19 -> res = "Пс 4.6; Ис 66.2; Лк 18.13"
                20 -> res = "Ис 33.20; 54.11"
                21 -> res = "Втор 33.19"
            }
        }
        if (glava == 51) {
            when (stih) {
                2 -> res = "1 Цар 22.9"
                3 -> res = "Притч 21.12"
                4 -> res = "Пс 56.5; Притч 25.18"
                7 -> res = "Иов 18.14; 20.7; Пс 49.22"
                9 -> res = "Пс 48.7; Притч 11.28; Мк 10.24"
                10 -> res = "Пс 91.13; Иер 11.16; Ос 14.7"
                11 -> res = "Пс 36.5"
            }
        }
        if (glava == 52) {
            when (stih) {
                2 -> res = "Пс 9.25; 13.1"
                3 -> res = "Рим 3.11"
                6 -> res = "Мф 25.25"
                7 -> res = "Пс 13.7; Откр 22.20"
            }
        }
        if (glava == 53) {
            when (stih) {
                2 -> res = "1 Цар 23.19; 26.1"
                4 -> res = "Пс 4.2; 5.2"
                5 -> res = "Пс 85.14; Тов 4.5"
                9 -> res = "Пс 58.10-11"
            }
        }
        if (glava == 54) {
            when (stih) {
                2 -> res = "Пс 53.4"
                4 -> res = "2 Цар 17.1"
                11 -> res = "Чис 23.21"
                14 -> res = "Мф 26.23; Ин 13.18; Деян 1.16"
                18 -> res = "Дан 6.10"
                20 -> res = "Пс 9.8"
                22 -> res = "Пс 56.5"
                23 -> res = "Мф 6.25; Лк 12.22; 1 Пет 5.7"
                24 -> res = "Притч 26.27; Пс 68.16; 4 Цар 1.4"
            }
        }
        if (glava == 55) {
            when (stih) {
                1 -> res = "1 Цар 21.10-11"
                5 -> res = "Ис 51.8; 1 Пет 3.12; Евр 13.6"
                10 -> res = "Иер 29.12"
                12 -> res = "Пс 117.6"
            }
        }
        if (glava == 56) {
            when (stih) {
                1 -> res = "1 Цар 22.1"
                2 -> res = "Пс 50.3"
                4 -> res = "Пс 55.3"
                5 -> res = "Пс 54.22"
                6 -> res = "Пс 107.6"
                7 -> res = "Пс 7.16; Притч 26.27; Еккл 10.8"
                8 -> res = "Пс 107.2"
                9 -> res = "Пс 107.3"
                10 -> res = "Пс 107.4"
                11 -> res = "Пс 35.6"
                12 -> res = "Пс 56.6"
            }
        }
        if (glava == 57) {
            when (stih) {
                3 -> res = "Притч 21.29"
                4 -> res = "Пс 115.2"
                5 -> res = "Пс 139.4"
                6 -> res = "Ис 48.8"
                7 -> res = "Пс 3.8"
                8 -> res = "Иер 17.11"
                9 -> res = "Иов 3.16; Еккл 6.10"
                10 -> res = "2 Цар 23.6; Иез 2.6"
                11 -> res = "Откр 14.20"
                12 -> res = "Еккл 3.17; Иер 9.24"
            }
        }
        if (glava == 58) {
            when (stih) {
                1 -> res = "1 Цар 19.11"
                4 -> res = "Пс 55.7"
                5 -> res = "Пс 43.24"
                6 -> res = "Ис 26.21"
                8 -> res = "Притч 25.18"
                9 -> res = "Пс 2.4; 36.13"
                10 -> res = "Пс 53.9"
                13 -> res = "Пс 35.4"
                14 -> res = "Пс 55.8"
                16 -> res = "Ам 8.11-12"
            }
        }
        if (glava == 59) {
            when (stih) {
                2 -> res = "2 Цар 8.1 и проч; 1 Пар 18.3, 12"
                3, 12 -> res = "Пс 43.10"
                4 -> res = "2 Пар 7.14"
                5 -> res = "Пс 74.9"
                8 -> res = "Пс 107.8"
                10 -> res = "2 Цар 8.2; 22.44; Ис 21.11"
                14 -> res = "Пс 17.30; 107.14"
            }
        }
        if (glava == 60) {
            when (stih) {
                2 -> res = "Пс 5.2; 53.4"
                3 -> res = "Пс 17.7; Ис 33.16"
                4 -> res = "Пс 70.3"
                5 -> res = "Пс 35.8"
                7 -> res = "Пс 20.5"
                8 -> res = "2 Цар 7.12-13"
                9 -> res = "Пс 49.14"
            }
        }
        if (glava == 61) {
            when (stih) {
                1 -> res = "Пс 38.1"
                2 -> res = "Пс 36.7"
                3 -> res = "Пс 17.3"
                4 -> res = "Ис 30.13"
                5 -> res = "Пс 27.3; Иер 9.8"
                7 -> res = "2 Пар 25.8"
                9 -> res = "Пс 4.6; 1 Цар 1.15; Иов 30.16"
                10 -> res = "Пс 38.6; Ис 40.23; Дан 4.32"
                11 -> res = "Мф 19.24; Лк 12.19-20; 1 Тим 6.9, 17"
                13 -> res = "Иов 34.11; Притч 24.12; Иер 32.19; Иез 33.20; Мф 16.27; Рим 2.6"
            }
        }
        if (glava == 62) {
            when (stih) {
                1 -> res = "1 Цар 23.14"
                2 -> res = "Ис 26.9; Пс 41.3"
                3 -> res = "Пс 22.6; 26.4"
                7 -> res = "Пс 34.28"
                8 -> res = "Пс 16.8"
                9 -> res = "Ис 41.10"
                10 -> res = "Чис 16.32"
                12 -> res = "Втор 6.13; Ис 19.18; Иер 4.2"
            }
        }
        if (glava == 63) {
            when (stih) {
                4 -> res = "Пс 54.22; 58.8; Иер 9.3"
                6 -> res = "Иов 22.13; 24.15"
                7 -> res = "Иер 17.9"
                9 -> res = "Пс 7.16"
                10 -> res = "Исх 8.19; Есф 8.17"
                11 -> res = "Пс 31.11"
            }
        }
        if (glava == 64) {
            when (stih) {
                2 -> res = "Пс 49.14"
                3 -> res = "Пс 144.21; Иер 32.27"
                7 -> res = "Ам 4.13"
                8 -> res = "Пс 106.29; Мф 8.26"
                10 -> res = "Втор 11.11; 33.28; Пс 45.5"
                12 -> res = "Втор 11.11"
            }
        }
        if (glava == 65) {
            when (stih) {
                2 -> res = "Пс 99.1"
                3 -> res = "Втор 33.29"
                5 -> res = "Пс 45.9"
                6 -> res = "Исх 14.21-22; Нав 3.16-17"
                10 -> res = "1 Пет 1.7; 4.12; Иез 22.21"
                12 -> res = "Ис 43.2; Дан 3.17"
                18 -> res = "Притч 15.29; 28.9"
            }
        }
        if (glava == 66) {
            when (stih) {
                2 -> res = "Чис 6.25; Кол 1.15"
                4 -> res = "Рим 15.11"
                5 -> res = "Деян 17.31"
                7 -> res = "Лев 26.4; Пс 84.13"
                8 -> res = "Втор 6.25"
            }
        }
        if (glava == 67) {
            when (stih) {
                2 -> res = "Чис 10.35"
                3 -> res = "Иудифь 16.15"
                4 -> res = "Пс 63.11"
                5 -> res = "Ис 40.3; 57.14"
                6 -> res = "Пс 145.9; Ин 14.18"
                7 -> res = "Пс 112.9"
                8 -> res = "Исх 13.20; Чис 14.14"
                9 -> res = "Исх 20.18"
                10 -> res = "Ис 32.15; 44.3; Иоил 2.28"
                12 -> res = "Ис 52.7"
                15 -> res = "Суд 9.48"
                17 -> res = "Пс 113.4"
                18 -> res = "Втор 33.2"
                19 -> res = "Еф 4.10"
                21 -> res = "Втор 32.39; 1 Цар 2.6; Прем 16.13"
                23 -> res = "Чис 21.33"
                24 -> res = "Пс 57.11; Откр 14.20"
                26 -> res = "Исх 15.20; 1 Цар 18.6"
                27 -> res = "Пс 21.23; Ин 20.17"
                30 -> res = "Пс 71.10; Ис 60.6"
                32 -> res = "Ис 18.7"
                34 -> res = "Пс 28.3; Зах 9.14; Откр 4.5"
            }
        }
        if (glava == 68) {
            when (stih) {
                2 -> res = "Ис 43.2"
                3 -> res = "Пс 39.3; 41.8"
                5 -> res = "Пс 34.19; Ис 53.4; Иез 33.15"
                10 -> res = "Ин 2.17; Рим 15.3"
                13 -> res = "Иов 30.9"
                14 -> res = "Ис 49.8"
                15 -> res = "Пс 39.3"
                18 -> res = "Пс 101.3"
                20 -> res = "Пс 43.16"
                21 -> res = "Мф 27.39; Лк 23.49"
                22 -> res = "Мф 27.34, 48; Ин 19.29"
                23 -> res = "Рим 11.9"
                26 -> res = "Деян 1.20"
                27 -> res = "Ис 53.4"
                28 -> res = "Рим 1.28"
                29 -> res = "Лк 10.20; Флп 4.3; Откр 3.5"
                33 -> res = "Пс 21.27"
                34 -> res = "Пс 33.7"
                35 -> res = "Пс 147.1"
                36 -> res = "1 Кор 3.10"
            }
        }
        if (glava == 69) {
            when (stih) {
                3 -> res = "Пс 34.4"
                4 -> res = "Пс 34.21"
            }
        }
        if (glava == 70) {
            when (stih) {
                1 -> res = "Пс 30.2-3"
                3 -> res = "Мф 4.6; Лк 4.10"
                4 -> res = "Пс 90.14"
                5 -> res = "Евр 2.13"
                6 -> res = "Втор 10.21; Пс 21.10"
                7 -> res = "Иез 12.6; 24.27"
                8 -> res = "Пс 50.17"
                9 -> res = "Пс 68.4; Ис 46.4"
                12 -> res = "Пс 69.2"
                13 -> res = "Пс 34.4"
                17 -> res = "Пс 76.12"
                18 -> res = "Ис 46.4"
                19 -> res = "Исх 15.11; Откр 17.14"
                20 -> res = "Пс 67.23"
                21 -> res = "Втор 32.39"
                22 -> res = "Пс 88.19; 150.3"
            }
        }
        if (glava == 71) {
            when (stih) {
                1 -> res = "Дан 7.27; Ис 11.5"
                2 -> res = "Ис 32.1"
                3 -> res = "3 Цар 4.24; Еф 2.14"
                4 -> res = "Пс 44.5; Ис 11.4"
                5 -> res = "Иер 31.36"
                6 -> res = "Суд 6.36-37; 2 Цар 23.4"
                7 -> res = "Ис 35.1; Ос 14.6"
                8 -> res = "3 Цар 4.21"
                10 -> res = "Пс 44.13"
                11 -> res = "Пс 21.30; Откр 21.24"
                13 -> res = "Ин 5.7"
                15 -> res = "Ис 53.10; Евр 7.16"
                16 -> res = "Ис 27.6; Ос 14.6; Зах 10.8"
                17 -> res = "Быт 12.3; Гал 3.8, 16"
                18 -> res = "1 Пар 16.36; Лк 1.68"
                19 -> res = "Ис 6.3"
            }
        }
        if (glava == 72) {
            when (stih) {
                1 -> res = "Пс 63.9; Мф 5.8; Ин 1.47"
                3 -> res = "Пс 36.1; Иов 21.7; Иер 12.1"
                7 -> res = "Иов 15.27"
                9 -> res = "Сир 13.28"
                11 -> res = "Пс 9.32; 93.7"
                13 -> res = "Мал 3.14; Иов 9.30"
                18 -> res = "Иов 21.16-17; Притч 14.32"
                19 -> res = "Иов 21.30; Пс 51.7"
                20 -> res = "Иов 21.17; Ис 29.7"
                22 -> res = "Ин 12.16"
                23 -> res = "Ин 6.68"
                25 -> res = "Пс 15.5; Ин 4.14"
                26 -> res = "Плач 3.24"
                27 -> res = "Иер 17.13; Ос 7.13"
                28 -> res = "Иак 4.8"
            }
        }
        if (glava == 73) {
            when (stih) {
                1 -> res = "Пс 43.24"
                3 -> res = "Пс 67.17; Иоил 3.16"
                4 -> res = "Иер 2.15"
                7 -> res = "4 Цар 25.9"
                9 -> res = "Плач 2.9"
                13 -> res = "Исх 14.21"
                15 -> res = "Исх 17.5-6; Чис 20.11; Нав 3.13"
                17 -> res = "Быт 8.22"
                18 -> res = "Плач 3.61"
                21 -> res = "Лк 11.27"
                22 -> res = "Ис 49.4; Иез 39.25"
            }
        }
        if (glava == 74) {
            when (stih) {
                2 -> res = "Пс 9.2; 43.2"
                4 -> res = "Пс 45.7"
                8 -> res = "Дан 5.21"
                9 -> res = "Пс 59.5"
                11 -> res = "Лк 1.69"
            }
        }
        if (glava == 75) {
            when (stih) {
                3 -> res = "1 Езд 1.3"
                4 -> res = "Пс 45.10; Ис 9.4"
                7 -> res = "Суд 5.22"
                9 -> res = "Откр 6.17"
                11 -> res = "Иез 28.22"
                12 -> res = "Пс 60.9"
                13 -> res = "1 Цар 14.15; Откр 19.15"
            }
        }
        if (glava == 76) {
            when (stih) {
                1 -> res = "Пс 38.1"
                3 -> res = "2 Пар 20.3; Пс 17.7; 49.15"
                6 -> res = "Пс 142.5"
                7 -> res = "Ис 26.9"
                8 -> res = "Пс 12.2; 84.6; Плач 3.31"
                10 -> res = "Мк 4.38"
                11 -> res = "Ис 41.10"
                12 -> res = "Втор 32.7; Пс 70.17; 104.2"
                14 -> res = "Пс 88.9"
                15 -> res = "Лк 1.51"
                16 -> res = "Исх 14.19"
                17 -> res = "Исх 14.21"
                19 -> res = "Иов 37.5"
                20 -> res = "Иов 38.16; Авв 3.15"
                21 -> res = "Исх 14.15-16"
            }
        }
        if (glava == 77) {
            when (stih) {
                2 -> res = "Пс 48.5; Мф 13.35"
                3 -> res = "Пс 43.2"
                5 -> res = "Втор 4.9"
                8 -> res = "Втор 32.5; Иез 2.3"
                9 -> res = "Суд 8.2; 12.1; Ис 7.2; Ос 7.11"
                10 -> res = "4 Цар 17.15"
                13 -> res = "Исх 14.21"
                14 -> res = "Исх 13.21; Пс 104.39"
                15 -> res = "Исх 17.6; Чис 20.11; Прем 11.4; 1 Кор 10.4"
                18 -> res = "Чис 11.4; Пс 105.14; 1 Кор 10.9"
                21 -> res = "Чис 11.1"
                24 -> res = "Исх 16.14; Чис 11.7; Прем 16.2; Ин 6.31; 1 Кор 10.3"
                26 -> res = "Исх 16.13; Чис 11.31; Пс 104.40"
                27 -> res = "Исх 16.13; Чис 11.31; Пс 104.40"
                30 -> res = "Чис 11.33"
                32 -> res = "Втор 1.32"
                39 -> res = "Иак 4.14"
                40 -> res = "Чис 14.22"
                44 -> res = "Исх 7.20; Пс 104.29"
                45 -> res = "Исх 8.24; Пс 104.31"
                46 -> res = "Исх 10.13"
                47 -> res = "Исх 9.23, 25; Пс 104.33"
                50 -> res = "Исх 9.6"
                51 -> res = "Исх 12.29"
                52 -> res = "Исх 12.37"
                55 -> res = "Нав 12.7"
                58 -> res = "Втор 32.16"
                60 -> res = "1 Цар 4.11"
                64 -> res = "1 Цар 4.11"
                66 -> res = "1 Цар 5.6; 6.4"
                70 -> res = "1 Цар 16.11; 2 Цар 7.8"
                71 -> res = "2 Цар 5.2; 1 Пар 11.2"
            }
        }
        if (glava == 78) {
            when (stih) {
                1 -> res = "Иер 12.8"
                2 -> res = "1 Мак 7.17"
                3 -> res = "Иез 24.7"
                4 -> res = "Пс 43.14"
                5 -> res = "Пс 88.47"
                6 -> res = "Иер 10.25"
                8 -> res = "Ис 64.9"
                10 -> res = "Пс 41.4; Иоил 2.17"
                11 -> res = "3 Цар 8.49"
                12 -> res = "Ис 65.6"
                13 -> res = "Пс 99.3"
            }
        }
        if (glava == 79) {
            when (stih) {
                2 -> res = "Пс 76.21"
                3 -> res = "Ис 7.2"
                4 -> res = "Пс 30.17"
                6 -> res = "3 Цар 22.27; Пс 101.10"
                7 -> res = "Пс 43.14"
                9 -> res = "Пс 43.3"
                12 -> res = "Исх 23.31"
                13 -> res = "Ис 5.5"
                14 -> res = "4 Цар 17.6; 25.1; Пс 67.31"
            }
        }
        if (glava == 80) {
            when (stih) {
                1 -> res = "Пс 8.1; 83.1"
                4 -> res = "Чис 10.10"
                5 -> res = "Исх 23.17"
                8 -> res = "Исх 17.6"
                9 -> res = "Исх 20.1-2; Пс 49.7"
                13 -> res = "Деян 14.16"
                14 -> res = "Лев 26.3"
                17 -> res = "Втор 32.13"
            }
        }
        if (glava == 81) {
            when (stih) {
                2 -> res = "Втор 1.17; 2 Пар 19.6"
                4 -> res = "Притч 24.11; Ис 1.17"
                5 -> res = "1 Ин 1.6"
                6 -> res = "Ин 10.34"
                7 -> res = "Иез 31.14"
                8 -> res = "Пс 2.8; Евр 1.2"
            }
        }
        if (glava == 82) {
            when (stih) {
                2 -> res = "Пс 108.1"
                4 -> res = "Мф 26.4"
                5 -> res = "Иер 11.19; Деян 14.5"
                8 -> res = "Иез 27.9"
                9 -> res = "Быт 19.37"
                10 -> res = "Суд 4.15"
                12 -> res = "Суд 7.25; 8.12, 21"
                14 -> res = "Ис 17.13; Пс 1.4"
                17 -> res = "Пс 69.3"
                19 -> res = "Исх 14.4; 15.3"
            }
        }
        if (glava == 83) {
            when (stih) {
                1 -> res = "Пс 80.1"
                3 -> res = "Пс 41.3"
                8 -> res = "Ис 40.29; Рим 1.17"
                11 -> res = "1 Цар 26.19; 2 Цар 6.22"
                12 -> res = "Лк 22.35"
                13 -> res = "Пс 2.12; Притч 3.5"
            }
        }
        if (glava == 84) {
            when (stih) {
                3 -> res = "Пс 31.1; Рим 4.7"
                6 -> res = "Пс 12.2; 76.8; 78.5"
                10 -> res = "Пс 96.6; 144.18"
                13 -> res = "Иоил 2.19, 22"
            }
        }
        if (glava == 85) {
            when (stih) {
                1 -> res = "Пс 87.3"
                5 -> res = "Исх 34.6; Иоил 2.13; Иона 4.2"
                7 -> res = "Пс 49.15"
                8 -> res = "Втор 3.24"
                9 -> res = "Иер 3.17; Откр 15.5"
                10 -> res = "2 Цар 7.22; Ис 45.5"
                11 -> res = "Пс 24.4; 26.11"
                13 -> res = "Пс 29.4"
                14 -> res = "Пс 53.5"
                15 -> res = "Пс 85.5; Ис 54.8"
            }
        }
        if (glava == 86) {
            when (stih) {
                3 -> res = "Ис 62.3"
                5 -> res = "Гал 4.26"
            }
        }
        if (glava == 87) {
            when (stih) {
                1 -> res = "1 Пар 25.5"
                5 -> res = "Пс 27.1; Плач 3.6"
                6 -> res = "Иов 10.21"
                9 -> res = "Иов 30.10; Пс 30.12; 37.12"
                11 -> res = "Пс 6.6"
                13 -> res = "Иов 10.21-22"
                16 -> res = "Иов 19.7"
                18 -> res = "Пс 21.13"
            }
        }
        if (glava == 88) {
            when (stih) {
                1 -> res = "1 Пар 15.17"
                2 -> res = "Пс 91.3"
                4 -> res = "2 Цар 7.12; Пс 131.11"
                7 -> res = "Пс 85.8"
                9 -> res = "Пс 76.14; Откр 19.15"
                10 -> res = "Пс 106.29; Мф 8.26"
                12 -> res = "Быт 1.1"
                15 -> res = "Пс 92.2"
                18 -> res = "Лк 1.69"
                19 -> res = "Пс 3.4; 83.10"
                21 -> res = "1 Цар 16.13; Деян 13.22"
                22 -> res = "Ис 41.10"
                23 -> res = "2 Цар 7.10"
                26 -> res = "Пс 71.8; Откр 10.2"
                27 -> res = "2 Цар 7.14; Евр 1.5"
                28 -> res = "Кол 1.18; Откр 19.16"
                30 -> res = "Пс 71.5; 2 Цар 7.13; Дан 2.44"
                33 -> res = "2 Цар 7.14"
                35 -> res = "2 Цар 7.16"
                37 -> res = "2 Цар 7.16; Пс 71.17; Лк 1.33; Ин 12.34"
                38 -> res = "Откр 1.5"
                40 -> res = "Пс 43.10"
                41 -> res = "Плач 2.6"
                42 -> res = "Пс 30.12; 43.14"
                47 -> res = "Пс 12.2"
                49 -> res = "Пс 48.10; Сир 14.18"
                50 -> res = "2 Цар 7.15"
            }
        }
        if (glava == 89) {
            when (stih) {
                3 -> res = "Ис 43.13"
                5 -> res = "2 Пет 3.8"
                6 -> res = "Ис 40.6; 51.12; Сир 14.18"
                7 -> res = "Ис 40.7; Пс 75.8"
                10 -> res = "Сир 18.8"
                11 -> res = "Сир 16.19"
                12 -> res = "Пс 38.5"
                14 -> res = "Ис 33.2; Пс 137.8"
                17 -> res = "Иов 14.15"
            }
        }
        if (glava == 90) {
            when (stih) {
                1 -> res = "Пс 16.8; 35.8; Ос 14.8"
                2 -> res = "Пс 141.6"
                4 -> res = "Мф 23.37"
                5 -> res = "2 Цар 22.31; Пс 83.12"
                7 -> res = "Иов 11.19"
                8 -> res = "Пс 91.12; 111.8"
                11 -> res = "Мф 4.6; Лк 4.10"
                12 -> res = "Иов 5.23"
                13 -> res = "Лк 10.19"
                14 -> res = "Пс 144.19; Дан 6.23"
                15 -> res = "Иов 22.27; 33.24; Зах 13.9"
                16 -> res = "Ис 43.2"
            }
        }
        if (glava == 91) {
            when (stih) {
                2 -> res = "Пс 146.1"
                3 -> res = "Пс 88.2"
                6 -> res = "Пс 103.24; Иез 47.5; Рим 11.33"
                7 -> res = "Ис 26.10"
                8 -> res = "Пс 36.2; 128.6"
                9 -> res = "Иов 36.26; Пс 101.28"
                11 -> res = "Чис 23.22"
                13 -> res = "Пс 51.10"
                15 -> res = "Лк 2.36"
            }
        }
        if (glava == 92) {
            when (stih) {
                1 -> res = "Пс 95.10"
                4 -> res = "Пс 2.4-5; 109.5"
                5 -> res = "Пс 118.86"
            }
        }
        if (glava == 93) {
            when (stih) {
                1 -> res = "Втор 32.35; Рим 12.19"
                4 -> res = "Пс 51.3"
                5 -> res = "Пс 15.5"
                6 -> res = "Иез 22.7"
                7 -> res = "Иов 22.13; 24.15"
                9 -> res = "Притч 20.12; Мал 3.16"
                11 -> res = "1 Кор 3.20"
                12 -> res = "Иов 5.17; Притч 3.12"
                14 -> res = "3 Цар 8.57"
                21 -> res = "Пс 2.2; Дан 6.4"
            }
        }
        if (glava == 94) {
            when (stih) {
                1 -> res = "Втор 32.3"
                3 -> res = "1 Пар 16.25"
                4 -> res = "Пс 49.10"
                6 -> res = "Пс 17.7; 131.7"
                7 -> res = "Евр 3.7; 4.7"
                9 -> res = "Исх 17.2, 7"
                10 -> res = "Чис 14.34"
                11 -> res = "Евр 4.3"
            }
        }
        if (glava == 95) {
            when (stih) {
                1 -> res = "1 Пар 16.23"
                4 -> res = "Сир 43.31"
                5 -> res = "Ис 41.24"
                6 -> res = "1 Пар 16.27"
                7 -> res = "1 Пар 16.29; Пс 28.1"
                10 -> res = "Зах 9.10"
                11 -> res = "1 Пар 16.31; Ис 49.13; Откр 12.12"
                13 -> res = "Пс 9.9; Деян 17.31; Ис 3.14"
            }
        }
        if (glava == 96) {
            when (stih) {
                1 -> res = "Пс 92.1; 98.1; Зах 9.10"
                2 -> res = "Откр 10.1; Пс 88.15"
                4 -> res = "Откр 4.5; Пс 76.17"
                6 -> res = "Пс 18.2"
                7 -> res = "Исх 20.4; Лев 26.1; Втор 5.8"
                9 -> res = "Пс 134.5"
                10 -> res = "Ам 5.15; Рим 12.9"
                11 -> res = "2 Цар 22.29; Иов 18.5; Пс 111.4"
                12 -> res = "Пс 31.11"
            }
        }
        if (glava == 97) {
            when (stih) {
                1 -> res = "Ис 63.5"
                2 -> res = "Ис 52.10"
                3 -> res = "Лк 2.30; 3.6"
                4 -> res = "Пс 65.2"
                5 -> res = "Пс 149.3"
                8 -> res = "1 Пар 16.32"
                9 -> res = "Пс 95.13"
            }
        }
        if (glava == 98) {
            when (stih) {
                1 -> res = "Пс 92.1; 1 Цар 4.4; 2 Цар 6.2"
                3 -> res = "Пс 94.3; 110.9"
                4 -> res = "Пс 102.6"
                5 -> res = "Ис 6.3; Откр 4.8"
                6 -> res = "Исх 32.11; Чис 14.13; 1 Цар 12.19"
                7 -> res = "Исх 33.9"
                9 -> res = "1 Пет 1.16"
            }
        }
        if (glava == 99) {
            when (stih) {
                1 -> res = "Пс 97.4; Деян 10.46"
                3 -> res = "1 Цар 12.22; Пс 73.1; 78.13"
                5 -> res = "Пс 72.1"
            }
        }
        if (glava == 100) {
            when (stih) {
                1 -> res = "Пс 88.2"
                2 -> res = "1 Цар 18.14; 1 Пар 18.14"
                3 -> res = "Пс 138.21"
                4 -> res = "Пс 6.9"
                6 -> res = "Мк 3.35"
            }
        }
        if (glava == 101) {
            when (stih) {
                2 -> res = "Пс 142.1"
                3 -> res = "Пс 12.2; 43.25"
                4 -> res = "Притч 17.22"
                5 -> res = "Пс 108.22"
                7 -> res = "Втор 14.17"
                10 -> res = "Иов 3.24"
                12 -> res = "Иов 8.9; 14.1-2"
                14 -> res = "Пс 50.20; Иер 29.10"
                17 -> res = "Ис 14.32"
                21 -> res = "Пс 78.11"
                22 -> res = "Ис 62.6"
                23 -> res = "Зах 8.21"
                24 -> res = "Пс 88.46"
                25 -> res = "Иов 21.21"
                26 -> res = "Евр 1.10"
                27 -> res = "Ис 51.6; Мф 24.35"
                28 -> res = "Иов 36.26; Пс 80.3; Мал 3.6"
            }
        }
        if (glava == 102) {
            when (stih) {
                1 -> res = "Пс 103.1"
                3 -> res = "Пс 29.3; 2 Пар 30.20"
                4 -> res = "Иов 33.24"
                5 -> res = "Пс 5.13"
                6 -> res = "Пс 98.4"
                8 -> res = "Чис 14.18; Неем 9.17"
                9 -> res = "Ис 57.16"
                15 -> res = "Ис 40.6"
                16 -> res = "Иов 7.10"
                17 -> res = "Пс 24.6"
                18 -> res = "Втор 7.9; Пс 30.2"
                19 -> res = "Пс 9.8"
                20 -> res = "Дан 7.10"
                21 -> res = "Еф 3.10; Кол 1.16"
            }
        }
        if (glava == 103) {
            when (stih) {
                1 -> res = "Пс 102.1, 22"
                2 -> res = "Быт 1.3, 6, 8"
                3 -> res = "Быт 1.7"
                4 -> res = "Евр 1.7"
                7 -> res = "Иов 37.5"
                9 -> res = "Иов 38.10-11"
                10 -> res = "Пс 73.15; Втор 11.11; Иов 5.10"
                14 -> res = "Пс 146.8"
                15 -> res = "Суд 9.13; Сир 40.20"
                20 -> res = "Быт 1.16"
                21 -> res = "Пс 146.9; Ис 31.4"
                22 -> res = "Иов 37.8"
                24 -> res = "Пс 32.5; 91.6"
                25 -> res = "Сир 43.27"
                26 -> res = "Иов 40.20"
                27 -> res = "Пс 144.15"
                28 -> res = "Притч 6.8"
                29 -> res = "Иов 12.10; Дан 5.23"
                30 -> res = "Иов 33.4"
                32 -> res = "Пс 143.5"
                33 -> res = "Пс 33.2"
                35 -> res = "Пс 102.1"
            }
        }
        if (glava == 104) {
            when (stih) {
                1 -> res = "1 Пар 16.8; Ис 12.4"
                2 -> res = "Пс 70.17"
                3 -> res = "Пс 33.4"
                8 -> res = "Деян 7.5; Исх 2.24"
                9 -> res = "Быт 17.2; 26.3; Лк 1.73; Евр 6.13"
                10 -> res = "Быт 13.15"
                13 -> res = "Быт 13.8; Евр 11.8"
                14 -> res = "Быт 12.17"
                15 -> res = "1 Пар 16.22"
                16 -> res = "Быт 41.57"
                17 -> res = "Быт 37.28"
                18 -> res = "Быт 39.20"
                20 -> res = "Быт 41.14"
                21 -> res = "Деян 7.10"
                23 -> res = "Быт 46.6"
                24 -> res = "Исх 1.7; Деян 7.17"
                25 -> res = "Исх 1.14"
                26 -> res = "Исх 3.10"
                27 -> res = "Исх 7.10"
                28 -> res = "Исх 10.22"
                29 -> res = "Исх 7.20; Пс 77.44"
                30 -> res = "Исх 8.6"
                31 -> res = "Исх 8.17; Пс 77.45"
                32 -> res = "Исх 9.23"
                33 -> res = "Исх 9.25; Пс 77.47"
                34 -> res = "Исх 10.13-14; Пс 77.46"
                36 -> res = "Исх 12.29; Пс 77.51"
                37 -> res = "Исх 12.35"
                38 -> res = "Исх 12.33"
                39 -> res = "Исх 13.21; Пс 77.14"
                40 -> res = "Исх 16.13"
                41 -> res = "Исх 17.6; Чис 20.11; Пс 77.16; Прем 11.4; 1 Кор 10.4"
                42 -> res = "Быт 22.16"
                43 -> res = "Нав 3.1"
            }
        }
        if (glava == 105) {
            when (stih) {
                1 -> res = "Пс 117.1"
                2 -> res = "Сир 43.34"
                3 -> res = "Пс 36.37"
                4 -> res = "Неем 5.19"
                5 -> res = "Пс 2.8"
                6 -> res = "Дан 9.5"
                7 -> res = "Исх 14.11"
                9 -> res = "Исх 14.21; Пс 77.13"
                10 -> res = "Лк 1.71"
                11 -> res = "Исх 14.28"
                13 -> res = "Иер 2.32"
                14 -> res = "Чис 11.33"
                15 -> res = "Иак 4.3"
                16 -> res = "Чис 16.2"
                17 -> res = "Чис 16.31; Втор 11.6"
                19 -> res = "Исх 32.4"
                20 -> res = "Рим 1.23"
                23 -> res = "Исх 32.11"
                24 -> res = "Чис 14.2"
                25 -> res = "Втор 1.27"
                26 -> res = "Чис 14.29"
                28 -> res = "Чис 25.3"
                30 -> res = "Чис 25.7"
                31 -> res = "Чис 25.13"
                32 -> res = "Чис 20.3"
                34 -> res = "Втор 7.2"
                35 -> res = "Ос 7.8"
                36 -> res = "Исх 23.33; Втор 7.16"
                37 -> res = "Лев 18.21; Втор 12.31; 4 Цар 21.6"
                40 -> res = "Суд 2.14; 3.8"
                45 -> res = "Втор 30.1-3"
                47 -> res = "1 Пар 16.35; Ис 11.12"
                48 -> res = "1 Пар 16.36; Пс 40.14; 71.18"
            }
        }
        if (glava == 106) {
            when (stih) {
                1 -> res = "Иудифь 16.1"
                2 -> res = "Пс 105.10"
                4 -> res = "Евр 11.9, 37; 13.14"
                6 -> res = "Пс 21.6"
                9 -> res = "Пс 33.11; 144.16"
                10 -> res = "Иов 36.8"
                12 -> res = "4 Цар 14.26"
                16 -> res = "Пс 115.7; Ис 45.2; Наум 1.13"
                18 -> res = "Иов 33.20"
                20 -> res = "Прем 16.12"
                22 -> res = "Пс 49.14; 115.8"
                24 -> res = "Сир 43.26"
                25 -> res = "Иона 1.4; Мф 8.24"
                27 -> res = "Ис 29.14; Иез 7.26"
                29 -> res = "Мф 14.32"
                34 -> res = "3 Цар 17.1; Иоил 1.10"
                35 -> res = "Ис 41.18"
                39 -> res = "Пс 43.26"
                40 -> res = "Иов 12.21"
                41 -> res = "1 Цар 2.8"
                42 -> res = "Иов 5.16; 22.19"
                43 -> res = "Втор 32.29; Иер 9.12"
            }
        }
        if (glava == 107) {
            when (stih) {
                2 -> res = "Пс 56.8"
                5 -> res = "Пс 35.6"
                6 -> res = "Пс 56.6"
                7 -> res = "Пс 59.7"
                8 -> res = "Пс 59.8"
                9 -> res = "Пс 59.9"
                11 -> res = "Пс 59.11"
                12 -> res = "Пс 59.12"
                14 -> res = "Пс 59.14"
            }
        }
        if (glava == 108) {
            when (stih) {
                2 -> res = "Мк 14.56"
                4 -> res = "Пс 119.7; Ин 8.40"
                5 -> res = "Пс 34.12; Иер 18.20"
                6 -> res = "Иов 17.8"
                8 -> res = "Ин 17.12; Деян 1.20"
                9 -> res = "Втор 28.32"
                10 -> res = "Иов 20.10"
                11 -> res = "Втор 28.43"
                13 -> res = "Исх 20.5; Иов 18.19; Ис 14.22"
                14 -> res = "Исх 20.5; Иер 18.23"
                15 -> res = "Притч 10.7; Мф 27.25"
                16 -> res = "Иов 24.20; Иак 2.13"
                17 -> res = "Притч 11.27; Прем 1.12"
                23 -> res = "Иов 14.2; Пс 143.4"
                25 -> res = "Пс 21.8; Мф 27.29"
                27 -> res = "Пс 63.10"
                28 -> res = "Мф 5.44; 1 Кор 4.12-13"
                30 -> res = "Пс 21.23"
                31 -> res = "Деян 2.25"
            }
        }
        if (glava == 109) {
            when (stih) {
                1 -> res = "Мф 22.44; Мк 12.36; Лк 20.42; Деян 2.34; 1 Кор 15.25; Евр 1.13"
                4 -> res = "Евр 5.6; 7.17"
                5 -> res = "Пс 2.10"
                7 -> res = "Флп 2.8-9"
            }
        }
        if (glava == 110) {
            when (stih) {
                1 -> res = "Пс 9.2; Евр 10.25"
                2 -> res = "Иов 37.14"
                3 -> res = "Пс 9.9; 47.11; 101.28"
                5 -> res = "Пс 36.19; Лк 1.72"
                6 -> res = "Втор 9.6"
                7 -> res = "Дан 4.34"
                9 -> res = "Лк 1.68; 11.2"
                10 -> res = "Иов 28.28; Притч 1.7; 9.10; Сир 11.16"
            }
        }
        if (glava == 111) {
            when (stih) {
                1 -> res = "Пс 1.1; 127.1"
                2 -> res = "Притч 20.7"
                3 -> res = "Пс 33.10"
                4 -> res = "Исх 10.23; Есф 8.16"
                5 -> res = "Пс 36.26"
                6 -> res = "Притч 10.7"
                7 -> res = "Сир 34.16"
                8 -> res = "Притч 4.23"
                9 -> res = "Пс 36.26; 2 Кор 9.9"
                10 -> res = "Пс 34.16; 36.12"
            }
        }
        if (glava == 112) {
            when (stih) {
                1 -> res = "Пс 134.1"
                2 -> res = "Дан 2.20"
                3 -> res = "Мал 1.11"
                4 -> res = "Пс 96.9"
                5 -> res = "Пс 137.6; Ис 57.15"
                7 -> res = "3 Цар 16.2"
                8 -> res = "1 Цар 16.12"
                9 -> res = "Пс 67.7"
            }
        }
        if (glava == 113) {
            when (stih) {
                1 -> res = "Исх 13.3"
                3 -> res = "Исх 14.21-22; Нав 3.16"
                4 -> res = "Пс 67.17"
                5 -> res = "Наум 1.4"
                8 -> res = "Исх 17.6; Чис 20.11"
                9 -> res = "1 Пар 16.35"
                10 -> res = "Пс 41.4"
                11 -> res = "Втор 33.26"
                12 -> res = "Пс 134.15"
                13 -> res = "Прем 15.15"
                14 -> res = "Пс 134.17"
                16 -> res = "Иер 10.8"
                17 -> res = "Пс 129.5"
                24 -> res = "Втор 10.14"
                25 -> res = "Пс 6.6; Ис 38.18; Вар 2.17"
                26 -> res = "Дан 2.20"
            }
        }
        if (glava == 114) {
            when (stih) {
                2 -> res = "Пс 30.3"
                3 -> res = "2 Цар 22.5"
                5 -> res = "Пс 85.5"
                6 -> res = "Мф 10.16"
                8 -> res = "Пс 55.14"
            }
        }
        if (glava == 115) {
            when (stih) {
                1 -> res = "2 Кор 4.13"
                2 -> res = "Рим 3.4"
                4 -> res = "Пс 22.5"
                5 -> res = "Пс 21.26"
                7 -> res = "Прем 9.5"
                8 -> res = "Пс 49.14; Евр 13.15"
            }
        }
        if (glava == 116) {
            when (stih) {
                1 -> res = "Деян 13.48; Рим 15.11"
                2 -> res = "Пс 99.5"
            }
        }
        if (glava == 117) {
            when (stih) {
                1, 29 -> res = "Пс 135.1"
                5 -> res = "Ис 26.16"
                6 -> res = "Пс 26.1; 55.12; Рим 8.31"
                7 -> res = "Евр 13.6"
                8 -> res = "Пс 61.9; 83.13; 107.13"
                11 -> res = "1 Цар 17.45"
                12 -> res = "Втор 1.44; Ис 7.18"
                14 -> res = "Исх 15.2; Ис 12.2"
                17 -> res = "Ис 53.11; Рим 6.9"
                18 -> res = "Иез 18.21"
                19 -> res = "Ис 26.2; Евр 9.24"
                22 -> res = "Ис 28.16; Мф 21.42; Мк 12.10"
                26 -> res = "Мф 21.9; Мк 11.9; Лк 19.38"
            }
        }
        if (glava == 118) {
            when (stih) {
                2 -> res = "Пс 18.12"
                3 -> res = "1 Ин 5.18"
                4 -> res = "Втор 4.5-6"
                5 -> res = "Лк 1.6"
                6 -> res = "1 Ин 2.3; Гал 6.16"
                9 -> res = "Ин 15.3; 1 Пет 1.22"
                10 -> res = "Ис 63.17"
                11 -> res = "Втор 6.6"
                18 -> res = "Втор 17.19"
                19 -> res = "1 Пар 29.15; Евр 11.13"
                21 -> res = "Втор 11.28"
                23 -> res = "Пс 2.2"
                24 -> res = "Втор 17.19"
                30 -> res = "3 Цар 8.36"
                32 -> res = "Лк 19.6"
                34 -> res = "Неем 9.20"
                36 -> res = "1 Цар 8.3"
                37 -> res = "Мф 18.9"
                39 -> res = "Мф 6.13"
                44 -> res = "Ин 15.10"
                46 -> res = "Рим 1.16"
                50 -> res = "Пс 18.8; Иер 15.16"
                51 -> res = "Втор 17.11"
                55 -> res = "Пс 62.7"
                57 -> res = "Чис 18.20"
                61 -> res = "Кол 2.8"
                62 -> res = "Деян 16.25"
                63 -> res = "Сир 37.15"
                64 -> res = "Пс 32.5"
                67 -> res = "Евр 12.10"
                70 -> res = "Мф 13.15"
                71 -> res = "2 Кор 7.10"
                72 -> res = "Пс 118.127"
                73 -> res = "Иов 10.8"
                75 -> res = "Откр 19.2"
                81 -> res = "Пс 118.166"
                83 -> res = "Иов 30.30"
                86 -> res = "Ин 17.17"
                89 -> res = "Ис 40.8; Мф 24.35"
                92 -> res = "Пс 18.8; Иер 15.16"
                97 -> res = "Втор 17.19"
                99 -> res = "Втор 4.6"
                100 -> res = "Прем 8.10"
                103 -> res = "Пс 18.11"
                104 -> res = "Пс 118.128"
                105 -> res = "2 Пет 1.19"
                106 -> res = "Неем 10.29; Иов 27.5"
                108 -> res = "Пс 18.15"
                110 -> res = "Пс 139.6"
                112 -> res = "3 Цар 8.58"
                115 -> res = "Пс 6.9; 100.4"
                116 -> res = "Пс 24.2"
                118 -> res = "Рим 8.6-7"
                120 -> res = "Лк 12.5; Деян 5.5"
                124 -> res = "Пс 142.2"
                126 -> res = "Еккл 8.11"
                127 -> res = "Пс 18.11"
                128 -> res = "Пс 118.104"
                130 -> res = "Пс 18.9; Мф 11.25"
                132 -> res = "Пс 6.5"
                135 -> res = "Пс 66.2"
                136 -> res = "Иак 4.9"
                137 -> res = "Исх 9.27"
                138 -> res = "Втор 4.5-6"
                139 -> res = "Пс 68.10"
                140 -> res = "2 Цар 22.31; Притч 30.5"
                142 -> res = "Ин 17.17"
                147 -> res = "Пс 5.4; 87.14"
                148 -> res = "Ис 26.9"
                151 -> res = "Ин 17.17"
                152 -> res = "Мф 5.18; 1 Пет 1.25"
                154 -> res = "Пс 36.6"
                155 -> res = "Пс 108.17"
                157 -> res = "Пс 3.1-2"
                158 -> res = "Деян 17.16"
                161 -> res = "Ис 66.2"
                162 -> res = "Ис 9.3"
                163 -> res = "Пс 100.7"
                165 -> res = "Гал 6.16; 1 Ин 2.10"
                166 -> res = "Быт 49.18"
                168 -> res = "Пс 138.3"
                176 -> res = "Ис 53.6; 1 Пет 2.25"
            }
        }
        if (glava == 119) {
            when (stih) {
                1 -> res = "Пс 49.15"
                2 -> res = "1 Цар 26.19"
                3 -> res = "Иак 3.5"
                4 -> res = "Пс 58.8; 64.4; Притч 25.18"
                7 -> res = "Рим 3.17"
            }
        }
        if (glava == 120) {
            when (stih) {
                1 -> res = "2 Пар 20.12"
                2 -> res = "2 Пар 20.17; Пс 123.8"
                4 -> res = "3 Цар 8.52"
                6 -> res = "Прем 18.3; Иона 4.8"
            }
        }
        if (glava == 121) {
            when (stih) {
                3 -> res = "2 Пар 6.6; Иер 31.4"
                5 -> res = "3 Цар 7.7"
                6 -> res = "Зах 4.7; Ис 66.10"
                9 -> res = "Рим 15.2"
            }
        }
        if (glava == 122) {
            when (stih) {
                1 -> res = "Пс 120.1"
                2 -> res = "2 Пар 20.12"
                4 -> res = "Пс 87.4; Евр 11.36"
            }
        }
        if (glava == 123) {
            when (stih) {
                3 -> res = "Притч 1.12"
                4 -> res = "Пс 143.7"
                7 -> res = "Пс 10.2; Притч 6.5"
                8 -> res = "Пс 120.2; Неем 9.6"
            }
        }
        if (glava == 124) {
            when (stih) {
                1 -> res = "Притч 16.20; 28.25; Ис 33.20"
                3 -> res = "Деян 22.30"
                4 -> res = "Пс 7.11; 111.4"
                5 -> res = "Пс 127.6; Гал 6.16"
            }
        }
        if (glava == 125) {
            when (stih) {
                1 -> res = "Ис 26.1; Иер 33.26"
                3 -> res = "Лк 1.49"
                4 -> res = "Иер 29.14; 30.3; 31.23"
                6 -> res = "Ис 66.13; Мф 5.4; Лк 16.25"
            }
        }
        if (glava == 126) {
            when (stih) {
                1 -> res = "Притч 14.11; 1 Кор 3.6"
                2 -> res = "Ин 21.3; Иез 12.19"
                3 -> res = "1 Цар 1.27"
            }
        }
        if (glava == 127) {
            when (stih) {
                1 -> res = "Пс 111.1"
                2 -> res = "Быт 3.19"
                3 -> res = "Пс 143.12"
                4 -> res = "Втор 28.2"
                5 -> res = "Чис 6.24"
                6 -> res = "Пс 124.5"
            }
        }
        if (glava == 128) {
            when (stih) {
                2 -> res = "2 Кор 4.8"
                3 -> res = "Иов 4.8; Ис 51.23"
                4 -> res = "Ис 5.8"
                5 -> res = "Пс 6.11"
                6 -> res = "Пс 36.2; 57.10"
            }
        }
        if (glava == 129) {
            when (stih) {
                1 -> res = "Пс 68.2"
                2 -> res = "Пс 5.2"
                3 -> res = "Пс 142.2"
                4 -> res = "Дан 9.9"
                6 -> res = "Авв 2.3"
                8 -> res = "Ис 43.25; 44.22"
            }
        }
        if (glava == 130) {
            when (stih) {
                1 -> res = "2 Цар 6.22; Притч 16.5"
                2 -> res = "Рим 12.16"
            }
        }
        if (glava == 131) {
            when (stih) {
                1 -> res = "Неем 13.14"
                3 -> res = "2 Цар 7.2-3; 3 Цар 8.17"
                4 -> res = "Притч 6.4"
                5 -> res = "Деян 7.46"
                6 -> res = "1 Цар 7.1"
                7 -> res = "Пс 17.7"
                8 -> res = "2 Пар 6.41"
                10 -> res = "2 Пар 6.42"
                11 -> res = "2 Цар 7.12; 3 Цар 8.25; 2 Пар 6.16; Пс 88.5; Лк 1.55; Деян 2.30"
                13 -> res = "3 Цар 9.3"
                14 -> res = "3 Цар 8.13"
                15 -> res = "Пс 36.19; 110.5"
                17 -> res = "1 Цар 2.10; Мал 3.1; Лк 1.69"
                18 -> res = "Пс 34.26"
            }
        }
        if (glava == 132) {
            when (stih) {
                1 -> res = "Сир 25.2; Мк 9.5"
                2 -> res = "Исх 29.7; Лев 8.12"
                3 -> res = "Втор 3.8; Песн 4.8"
            }
        }
        if (glava == 133) {
            when (stih) {
                1 -> res = "Пс 112.1; 134.2"
                3 -> res = "Чис 6.24; Пс 127.5"
            }
        }
        if (glava == 134) {
            when (stih) {
                1 -> res = "Пс 112.1"
                3 -> res = "Пс 135.1"
                4 -> res = "Втор 7.6; 1 Пет 2.9; Тит 2.14"
                6 -> res = "Пс 113.11; Дан 4.32"
                7 -> res = "Иер 10.13; 14.22"
                8 -> res = "Исх 12.29; Пс 77.51"
                10 -> res = "Чис 21.21 и проч"
                11 -> res = "Нав 12.7"
                15 -> res = "Пс 113.12"
                16 -> res = "Прем 15.15"
                18 -> res = "Ис 42.17"
                21 -> res = "Пс 49.2; 109.2; Ис 2.3"
            }
        }
        if (glava == 135) {
            when (stih) {
                1 -> res = "1 Пар 16.34; 2 Пар 5.13"
                2 -> res = "Втор 10.17"
                4 -> res = "Пс 71.18"
                5 -> res = "Быт 1.7-8; Пс 145.6; Сир 18.1"
                6 -> res = "Быт 1.9-10; Иер 10.12; 51.15"
                7 -> res = "Пс 148.3, 5"
                8 -> res = "Быт 1.16"
                10 -> res = "Исх 12.29"
                11 -> res = "Исх 12.41"
                12 -> res = "Исх 13.3; Втор 4.34"
                13 -> res = "Исх 14.21"
                14 -> res = "Исх 14.22"
                15 -> res = "Исх 14.28"
                19 -> res = "Чис 21.24, 33-35"
                20 -> res = "Нав 12.4"
                25 -> res = "Пс 103.27; 146.9"
            }
        }
        if (glava == 136) {
            when (stih) {
                1 -> res = "Иез 1.1; Ис 30.19"
                5 -> res = "Иер 51.50"
                7 -> res = "Иер 49.7; Иез 25.12; 35.5"
                9 -> res = "Ис 13.16"
            }
        }
        if (glava == 137) {
            when (stih) {
                1 -> res = "Пс 9.2"
                2 -> res = "Пс 114.1"
                4 -> res = "Пс 67.33; Ис 6.3"
                6 -> res = "Пс 112.6"
                7 -> res = "Пс 36.24"
            }
        }
        if (glava == 138) {
            when (stih) {
                1 -> res = "Притч 24.12; Ин 21.17"
                2 -> res = "2 Цар 7.20; Иер 12.3; Втор 31.21"
                3 -> res = "Пс 118.168"
                7 -> res = "Прем 1.7"
                8 -> res = "Ам 9.2"
                9 -> res = "Пс 54.7"
                11 -> res = "Иов 34.22; Иер 23.24; Евр 4.13"
                12 -> res = "Иак 1.17"
                13 -> res = "Иов 10.11"
                14 -> res = "Пс 118.71; Откр 15.3"
                15 -> res = "Еккл 11.5"
                16 -> res = "Сир 23.29; Иов 14.5; Мал 3.16"
                18 -> res = "Быт 22.17"
                19 -> res = "Пс 5.7"
                21 -> res = "Пс 100.3"
                22 -> res = "Рим 12.9"
                23 -> res = "Иов 31.6; Пс 25.2"
                24 -> res = "Пс 26.11; 85.11; 142.8"
            }
        }
        if (glava == 139) {
            when (stih) {
                4 -> res = "Пс 5.10; 57.5; Рим 3.13"
                5 -> res = "2 Цар 22.3"
                6 -> res = "Пс 63.6; 141.4; Иер 18.22"
                9 -> res = "Втор 32.27"
                10 -> res = "Пс 7.15"
                11 -> res = "Пс 10.6"
                12 -> res = "Сир 28.15"
                13 -> res = "Пс 9.19"
            }
        }
        if (glava == 140) {
            when (stih) {
                2 -> res = "Исх 29.39; 30.7-8"
                3 -> res = "Пс 38.2; Сир 22.31"
                4 -> res = "3 Цар 8.58; Притч 1.10, 15"
                5 -> res = "Притч 12.1; 15.12; 25.12"
                9 -> res = "Пс 139.6"
                10 -> res = "Пс 7.16; 9.16"
            }
        }
        if (glava == 141) {
            when (stih) {
                1 -> res = "1 Цар 24.4"
                2 -> res = "Пс 101.1"
                3 -> res = "Пс 139.6; Иер 18.22"
                4 -> res = "Притч 29.10"
                5 -> res = "Пс 15.5; 26.13; 90.2"
                7 -> res = "Пс 142.11"
            }
        }
        if (glava == 142) {
            when (stih) {
                1 -> res = "Пс 5.2; 16.1"
                2 -> res = "Иов 9.2-3; 15.14; 25.4"
                3 -> res = "1 Цар 23.14"
                5 -> res = "Пс 76.6"
                6 -> res = "Пс 27.2"
                7 -> res = "Пс 27.1"
                8 -> res = "Пс 85.11"
                10 -> res = "Неем 9.20"
                11 -> res = "Пс 26.11; 141.7"
            }
        }
        if (glava == 143) {
            when (stih) {
                1 -> res = "2 Цар 22.35"
                2 -> res = "2 Цар 22.47"
                3 -> res = "Иов 7.17; Пс 8.5; Евр 2.6"
                4 -> res = "Иов 8.9; 14.2"
                5 -> res = "2 Цар 22.10"
                7 -> res = "Пс 123.4"
                9 -> res = "Пс 32.2; Ис 5.1; Откр 5.9"
                10 -> res = "Притч 21.31; 1 Мак 3.19"
                12 -> res = "Иез 24.25"
                13 -> res = "Лк 12.16"
                14 -> res = "Лк 14.19"
                15 -> res = "Пс 32.12"
            }
        }
        if (glava == 144) {
            when (stih) {
                1 -> res = "Пс 46.3"
                3 -> res = "Иов 5.9; 36.26"
                4 -> res = "Втор 4.10; 6.7"
                8 -> res = "Исх 34.6; Пс 85.15"
                9 -> res = "Сир 18.12; 2 Пет 3.9; 1 Тим 2.4"
                11 -> res = "Пс 46.9"
                13 -> res = "Пс 145.10; Дан 4.32; 6.26"
                14 -> res = "Пс 36.24"
                15 -> res = "Пс 103.27"
                16 -> res = "Иов 39.2"
                18 -> res = "Втор 4.7"
                19 -> res = "Пс 146.11"
                20 -> res = "1 Цар 2.9"
            }
        }
        if (glava == 145) {
            when (stih) {
                1 -> res = "Пс 102.1"
                3 -> res = "Пс 117.9"
                4 -> res = "Быт 3.19; Еккл 12.7"
                5 -> res = "Пс 33.9"
                6 -> res = "Пс 135.5; Деян 14.15; Откр 14.7"
                7 -> res = "Пс 11.6; 103.27"
                8 -> res = "Лк 18.35"
                9 -> res = "Пс 67.6"
                10 -> res = "Исх 15.18"
            }
        }
        if (glava == 146) {
            when (stih) {
                1 -> res = "Пс 91.2"
                2 -> res = "Пс 50.20; Ис 60.10"
                3 -> res = "Ис 61.1"
                4 -> res = "Ис 40.26"
                5 -> res = "Пс 144.3; Ис 40.28"
                6 -> res = "Пс 145.8"
                8 -> res = "Деян 14.17"
                9 -> res = "Иов 38.41; Пс 103.14; Мф 6.26"
                11 -> res = "Деян 10.35"
            }
        }
        if (glava == 147) {
            when (stih) {
                3 -> res = "Втор 32.14"
                5 -> res = "Сир 43.19"
                7 -> res = "Пс 32.9"
                8 -> res = "Деян 13.17"
                9 -> res = "Втор 29.29; 33.4; Рим 2.3"
            }
        }
        if (glava == 148) {
            when (stih) {
                1 -> res = "Откр 5.13"
                2 -> res = "Лк 2.13"
                4 -> res = "Быт 1.7; Пс 101.1"
                5 -> res = "Быт 1.6-7; Пс 135.5; Иер 10.12; 51.15"
                8 -> res = "Иов 37.10"
                11 -> res = "Пс 48.3"
                13 -> res = "Ис 12.4"
                14 -> res = "Пс 131.17"
            }
        }
        if (glava == 149) {
            when (stih) {
                1 -> res = "Пс 32.3"
                2 -> res = "Пс 92.1; Мих 2.13"
                4 -> res = "Пс 146.11"
                5 -> res = "Пс 41.9"
                6 -> res = "2 Кор 10.4"
                7 -> res = "Мих 4.3; 5.15"
                9 -> res = "Втор 4.6; 32.35"
            }
        }
        if (glava == 150) {
            when (stih) {
                1 -> res = "Пс 105.1"
                3 -> res = "Пс 46.2"
                4 -> res = "Пс 149.3"
                6 -> res = "Откр 5.13"
            }
        }
        return res
    }

    fun kniga23(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "3 Цар 4.32"
                5 -> res = "Сир 10.28"
                7 -> res = "Иов 28.28; Пс 110.10; Еккл 12.13; Сир 1.15"
                9 -> res = "Притч 4.9; Сир 6.32"
                10 -> res = "Притч 4.14"
                11 -> res = "Иер 5.26; Мих 7.2"
                12 -> res = "Пс 123.3"
                15 -> res = "Пс 1.1"
                16 -> res = "Ис 59.7; Рим 3.15"
                18 -> res = "Мф 26.16"
                20 -> res = "Притч 8.1-2; Лк 11.49"
                21 -> res = "Притч 8.3"
                24 -> res = "Ис 65.12; 66.4; Иер 7.13"
                26 -> res = "Втор 28.63; Иез 21.17"
                28 -> res = "Ис 1.15; Иер 11.11"
                29 -> res = "Притч 1.24; Деян 13.40"
                31 -> res = "Ис 3.10"
                33 -> res = "Пс 111.7"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Лк 8.18"
                4 -> res = "Мф 13.44-46"
                6 -> res = "3 Цар 3.9, 12; Иов 32.8; Прем 7.15; Кол 2.3"
                7 -> res = "Пс 83.12"
                13 -> res = "Иов 23.14; Ин 3.19"
                21 -> res = "Пс 36.9; Мф 5.5"
                22 -> res = "Иов 18.17"
            }
        }
        if (glava == 3) {
            when (stih) {
                2 -> res = "Втор 8.1; 30.16"
                4 -> res = "Рим 12.17"
                5 -> res = "Иер 9.23; 4 Цар 18.5"
                7 -> res = "Рим 12.16; Еккл 7.17"
                9 -> res = "Тов 4.7; Сир 4.1; Лк 14.13"
                11 -> res = "Иов 5.17; Евр 12.5; Откр 3.19"
                14 -> res = "Иов 28.15; Притч 8.11"
                16 -> res = "Притч 4.10; 9.11"
                18 -> res = "Притч 11.30; 15.4"
                19 -> res = "Пс 32.6"
                23 -> res = "Пс 36.24"
                24 -> res = "Пс 3.6; 4.9"
                25 -> res = "Пс 111.7"
                27 -> res = "Сир 4.2"
                28 -> res = "1 Пет 4.10; 2 Кор 8.12"
                31 -> res = "Пс 36.1; 72.3"
                33 -> res = "Втор 28.15; Мал 2.2"
                34 -> res = "Иак 4.6; 1 Пет 5.5"
            }
        }
        if (glava == 4) {
            when (stih) {
                4 -> res = "1 Пар 28.9"
                7 -> res = "Прем 6.18"
                8 -> res = "Дан 2.46"
                9 -> res = "Притч 1.9"
                10 -> res = "Притч 3.2"
                14 -> res = "Пс 1.1; Притч 1.10"
                16 -> res = "Есф 6.4; Пс 35.5; Мих 2.1"
                17 -> res = "Притч 1.13 "
                18 -> res = "Пс 96.11; Мф 5.16"
                19 -> res = "Втор 28.29; Ис 59.10"
                22 -> res = "Пс 18.8"
                23 -> res = "Мф 6.1; Евр 13.9"
                25 -> res = "Иов 31.1; Сир 9.7"
                26 -> res = "Евр 12.13"
                27 -> res = "Втор 5.32"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Притч 4.20"
                5 -> res = "Притч 7.27; Мф 14.6"
                8 -> res = "Притч 7.25"
                9 -> res = "Притч 6.33"
                10 -> res = "Притч 29.3; Сир 9.6"
                11 -> res = "Лк 15.14"
                15 -> res = "Притч 9.17"
                18 -> res = "Еккл 9.9"
                20 -> res = "Сир 9.10"
                21 -> res = "Иов 34.24; Иер 16.17"
                22 -> res = "Пс 7.17; Ис 5.18"
                23 -> res = "Иез 33.11"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Сир 29.18"
                3 -> res = "Сир 29.21"
                4 -> res = "Пс 131.4"
                5 -> res = "Пс 123.7"
                9 -> res = "Притч 26.14"
                10 -> res = "Притч 24.33"
                13 -> res = "Притч 10.10"
                14 -> res = "Притч 17.20"
                15 -> res = "Пс 57.9"
                17 -> res = "Притч 30.13"
                19 -> res = "Притч 19.5"
                20 -> res = "Притч 1.8"
                21 -> res = "Втор 6.8"
                22 -> res = "Притч 3.23"
                23 -> res = "Пс 118.105; 2 Пет 1.19"
                24 -> res = "Притч 7.5"
                25 -> res = "Сир 9.8"
                26 -> res = "Притч 5.10"
                29 -> res = "Евр 13.4"
                31 -> res = "Исх 22.1"
                32 -> res = "Лев 20.10"
            }
        }
        if (glava == 7) {
            when (stih) {
                2 -> res = "Лев 18.5"
                3 -> res = "Втор 6.8"
                4 -> res = "Прем 8.2"
                5 -> res = "Притч 6.24"
                23 -> res = "Притч 1.17"
                25 -> res = "Иов 31.9"
                27 -> res = "Притч 5.5"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Сир 24.1; Мф 11.19; 1 Кор 1.24"
                5 -> res = "Пс 91.7"
                6 -> res = "Мф 7.29"
                7 -> res = "Ин 8.46"
                8 -> res = "Пс 11.7"
                10 -> res = "Иов 28.15; Притч 3.14; Прем 7.9"
                11 -> res = "Иов 28.16"
                12 -> res = "Лк 11.49"
                13 -> res = "Сир 1.18, 25"
                15 -> res = "Быт 49.10; Дан 2.21; Рим 13.1"
                18 -> res = "Притч 3.16"
                19 -> res = "Иов 28.17; Прем 7.9"
                22 -> res = "Прем 9.9; Сир 24.10; Ин 1.1"
                25 -> res = "Пс 89.3; 109.3"
                28 -> res = "Иов 26.8; 36.29"
                29 -> res = "Иов 38.10"
                30 -> res = "Ин 5.20"
                31 -> res = "Ин 1.10"
                32 -> res = "Пс 118.1-2; Лк 11.28"
                34 -> res = "Сир 14.24; Мк 3.20"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "1 Тим 3.15; Евр 3.6; Откр 3.12"
                3 -> res = "Лк 14.16"
                4 -> res = "Мф 11.25; 1 Кор 1.27"
                5 -> res = "Ин 6.48; Ис 55.1"
                6 -> res = "Тит 2.12"
                8 -> res = "Притч 15.12; Мф 7.6"
                9 -> res = "Притч 27.6"
                10 -> res = "Притч 1.7"
                11 -> res = "Притч 10.27"
                17 -> res = "Притч 20.17; Сир 23.23"
                18 -> res = "Притч 7.27"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Притч 15.20"
                2 -> res = "Притч 11.4; Иов 20.20 "
                3 -> res = "Пс 32.19; Ис 49.26"
                4 -> res = "Притч 21.5"
                7 -> res = "Пс 111.6; Сир 44.13; Мф 26.13"
                8 -> res = "Пс 140.5; Иак 3.17"
                10 -> res = "Притч 6.13; Сир 27.24"
                12 -> res = "1 Пет 4.8; 1 Кор 3.4"
                15 -> res = "Притч 18.11"
                17 -> res = "Притч 12.1"
                19 -> res = "Еккл 10.14; Сир 20.7 "
                21 -> res = "Мф 12.35"
                25 -> res = "Пс 36.36"
                28 -> res = "Иов 8.13; Пс 111.10"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Втор 25.13"
                4 -> res = "Притч 10.2; Сир 5.10; Иез 7.19; Соф 1.18"
                6 -> res = "Прем 5.15"
                8 -> res = "Есф 7.9; Пс 33.20"
                10 -> res = "Притч 28.12"
                11 -> res = "Быт 18.32; Сир 16.5"
                13 -> res = "Притч 20.19; Сир 27.17"
                14 -> res = "Притч 15.22; Прем 6.26"
                18 -> res = "Гал 6.8"
                20 -> res = "Пс 5.7; 118.1"
                21 -> res = "Притч 16.5"
                23 -> res = "Пс 111.10"
                24 -> res = "2 Кор 9.6"
                28 -> res = "Иов 31.25; Мф 19.23; 1 Тим 6.17"
                30 -> res = "Притч 3.18"
                31 -> res = "1 Пет 4.18"
            }
        }
        if (glava == 12) {
            when (stih) {
                1, 15 -> res = "Притч 10.17"
                3 -> res = "Притч 10.25; Ис 37.31; Иер 17.8"
                6 -> res = "Притч 1.11"
                10 -> res = "Втор 22.6; 25.4"
                11 -> res = "Притч 28.19; Сир 20.28"
                13 -> res = "Притч 18.7"
                14 -> res = "Пс 61.13"
                16 -> res = "Еккл 7.9"
                17 -> res = "Притч 14.5"
                18 -> res = "Пс 58.8; 63.4"
                22 -> res = "Пс 5.7"
                23 -> res = "Притч 13.17"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Притч 15.12"
                2 -> res = "Притч 12.14"
                3 -> res = "Притч 18.21; 1 Пет 3.10"
                4 -> res = "Притч 21.25"
                5 -> res = "Пс 118.163"
                7 -> res = "Притч 12.9"
                8 -> res = "Притч 10.15"
                9 -> res = "Притч 24.20; Пс 36.21"
                11 -> res = "Притч 28.8"
                13 -> res = "Притч 1.24; Ос 4.6"
                15 -> res = "Притч 10.11"
                21 -> res = "Сир 6.35; 37.15"
                23 -> res = "Иов 27.17"
                25 -> res = "Притч 23.13; Сир 30.1"
                26 -> res = "Ис 65.13; Сир 37.32"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Притч 12.4; 24.3"
                2 -> res = "Иов 12.24"
                3 -> res = "Иак 3.5; Притч 12.6"
                5 -> res = "Исх 23.1; Притч 12.17"
                6 -> res = "Сир 1.30"
                8 -> res = "Пс 138.24"
                11 -> res = "Притч 12.7"
                12 -> res = "Притч 16.25"
                14 -> res = "Ис 3.10-11"
                15 -> res = "Рим 16.18; 1 Ин 4.1"
                16 -> res = "Пс 110.10"
                17 -> res = "Притч 12.16"
                18 -> res = "Еф 5.15"
                19 -> res = "Ис 60.14"
                20 -> res = "Притч 19.7"
                21 -> res = "Пс 40.2; Мф 5.7"
                23 -> res = "Притч 12.11"
                24 -> res = "Притч 10.16; 27.22"
                25 -> res = "Притч 12.17"
                26 -> res = "Притч 18.11"
                27 -> res = "Притч 10.17, 27; 2 Цар 22.6"
                29 -> res = "Притч 19.11"
                31 -> res = "Притч 17.5; Мф 25.36"
                32 -> res = "Иов 21.17; Пс 72.18; 111.8"
                34 -> res = "Притч 11.11; Прем 5.24"
                35 -> res = "Лк 7.2; Рим 13.3"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "1 Цар 25.24, 35; Притч 15.28"
                2 -> res = "Притч 12.23"
                3 -> res = "Пс 32.14; Евр 4.13"
                4 -> res = "Притч 3.18; 11.30; 12.18"
                6 -> res = "Пс 111.3; Иов 20.22"
                8 -> res = "Притч 21.27; Сир 34.19; Ис 1.11; Иер 6.20; Ам 5.21"
                9 -> res = "Пс 5.7"
                11 -> res = "Иов 26.6; Пс 7.10"
                13 -> res = "Притч 17.22; Сир 38.18"
                15 -> res = "Еккл 3.12"
                16 -> res = "Пс 36.16"
                17 -> res = "Притч 17.1"
                18 -> res = "Притч 26.21"
                19 -> res = "1 Ин 2.10"
                20 -> res = "Притч 10.1; 17.25; 19.13, 26"
                22 -> res = "Притч 11.14; 20.18"
                25 -> res = "Есф 7.9; Притч 2.22; 12.7"
                27 -> res = "1 Тим 6.9; Исх 23.8"
                29 -> res = "Пс 10.5; Ис 1.15; Иак 5.16"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Иер 10.23"
                3 -> res = "Пс 36.5; 1 Пет 5.7"
                4 -> res = "Иов 21.30; Рим 11.36"
                5 -> res = "Притч 8.13"
                6 -> res = "Неем 5.15"
                7 -> res = "Сир 6.17; 1 Пет 3.13"
                10 -> res = "3 Цар 3.27"
                11 -> res = "Притч 11.1; 20.10, 23"
                12 -> res = "Притч 20.28; 25.5"
                14 -> res = "Есф 7.7; Притч 20.2"
                16 -> res = "Иов 28.15"
                18 -> res = "Есф 3.1; Притч 18.13; Дан 4.27"
                20 -> res = "Пс 33.9; Ис 30.18; Иер 17.7"
                25 -> res = "Притч 14.12 "
                27 -> res = "Пс 7.16; Иак 3.6"
                28 -> res = "Притч 15.18"
                30 -> res = "Притч 6.13; 10.10"
                31 -> res = "Притч 20.29; Тит 2.2"
                32 -> res = "Притч 19.11"
                33 -> res = "Нав 7.14"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Притч 15.17"
                2 -> res = "Сир 10.28"
                3 -> res = "Притч 27.21; Сир 2.5; Иер 17.10"
                5 -> res = "Притч 14.31"
                6 -> res = "Пс 127.6; 2 Тим 1.5"
                9 -> res = "Притч 10.12; Сир 6.5"
                13 -> res = "Втор 32.35; 1 Пет 3.9; Рим 12.17, 19; 1 Фес 5.15"
                15 -> res = "Притч 24.24; Ис 5.23"
                17 -> res = "Притч 18.25; Сир 12.8-9"
                18 -> res = "Притч 6.1; 11.15"
                20 -> res = "Притч 6.14"
                21, 25 -> res = "Притч 15.20"
                22 -> res = "Притч 15.13"
                23 -> res = "Притч 21.14"
                24 -> res = "Еккл 2.14; 8.1"
                27 -> res = "Иак 1.19"
            }
        }
        if (glava == 18) {
            when (stih) {
                4 -> res = "Притч 20.5"
                5 -> res = "Лев 19.15; Втор 1.17; Притч 24.23; Сир 42.1"
                7 -> res = "Притч 10.14; 12.13"
                11 -> res = "Пс 19.2; Притч 14.26"
                12 -> res = "Притч 10.15"
                13 -> res = "Притч 16.18"
                14 -> res = "Сир 11.8"
                17 -> res = "Притч 17.8; Мф 2.11"
                21 -> res = "Притч 14.14; Ис 3.10"
                22 -> res = "Притч 13.3; Иак 3.8-10"
                23 -> res = "Притч 19.14"
                24 -> res = "Сир 13.4"
                25 -> res = "Притч 17.17"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "Притч 28.6"
                2 -> res = "Притч 6.18"
                3 -> res = "Сир 15.11; Иак 1.13"
                4 -> res = "Притч 14.20"
                5 -> res = "Втор 19.19; Дан 13.51, 62"
                9 -> res = "Притч 21.28"
                10 -> res = "Притч 30.21-22"
                11 -> res = "Притч 14.29"
                12 -> res = "Есф 7.9; Рим 13.4"
                13 -> res = "Притч 10.1"
                14 -> res = "Притч 18.23"
                16 -> res = "Притч 3.21-22; Лк 11.28"
                17 -> res = "Пс 40.2; Мф 10.42; 25.40"
                18 -> res = "Притч 13.25; 23.13"
                21 -> res = "Иов 23.13; Притч 16.1"
                24 -> res = "Притч 26.15"
                25 -> res = "Притч 21.11"
                26 -> res = "Притч 15.20"
                28 -> res = "Иов 15.16"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "Ис 28.7; Еф 5.18"
                2 -> res = "Притч 19.12"
                5 -> res = "Притч 18.4"
                6 -> res = "Мф 6.2; Лк 18.8"
                7 -> res = "Втор 7.13"
                9 -> res = "3 Цар 8.46; 2 Пар 6.36; Иов 14.4; Пс 50.7; Сир 7.5; 1 Ин 1.8"
                10 -> res = "Притч 11.1"
                12 -> res = "Исх 4.11; Пс 93.9"
                16 -> res = "Притч 27.13"
                19 -> res = "Притч 11.13"
                20 -> res = "Исх 21.17; Лев 20.9; Мф 15.4; Мк 7.10"
                22 -> res = "Притч 17.13"
                24 -> res = "Пс 36.23"
                25 -> res = "Деян 5.4"
                26 -> res = "Притч 20.8"
                28 -> res = "Притч 16.12"
                29 -> res = "Притч 16.31"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "2 Пар 36.22"
                2 -> res = "Притч 16.2"
                3 -> res = "Ос 6.6"
                5 -> res = "Притч 10.4"
                9 -> res = "Притч 25.24"
                11 -> res = "Притч 19.25"
                13 -> res = "Притч 3.27-28"
                14 -> res = "1 Цар 25.18"
                17 -> res = "Притч 23.21"
                19 -> res = "Притч 25.24; Сир 25.21"
                21 -> res = "Притч 19.17"
                22 -> res = "Еккл 9.16"
                26 -> res = "Пс 36.26"
                27 -> res = "Притч 15.8"
                28 -> res = "Притч 19.5, 9"
                30 -> res = "Иез 28.5; Иов 5.13"
                31 -> res = "Пс 32.17"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "Еккл 7.1-2"
                2 -> res = "Притч 29.13"
                3 -> res = "Притч 27.12"
                5 -> res = "Нав 23.13"
                7 -> res = "Иак 2.6"
                8 -> res = "Иов 4.8; Ос 10.12"
                9 -> res = "2 Кор 9.7"
                13 -> res = "Притч 26.13"
                20 -> res = "Притч 3.5-6"
                22 -> res = "Втор 24.17; Иов 31.13"
                23 -> res = "Притч 23.11"
                24 -> res = "Притч 15.18; 29.22"
                25 -> res = "Притч 12.13"
                26 -> res = "Притч 6.1"
                27 -> res = "Притч 20.16"
                28 -> res = "Втор 19.14; Притч 23.10"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "Сир 31.13"
                4 -> res = "1 Тим 6.6, 9"
                6 -> res = "Сир 14.10"
                9 -> res = "Притч 9.8"
                10 -> res = "Притч 22.28"
                11 -> res = "Притч 22.23"
                13 -> res = "Притч 13.25"
                15 -> res = "Притч 27.11"
                17 -> res = "Пс 36.1; Притч 24.1"
                20 -> res = "Рим 13.13; Еф 5.18"
                21 -> res = "Притч 21.17"
                22 -> res = "Притч 1.8"
                24 -> res = "Притч 10.1; 15.20"
                26 -> res = "Мф 15.19; Мк 7.6"
                27 -> res = "Сир 19.2"
                30 -> res = "Ис 5.11"
                33 -> res = "Еф 5.18; 1 Ин 2.16"
                35 -> res = "Ис 56.12"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "Пс 36.1; Притч 23.17"
                2 -> res = "Пс 9.28"
                6 -> res = "Притч 20.18"
                7 -> res = "Притч 14.6"
                11 -> res = "Пс 81.4"
                12 -> res = "Иов 34.11; Пс 61.13; Иер 32.19; Рим 2.6; Откр 22.12"
                15 -> res = "Притч 1.11"
                16 -> res = "Пс 36.24; Ам 5.2"
                17 -> res = "Иов 31.29"
                19 -> res = "Пс 36.1"
                20 -> res = "Притч 13.9"
                21 -> res = "Мф 22.21; 1 Пет 2.17; Рим 13.2"
                23 -> res = "Притч 18.5"
                24 -> res = "Ис 5.23"
                29 -> res = "Притч 17.13"
                31 -> res = "Притч 15.19"
                33 -> res = "Притч 6.10"
                34 -> res = "Притч 28.19"
            }
        }
        if (glava == 25) {
            when (stih) {
                2 -> res = "Втор 29.29; Рим 11.33"
                3 -> res = "Притч 20.5"
                5 -> res = "Притч 20.8"
                7 -> res = "Лк 14.9-10"
                9 -> res = "Сир 19.10"
                14 -> res = "Иак 2.16"
                15 -> res = "Притч 15.1"
                16 -> res = "Притч 24.13"
                18 -> res = "Пс 58.8"
                22 -> res = "Рим 12.20; 1 Цар 24.20"
                24 -> res = "Притч 21.9"
                25 -> res = "Притч 15.30"
                27 -> res = "Притч 25.16; Сир 3.21; Рим 12.3"
            }
        }
        if (glava == 26) {
            when (stih) {
                3 -> res = "Пс 31.9-10"
                4 -> res = "Мф 21.27"
                11 -> res = "2 Пет 2.22"
                12 -> res = "Ис 5.21; Рим 12.16"
                13 -> res = "Притч 22.13"
                15 -> res = "Притч 19.24"
                16 -> res = "Лк 19.21"
                21 -> res = "Сир 28.11, 13"
                22 -> res = "Пс 54.22"
                24 -> res = "Деян 16.17"
                25 -> res = "1 Цар 26.25"
                27 -> res = "Пс 7.16; Еккл 10.8; Сир 27.28"
            }
        }
        if (glava == 27) {
            when (stih) {
                1 -> res = "Иак 4.13-14"
                2 -> res = "2 Кор 10.12"
                3 -> res = "Сир 22.15-16"
                4 -> res = "Иак 1.20"
                5 -> res = "Притч 28.23"
                6 -> res = "Пс 140.5"
                10 -> res = "Притч 18.20"
                11 -> res = "Притч 23.15"
                12 -> res = "Притч 22.3"
                13 -> res = "Притч 20.16"
                15 -> res = "Сир 25.24"
                17 -> res = "Евр 10.24"
                20 -> res = "Сир 14.9"
                21 -> res = "Притч 17.3"
                22 -> res = "Мк 3.4"
                24 -> res = "1 Тим 6.7"
            }
        }
        if (glava == 28) {
            when (stih) {
                1 -> res = "Лев 26.36; Втор 28.25"
                2 -> res = "Притч 29.8"
                4 -> res = "Ис 5.20"
                5 -> res = "Сир 21.7"
                6 -> res = "Притч 19.1"
                7 -> res = "Притч 29.3"
                8 -> res = "Иов 27.16-17"
                9 -> res = "Иов 27.8-9"
                10 -> res = "Притч 26.27"
                12 -> res = "Притч 29.2"
                13 -> res = "Пс 31.5; 1 Ин 1.9"
                14 -> res = "Иов 3.25; Рим 11.20"
                19 -> res = "Притч 12.11; Сир 20.28"
                20 -> res = "Притч 20.21"
                21 -> res = "Притч 18.5; 24.23"
                22 -> res = "1 Тим 6.9"
                24 -> res = "Мф 15.5"
                25 -> res = "Притч 13.10"
                27 -> res = "Втор 15.7; 2 Кор 9.9"
            }
        }
        if (glava == 29) {
            when (stih) {
                1 -> res = "Притч 28.14"
                2 -> res = "Исх 2.23"
                3 -> res = "Притч 10.1; Лк 15.13"
                6 -> res = "Пс 9.17"
                7 -> res = "Притч 28.5"
                8 -> res = "Притч 11.11; Еккл 9.18"
                11 -> res = "Притч 15.1-2"
                12 -> res = "Сир 10.2"
                14 -> res = "Притч 16.12; 20.28; 25.5"
                15 -> res = "Притч 10.1"
                16 -> res = "Пс 36.36"
                17 -> res = "Притч 23.13"
                20 -> res = "Еккл 5.1; Иак 1.19; Притч 26.12"
                21 -> res = "Сир 33.26"
                22 -> res = "Притч 15.18"
                23 -> res = "Иов 22.29; Притч 15.33; Мф 23.12"
                24 -> res = "Лев 5.1"
                25 -> res = "Мф 14.5; Притч 16.20; Иер 17.7"
                26 -> res = "Притч 19.6"
                27 -> res = "Ин 15.19"
            }
        }
        if (glava == 30) {
            when (stih) {
                2 -> res = "1 Кор 15.9; Иак 1.10"
                4 -> res = "Иов 38.4-5"
                5 -> res = "Пс 11.7"
                6 -> res = "Втор 4.2; 12.32"
                8 -> res = "Евр 13.5; Мф 6.11; 1 Тим 6.8"
                9 -> res = "Втор 8.12-14"
                12 -> res = "Ис 65.5"
                13 -> res = "Притч 6.17"
                14 -> res = "Пс 54.22; Притч 12.18; Иер 9.8"
                17 -> res = "Притч 20.20"
                25 -> res = "Притч 6.6"
                30 -> res = "Дан 7.4; Откр 5.5"
                31 -> res = "Еккл 8.4"
                33 -> res = "Притч 15.18"
            }
        }
        if (glava == 31) {
            when (stih) {
                3 -> res = "Втор 17.17"
                5 -> res = "Есф 3.15; Ис 5.22"
                6 -> res = "Неем 8.10"
                8 -> res = "Притч 24.11"
                9 -> res = "Лев 19.15; Втор 1.16"
                10 -> res = "Притч 12.4; 18.23"
                11 -> res = "Притч 14.1"
                12 -> res = "Сир 26.2"
                21 -> res = "Еккл 10.18"
                23 -> res = "Сир 40.19"
                25 -> res = "1 Пет 3.4"
                26 -> res = "Тит 2.3"
                30 -> res = "Притч 11.22"
                31 -> res = "Мк 14.9"
            }
        }
        return res
    }

    fun kniga24(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "3 Цар 2.12; Притч 1.1"
                2 -> res = "Еккл 12.8; 2 Кор 4.18"
                3 -> res = "Еккл 2.22"
                7 -> res = "Сир 40.11"
                8 -> res = "Притч 27.20"
                16 -> res = "3 Цар 3.12"
                17 -> res = "Еккл 7.25"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Еккл 8.15"
                3 -> res = "Ос 4.11"
                4 -> res = "3 Цар 7.1"
                8 -> res = "3 Цар 9.28; 10.14, 21-22, 27"
                9 -> res = "3 Цар 10.23"
                11 -> res = "Еккл 1.14"
                14 -> res = "Притч 17.24"
                24 -> res = "Еккл 3.12-13"
                26 -> res = "Иов 27.16-17; 32.8; Прем 1.4"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Лк 9.21; 1 Кор 6.12"
                4 -> res = "Иер 31.4"
                7 -> res = "Сир 20.6; Лк 9.21"
                11 -> res = "Прем 9.16"
                12 -> res = "Еккл 2.24; 8.15"
                13 -> res = "Еккл 5.18"
                14 -> res = "Дан 4.32; Сир 39.21"
                15 -> res = "Еккл 1.9"
                17 -> res = "Еккл 12.14"
                19 -> res = "Пс 48.13; 1 Пет 3.12"
                20 -> res = "Быт 3.19; Пс 145.4; Еккл 12.7"
                22 -> res = "Еккл 3.12; 5.18"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Еккл 3.16; Сир 35.18"
                4 -> res = "Деян 7.9, 28"
                5 -> res = "Притч 6.10; 24.33"
                6 -> res = "Притч 17.1"
                8 -> res = "Пс 38.7; 1 Ин 2.16"
                9 -> res = "Быт 2.18; Суд 7.10"
                13 -> res = "Еккл 2.13"
                14 -> res = "Быт 41.40"
                16 -> res = "Еккл 1.14"
                17 -> res = "Деян 7.33; 1 Цар 15.22; Ос 6.6"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Иак 1.19; Притч 10.19; Мф 6.7; Сир 7.14"
                3 -> res = "Втор 23.21"
                4 -> res = "Деян 5.4"
                6 -> res = "Сир 34.2"
                7 -> res = "Прем 6.5; Еф 6.9"
                10 -> res = "1 Ин 2.16"
                12 -> res = "Иов 20.20"
                13 -> res = "Мк 8.36"
                14 -> res = "Иов 1.21; 1 Тим 6.7"
                17 -> res = "Еккл 2.24"
                19 -> res = "Флп 4.6"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Пс 48.11; Сир 14.4"
                7 -> res = "Иов 5.7"
                10 -> res = "Иов 9.2-3"
                12 -> res = "Пс 143.4; Еккл 8.7"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Притч 22.1"
                2 -> res = "Иак 4.9"
                3 -> res = "2 Кор 7.10"
                5 -> res = "Притч 15.31"
                9 -> res = "Притч 14.17"
                12 -> res = "Сир 41.29"
                13 -> res = "Еккл 1.15"
                14 -> res = "Иов 2.10"
                16 -> res = "Сир 7.5; Ис 5.21; Рим 11.20"
                17 -> res = "Иов 15.32"
                19 -> res = "Еккл 9.16"
                20 -> res = "3 Цар 8.46; 2 Пар 6.36; Притч 20.9; Иак 3.2; 1 Ин 1.8; Рим 7.14"
                24 -> res = "Рим 11.33"
                25 -> res = "Еккл 1.17; Ин 10.8"
                26 -> res = "Притч 5.4; 22.4-5"
                28 -> res = "Рим 5.15; 7.4"
                29 -> res = "Быт 1.27; 3.2"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Притч 17.24"
                2 -> res = "Притч 24.21"
                4 -> res = "Дан 4.32"
                5 -> res = "Рим 13.3"
                6 -> res = "Еккл 3.1"
                7 -> res = "Еккл 6.12"
                8 -> res = "Иов 14.5; Пс 38.6"
                10 -> res = "Лев 21.4; Пс 48.18"
                11 -> res = "Пс 70.5-6"
                13 -> res = "Пс 143.4"
                14 -> res = "1 Кор 4.13; 2 Кор 6.8"
                15 -> res = "Еккл 2.24; 3.12; Деян 14.17; 1 Кор 10.31; Флп 4.11-12"
                16 -> res = "Еккл 1.17"
            }
        }
        if (glava == 9) {
            when (stih) {
                2 -> res = "Деян 7.11; 27.1, 20"
                3 -> res = "Еккл 8.11"
                5 -> res = "Иов 14.21"
                8 -> res = "Мф 6.17; 25.4"
                9 -> res = "Притч 5.18; 1 Пет 3.7"
                11 -> res = "Лк 12.25; Еккл 3.1"
                12 -> res = "Лк 12.39; 21.35; Еф 6.13"
                15 -> res = "Притч 29.8"
                16 -> res = "Притч 21.22; 24.5"
                18 -> res = "Нав 7.25"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "1 Кор 3.18"
                4 -> res = "Пс 37.2"
                8 -> res = "Пс 7.16; 56.7; Притч 26.27; Сир 27.28"
                14 -> res = "Еккл 8.7"
                16 -> res = "Ис 3.4"
                20 -> res = "Исх 22.28"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Лк 6.38; 12.17, 33"
                2 -> res = "Лк 16.9"
                5 -> res = "Ин 3.8"
                6 -> res = "Рим 12.11"
                8 -> res = "Иов 10.21"
                9 -> res = "2 Тим 2.22"
            }
        }
        if (glava == 12) {
            when (stih) {
                2 -> res = "Быт 48.10"
                4 -> res = "2 Цар 19.35"
                5 -> res = "Иов 1.21"
                7 -> res = "Пс 145.4"
                8 -> res = "Еккл 1.2"
                9 -> res = "3 Цар 4.32"
                13 -> res = "1 Тим 1.5; Втор 6.2"
                14 -> res = "2 Кор 5.10"
            }
        }
        return res
    }

    fun kniga25(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Еф 5.32; Песн 4.10"
                2 -> res = "Пс 44.8"
                3 -> res = "Пс 44.9"
                4 -> res = "Пс 44.14; 119.5"
                5 -> res = "Откр 7.16"
                6 -> res = "Песн 3.1; Ин 1.41; Песн 5.9"
                8 -> res = "3 Цар 10.28; Песн 2.2; Ин 15.14"
                9 -> res = "Иез 16.11"
                13 -> res = "Ин 15.1; 1 Цар 24.1"
                14 -> res = "Песн 4.1"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Ис 53.2; Иер 33.15"
                3 -> res = "Пс 90.1; Откр 2.7; 22.2"
                4 -> res = "Пс 35.9"
                6 -> res = "Песн 8.3"
                7 -> res = "Песн 3.5; 8.4"
                8 -> res = "Ин 10.19"
                13 -> res = "Лк 21.30"
                14 -> res = "Песн 1.14; 6.9; 8.13; Мф 10.16"
                15 -> res = "Иез 13.4; Лк 13.32"
                16 -> res = "Песн 6.2; 7.11"
                17 -> res = "Песн 4.6"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Ис 55.6"
                2 -> res = "Песн 5.6"
                3 -> res = "Ис 62.6; Иез 3.17; Евр 13.7"
                4 -> res = "Мф 7.7; Ин 20.20; Гал 4.26"
                5 -> res = "Песн 2.7"
                6 -> res = "Песн 8.5"
                8 -> res = "Пс 90.5"
                11 -> res = "Мф 22.2"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Песн 1.15; 6.3"
                4 -> res = "Песн 7.4; Мих 4.8"
                5 -> res = "Песн 7.3"
                6 -> res = "Песн 2.17"
                7 -> res = "Еф 5.27"
                8 -> res = "Ис 49.18; 61.10"
                10 -> res = "Песн 1.1"
                11 -> res = "Мф 12.34; 1 Пет 2.2; Ис 52.1Мф 12.34; 1 Пет 2.2; Ис 52.1"
                12 -> res = "Ис 58.11"
                15 -> res = "Ин 7.38"
                16 -> res = "Лк 19.5; Ин 16.8; Деян 2.2"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Пс 35.9; Ис 25.6"
                2 -> res = "Песн 2.10"
                6 -> res = "Песн 3.1"
                7 -> res = "Пс 68.27"
                8 -> res = "Песн 2.7"
                10 -> res = "Ис 63.1"
                12 -> res = "Песн 4.1"
                13 -> res = "Пс 44.3"
                15 -> res = "Откр 10.1"
                16 -> res = "Лк 4.22"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Песн 5.9"
                3 -> res = "Песн 2.16"
                4 -> res = "Иез 16.14; 2 Кор 10.4; Еф 6.10"
                6 -> res = "Песн 4.2"
                7 -> res = "Песн 4.3"
                8 -> res = "2 Кор 11.2"
                9 -> res = "Песн 2.14; 1 Кор 6.17; Еф 4.5; 5.26"
                10 -> res = "Песн 3.6"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Еф 6.11"
                2 -> res = "Флп 1.27; Ин 1.12"
                4 -> res = "Песн 4.5"
                5 -> res = "Песн 4.4"
                6 -> res = "1 Фес 5.8; Еф 1.22-23"
                7 -> res = "Ис 61.10; 62.5"
                8 -> res = "Пс 91.13"
                9 -> res = "Флп 1.11"
                11 -> res = "Песн 2.16"
                12 -> res = "Мф 9.35; 13.38"
                13 -> res = "Ис 5.7"
                14 -> res = "Быт 30.14; Мф 13.52"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "Песн 3.4"
                3 -> res = "Песн 2.6"
                4 -> res = "Песн 3.5"
                5 -> res = "1 Пет 5.10; Мф 8.25; 12.49; Гал 4.19; Песн 3.6"
                6 -> res = "Иер 22.24; 2 Тим 2.12"
                7 -> res = "Рим 8.35, 39"
                11 -> res = "Еккл 2.4; Мф 21.33"
                12 -> res = "Ис 5.1"
                14 -> res = "Песн 2.9, 17"
            }
        }
        return res
    }

    fun kniga26(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Ис 56.1"
                2 -> res = "Втор 4.29; 2 Пар 15.4"
                3 -> res = "Ис 59.2"
                4 -> res = "Еккл 2.26"
                5 -> res = "Иер 43.2"
                6 -> res = "Тит 3.4; Пс 7.10; Иер 20.12"
                7 -> res = "Пс 138.7"
                8 -> res = "Иер 4.18"
                9 -> res = "Еккл 3.17; Мф 12.36"
                10 -> res = "Исх 20.5"
                11 -> res = "1 Кор 10.10; 2 Кор 12.20"
                12 -> res = "Втор 4.23"
                13 -> res = "Иез 18.32"
                14 -> res = "Быт 1.31; Сир 39.21"
                16 -> res = "Ис 28.15; Прем 18.4"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Иов 7.1, 9; Пс 89.10; 1 Кор 15.32"
                2 -> res = "Еккл 3.21; Иак 4.14"
                3 -> res = "Еккл 3.20"
                4 -> res = "Еккл 2.16; Иак 4.14"
                5 -> res = "1 Пар 29.15"
                6 -> res = "Ис 56.12; 1 Кор 15.32"
                7 -> res = "1 Кор 7.31"
                10 -> res = "Иак 2.6"
                12 -> res = "Лк 11.54; Мф 11.20"
                13 -> res = "Мф 27.43"
                14 -> res = "Ин 7.7"
                15 -> res = "Ис 55.8"
                16 -> res = "1 Ин 3.1"
                17 -> res = "Мф 27.49"
                18 -> res = "Пс 21.9; Мф 27.43"
                19 -> res = "Лк 18.32; 2 Пет 2.8"
                20 -> res = "Иер 11.19; Мф 27.22"
                21 -> res = "Ис 33.11"
                22 -> res = "Мф 11.25; Рим 11.33; 1 Кор 2.8"
                23 -> res = "Быт 1.27; Сир 17.1-3"
                24 -> res = "Быт 3.1-2"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Втор 33.3"
                2 -> res = "Прем 5.4"
                3 -> res = "Ис 57.2"
                4 -> res = "Рим 8.24"
                5 -> res = "2 Кор 4.17; Втор 8.2"
                6 -> res = "Сир 2.5"
                7 -> res = "Дан 12.3; Мф 13.43"
                8 -> res = "Мф 19.28; 1 Кор 6.2"
                9 -> res = "Пс 36.40"
                10 -> res = "Пс 33.22; Дан 12.2; Ин 5.29"
                11 -> res = "Откр 3.17"
                12 -> res = "Сир 41.8"
                13 -> res = "Ис 54.1; Лк 23.29; Гал 4.27"
                14 -> res = "Ис 56.3; Мф 19.12; Откр 3.12"
                15 -> res = "Иер 17.10"
                16 -> res = "Иов 18.19; Сир 23.34; 41.10"
                17 -> res = "Пс 72.19"
                19 -> res = "Пс 1.4"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Сир 16.4; Пс 111.6"
                2 -> res = "Ис 28.5"
                3 -> res = "Сир 23.34"
                4 -> res = "Пс 36.35; Мф 7.26-27"
                7 -> res = "Ис 57.2; Лк 2.29; Откр 14.13"
                9 -> res = "Притч 16.31"
                10 -> res = "Быт 5.24; Сир 44.15; Евр 11.5"
                11 -> res = "3 Цар 14.13"
                12 -> res = "Мф 18.7; 1 Кор 15.33"
                14 -> res = "Ис 57.1"
                15 -> res = "1 Пет 5.7"
                18 -> res = "Пс 2.4; 81.5"
                19 -> res = "Ис 66.24"
                20 -> res = "Рим 2.16"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Лк 21.36"
                3 -> res = "Рим 2.9; Иов 12.4"
                4 -> res = "Деян 26.24"
                5 -> res = "Кол 1.12"
                6 -> res = "Ин 1.5"
                8 -> res = "Притч 11.4"
                9 -> res = "Прем 2.5"
                10 -> res = "Притч 30.19"
                11 -> res = "Иов 9.26"
                14 -> res = "Иов 8.13-14; Пс 1.4"
                15 -> res = "Откр 22.12"
                16 -> res = "Дан 7.18; 1 Пет 1.8; Евр 13.5-6"
                18 -> res = "Ис 59.17"
                20 -> res = "Пс 7.13"
                22 -> res = "Нав 10.11; Откр 16.21"
                23 -> res = "Пс 1.4"
                24 -> res = "Притч 20.28"
            }
        }
        if (glava == 6) {
            when (stih) {
                3 -> res = "Сир 17.14; 1 Пет 2.13; Рим 13.1; Тит 3.1"
                4 -> res = "Рим 13.4"
                5 -> res = "Ис 2.17"
                7 -> res = "Втор 10.17; 2 Пар 19.7; Иов 34.19; Сир 35.12; Деян 10.34; 1 Пет 1.17; Рим 2.11; Гал 2.6; Еф 6.9; Кол 3.25"
                12 -> res = "Притч 8.17; Сир 24.23"
                14 -> res = "Притч 1.20; Рим 10.6-7"
                16 -> res = "Мф 4.18; 10.11"
                17 -> res = "Притч 4.7"
                18 -> res = "Ин 14.15"
                19 -> res = "Иак 4.8"
                21 -> res = "2 Цар 14.11; 3 Цар 3.9; Притч 29.14"
                23 -> res = "Притч 4.11"
                25 -> res = "Иак 3.16"
                26 -> res = "Притч 11.14"
            }
        }
        if (glava == 7) {
            when (stih) {
                2 -> res = "Иов 10.10"
                5 -> res = "Сир 40.4"
                6 -> res = "Иов 1.21; 1 Тим 6.7"
                7 -> res = "3 Цар 3.9; 2 Пар 1.10"
                9 -> res = "Иов 28.15; Притч 8.10"
                11 -> res = "3 Цар 3.13"
                14 -> res = "Ин 15.15"
                16 -> res = "2 Кор 3.5"
                17 -> res = "3 Цар 4.29"
                20 -> res = "3 Цар 4.33"
                22 -> res = "Иов 12.13"
                23 -> res = "Притч 8.12; 1 Кор 2.10; Евр 1.3"
                24 -> res = "Евр 4.12"
                27 -> res = "1 Кор 12.4, 11"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "Сир 15.2"
                5 -> res = "Прем 7.8-9"
                8 -> res = "3 Цар 10.1"
                9 -> res = "Притч 7.4"
                11 -> res = "3 Цар 3.28"
                12 -> res = "Иов 29.21"
                14 -> res = "Притч 8.11"
                18 -> res = "Мк 4.20"
                19 -> res = "Еккл 12.7"
                21 -> res = "Флп 2.13; Иак 1.17"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Ин 1.3"
                2 -> res = "Быт 1.26"
                4 -> res = "3 Цар 3.9; 2 Пар 1.10"
                5 -> res = "Пс 115.7"
                7 -> res = "3 Цар 3.6; 1 Пар 28.5; 2 Пар 1.9"
                8 -> res = "2 Цар 7.13; 3 Цар 8.19; Исх 25.8-9"
                9 -> res = "Притч 8.22; Ин 1.3"
                11 -> res = "Ин 16.13"
                13 -> res = "Ис 40.13; Рим 11.34; 1 Кор 2.16"
                15 -> res = "Рим 7.24; 1 Кор 15.53; 2 Кор 5.4"
                16 -> res = "Ин 3.12"
                17 -> res = "Иов 15.8"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Быт 1.26"
                2 -> res = "Быт 1.28"
                3 -> res = "Быт 4.8"
                4 -> res = "Быт 7.1"
                5 -> res = "Быт 14.15; 22.6"
                6 -> res = "Быт 19.16"
                7 -> res = "2 Пет 2.6; Иуд 1.7; Быт 19.26"
                10 -> res = "Быт 28.7"
                11 -> res = "Быт 31.7, 42"
                12 -> res = "Быт 32.28; 1 Тим 4.8"
                13 -> res = "Быт 37.28"
                14 -> res = "Быт 39.21; 40.14; Пс 104.20"
                15 -> res = "Исх 12.37"
                16 -> res = "Исх 4.11"
                17 -> res = "Исх 11.2; 12.35; 13.21"
                18 -> res = "Исх 14.22"
                20 -> res = "Исх 12.35; 15.1"
                21 -> res = "Исх 4.11-12"
            }
        }
        if (glava == 11) {
            when (stih) {
                2 -> res = "Исх 15.22"
                3 -> res = "Исх 17.10"
                4 -> res = "Исх 17.6; Пс 77.16; 104.41; Ис 48.21; 1 Кор 10.4"
                7 -> res = "Исх 7.20"
                8 -> res = "Исх 1.15; 17.6"
                10 -> res = "Втор 8.2; 1 Кор 11.32"
                15 -> res = "Исх 5.2"
                16 -> res = "Лев 26.14"
                17 -> res = "Прем 12.27; Рим 1.27"
                18 -> res = "Лев 26.22; Иер 8.17"
                19 -> res = "Чис 21.6; Прем 12.9"
                21 -> res = "Пс 34.5; Ис 41.16; Ос 4.19"
                22 -> res = "Рим 9.19"
                24 -> res = "Мих 7.18; Рим 2.4"
                25 -> res = "Прем 12.13"
                27 -> res = "Прем 12.16; Иез 18.23, 32"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Прем 1.7; Пс 138.7"
                2 -> res = "Иер 10.24"
                3 -> res = "Втор 9.5"
                4 -> res = "Лев 18.3"
                5 -> res = "Втор 12.31; 18.10; Иер 19.5"
                8 -> res = "Исх 23.27-28; Втор 7.20"
                10 -> res = "Рим 2.4; Откр 2.21; Иер 13.23"
                11 -> res = "Быт 9.25"
                12 -> res = "Рим 9.20"
                13 -> res = "1 Пет 5.7"
                16 -> res = "Пс 144.9; Рим 11.32"
                18 -> res = "Пс 102.10; Сир 18.9"
                20 -> res = "Исх 8.31; Рим 2.4"
                21 -> res = "Рим 11.24"
                22 -> res = "1 Кор 11.32"
                24 -> res = "Рим 1.23"
                27 -> res = "Прем 11.17"
                28 -> res = "Исх 8.19"
            }
        }
        if (glava == 13) {
            when (stih) {
                1, 7 -> res = "Рим 1.19"
                2 -> res = "Втор 4.19; Деян 7.42"
                3 -> res = "Сир 43.5; Рим 1.20"
                5 -> res = "Рим 1.20"
                6 -> res = "Деян 14.17; 17.27"
                10 -> res = "Деян 17.29; Рим 1.23"
                11 -> res = "Ис 44.13; Иер 10.3"
                18 -> res = "Иер 3.23; 1 Кор 8.4"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Иона 1.5"
                3 -> res = "Исх 14.21"
                4 -> res = "Ис 43.2; Иона 2.3"
                6 -> res = "Быт 6.4; 7.13"
                7 -> res = "1 Пет 3.20"
                8 -> res = "Пс 134.15; Вар 3.18-19"
                9 -> res = "Пс 5.5-6"
                11 -> res = "Иер 46.25"
                12 -> res = "Исх 34.15; Иез 16.15; Ос 2.5"
                14 -> res = "Гал 5.26; Прем 9.5"
                15 -> res = "Рим 1.23"
                16 -> res = "Дан 3.5"
                22 -> res = "Деян 19.24-25"
                23 -> res = "Втор 18.10; Иер 7.9, 31; 19.5"
                25 -> res = "Рим 1.29; Иер 7.9"
                26 -> res = "Рим 1.24, 27"
                28 -> res = "Ос 7.5"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Исх 34.6; Пс 102.8"
                2 -> res = "1 Ин 2.1-2"
                3 -> res = "Иер 9.24; Ин 17.3"
                6 -> res = "Прем 1.16"
                7 -> res = "Рим 9.21"
                8 -> res = "Быт 2.7; Еккл 12.7; Лк 12.20"
                9 -> res = "Ис 40.19"
                11 -> res = "Быт 2.7"
                12 -> res = "1 Тим 6.5; Иак 4.13"
                13 -> res = "Втор 4.16; 5.8; Откр 9.20"
                15 -> res = "Пс 113.12; 134.15"
                18 -> res = "Прем 11.16; 12.24; Иез 8.10"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Прем 12.26; Исх 8.24"
                2 -> res = "Исх 16.13; Чис 11.31"
                5 -> res = "Чис 21.6; 1 Кор 10.9"
                6 -> res = "Ин 3.14"
                7 -> res = "Чис 21.9"
                8 -> res = "Пс 3.9; 2 Тим 4.8"
                9 -> res = "Исх 8.24; Пс 104.31; Откр 9.3"
                12 -> res = "Пс 106.20"
                13 -> res = "Втор 32.39; 1 Цар 2.6; Тов 13.2"
                14 -> res = "Иов 14.10"
                15 -> res = "Рим 2.3"
                16 -> res = "Исх 9.23; Пс 77.47-48; 104.32"
                17 -> res = "Прем 19.19"
                20 -> res = "Исх 16.4; Чис 11.7; Втор 8.16; Пс 77.24; 3 Езд 1.17; Ин 6.31"
                21 -> res = "1 Пет 2.3"
                22 -> res = "Исх 9.23-24"
                26 -> res = "Втор 8.3; Мф 4.4; Лк 4.4"
                29 -> res = "Прем 5.14"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Рим 11.33"
                2, 13 -> res = "Исх 10.21"
                5 -> res = "Исх 10.23"
                7 -> res = "Исх 7.22; 8.18; 9.11"
                10 -> res = "Мк 12.15; Лев 26.36; Втор 28.66"
                11 -> res = "Иов 18.11"
                17 -> res = "2 Пет 2.4"
                20 -> res = "Мф 8.12"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "Исх 10.22-23"
                3 -> res = "Исх 13.21"
                4 -> res = "Втор 33.2; Ис 2.3; Сир 1.5"
                5, 15, 11 -> res = "Исх 12.29"
                6 -> res = "Исх 11.4"
                10, 12 -> res = "Исх 12.30"
                13 -> res = "Исх 7.11; 12.31"
                20 -> res = "Чис 16.46, 48"
                21 -> res = "Чис 16.45"
                22 -> res = "Пс 105.23"
                24 -> res = "Исх 28.21, 36"
            }
        }
        if (glava == 19) {
            when (stih) {
                2 -> res = "Исх 14.5"
                3 -> res = "Исх 12.30"
                7 -> res = "Исх 13.21; 14.16, 19"
                9 -> res = "Ис 63.13; Исх 15.1"
                10 -> res = "Исх 8.3, 6"
                11 -> res = "Исх 16.13; Чис 11.31; Лк 11.11"
                13 -> res = "Исх 1.11"
                15 -> res = "Быт 45.17; 47.6; Исх 1.14"
                16 -> res = "Быт 19.11"
                18 -> res = "Исх 14.22"
                19 -> res = "Исх 9.23; Прем 16.17"
                20 -> res = "Исх 16.21; Прем 16.27"
            }
        }
        return res
    }

    fun kniga27(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                9 -> res = "3 Цар 3.9; Иак 1.5"
                10 -> res = "Сир 18.8"
                12 -> res = "Притч 8.22; Кол 1.15"
                13 -> res = "Пс 118.101"
                14 -> res = "Прем 9.13; Ис 40.13; Рим 11.34"
                15 -> res = "Пс 46.3; 75.8"
                17 -> res = "Иак 1.17"
                18 -> res = "1 Кор 2.14"
                19 -> res = "Иер 9.24; Притч 4.9"
                20 -> res = "Притч 10.27; 14.27; 19.23"
                21 -> res = "Иов 42.12"
                23 -> res = "Притч 1.7; 9.10"
                25 -> res = "Втор 28.5; Прем 7.11"
                26 -> res = "Притч 1.7"
                27 -> res = "Втор 4.6"
                28 -> res = "Пс 91.13"
                29 -> res = "Быт 39.8"
                30 -> res = "Иак 1.20"
                35 -> res = "Притч 15.33"
                36 -> res = "Сир 28.23; Мф 8.24; Иак 4.8"
                38 -> res = "Лк 18.14; Деян 13.10; 1 Кор 4.5"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Мф 4.1; 1 Пет 4.12; 2 Тим 3.12"
                2 -> res = "2 Тим 2.3"
                5 -> res = "Притч 17.3; Прем 3.6"
                10 -> res = "Пс 36.25"
                12 -> res = "3 Цар 18.21"
                15 -> res = "Ин 14.21"
                18 -> res = "2 Цар 24.14"
            }
        }
        if (glava == 3) {
            when (stih) {
                3 -> res = "Исх 20.12; Втор 5.16; Сир 8.12; Еф 6.2"
                8 -> res = "Сир 7.29; Мф 15.4; Мк 7.10"
                9 -> res = "Быт 27.27; Втор 33.1"
                18 -> res = "Флп 2.3"
                19 -> res = "Ис 66.2; Иак 4.6"
                21 -> res = "Рим 12.3"
                23 -> res = "Деян 19.14-15"
                26 -> res = "Иер 6.7"
                28 -> res = "Притч 16.18; Дан 5.20"
                29 -> res = "Ин 8.47"
                30 -> res = "Пс 40.2; Дан 4.24; Мф 5.7"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Втор 15.4; Тов 4.7; Лк 11.41"
                2 -> res = "Притч 3.27"
                3 -> res = "Сир 7.11"
                5 -> res = "Мф 5.42; Лк 6.30"
                7 -> res = "Флп 4.8"
                9 -> res = "Быт 14.14"
                10 -> res = "Иов 29.12-13"
                11 -> res = "Ис 49.15"
                14 -> res = "Пс 1.3"
                16 -> res = "1 Цар 15.22; Притч 8.12"
                19 -> res = "Притч 3.12"
                23 -> res = "Рим 12.11"
                25 -> res = "Сир 41.19-20"
                29 -> res = "Тит 1.9"
                30 -> res = "1 Ин 1.9"
                32 -> res = "Лк 13.24; 2 Кор 13.8; 1 Тим 6.12"
                35 -> res = "Деян 20.35"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Лк 12.19"
                3 -> res = "Пс 10.4"
                4 -> res = "Рим 2.4; 6.1"
                7 -> res = "Втор 32.22; Пс 2.12; Иер 15.14"
                8 -> res = "Сир 18.22"
                10 -> res = "Иов 20.20; Притч 11.4"
                11 -> res = "Еф 4.14"
                12 -> res = "Иов 20.3"
                13 -> res = "Иак 1.19"
                15 -> res = "Притч 12.13"
                16 -> res = "Лев 19.16; Пс 14.3-4; Притч 16.28"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Рим 12.16"
                5 -> res = "1 Кор 13.7"
                6 -> res = "Рим 12.18"
                7 -> res = "Мих 7.5; Мф 10.36"
                8 -> res = "Сир 37.4"
                12 -> res = "Притч 19.4"
                14 -> res = "Сир 25.12"
                18 -> res = "2 Тим 3.15"
                30 -> res = "Мф 11.29"
                35 -> res = "Сир 8.9, 11"
                36 -> res = "Лк 21.38"
                37 -> res = "Втор 6.9; 11.19"
            }
        }
        if (glava == 7) {
            when (stih) {
                3 -> res = "Ос 10.12; Притч 22.8"
                4 -> res = "Мф 20.22"
                5 -> res = "Иов 9.2, 20; Пс 142.2; Притч 20.9; Еккл 7.16; Лк 18.11"
                9 -> res = "Ос 8.13; Мих 6.7"
                10 -> res = "1 Тим 2.8; Иак 1.6"
                11 -> res = "1 Цар 2.7"
                14 -> res = "Мф 6.7"
                15 -> res = "Быт 3.17, 19"
                17 -> res = "Иак 4.10"
                18 -> res = "Ис 66.24"
                19 -> res = "Мк 9.44"
                20 -> res = "Притч 27.10"
                22 -> res = "Лев 19.13; Втор 24.14"
                24 -> res = "Втор 25.4"
                25 -> res = "Сир 30.12"
                26 -> res = "Сир 42.9"
                29 -> res = "Тов 4.3; Сир 3.8"
                31 -> res = "Втор 12.19"
                33 -> res = "Лев 2.3; 1 Тим 5.17"
                34 -> res = "Мф 10.10; 1 Кор 9.14"
                35 -> res = "Пс 40.2"
                36 -> res = "Рим 14.18; Тов 1.21"
                37 -> res = "Иак 1.27; Рим 12.15"
                38 -> res = "Мф 25.36"
                39 -> res = "Плач 1.9"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Сир 13.3"
                2 -> res = "Мф 5.25"
                3 -> res = "Сир 31.6"
                4 -> res = "Иак 3.6"
                6 -> res = "Ин 8.7; 2 Кор 2.7; Гал 6.1"
                7 -> res = "Лев 19.32"
                8 -> res = "Мих 7.8; Притч 24.17"
                9, 11 -> res = "Сир 6.35"
                15 -> res = "Сир 29.4"
                16 -> res = "Притч 6.1"
                18 -> res = "Быт 4.8; Притч 22.24"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Чис 5.14; Притч 6.34"
                2 -> res = "1 Пет 3.1"
                3 -> res = "Притч 7.5"
                4 -> res = "Притч 5.3"
                5 -> res = "Быт 6.2; Иов 31.1"
                6 -> res = "Притч 5.8; Лк 5.13"
                8 -> res = "Мф 5.28"
                9 -> res = "2 Цар 11.2; 3 Цар 11.1"
                12 -> res = "Притч 27.10"
                13 -> res = "Лк 5.39"
                14 -> res = "Суд 9.3; 2 Цар 15.11; Пс 36.35"
                23 -> res = "1 Цар 22.9; Притч 16.27"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Притч 20.8"
                2 -> res = "3 Цар 12.14; Притч 29.12"
                3 -> res = "3 Цар 12.11"
                4 -> res = "Пс 126.1; Прем 6.4"
                6 -> res = "Лев 19.17"
                7, 16 -> res = "1 Пет 5.5"
                8 -> res = "Прем 6.1; Дан 4.14; Сир 11.5"
                9 -> res = "Иов 13.28; Сир 40.2"
                13 -> res = "Иов 17.14; Ис 14.11"
                14 -> res = "Быт 3.5"
                15 -> res = "Есф 5.14"
                17 -> res = "1 Цар 2.8"
                19 -> res = "Быт 19.24"
                24 -> res = "1 Пет 2.17"
                25 -> res = "Иер 9.23-24"
                26 -> res = "Иак 2.5-6"
                27 -> res = "Иудифь 16.19"
                28 -> res = "Притч 17.2"
                30 -> res = "Притч 12.9; 28.19"
                31 -> res = "Иак 1.2"
                33 -> res = "Сир 13.28"
                34 -> res = "Еккл 7.12"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Быт 41.40; Дан 6.3"
                2 -> res = "1 Цар 16.7"
                4 -> res = "Деян 12.21; Лк 16.19"
                5 -> res = "1 Цар 16.13"
                6 -> res = "Есф 7.9-10"
                7 -> res = "Втор 13.14"
                8 -> res = "Притч 18.14"
                10 -> res = "Лк 10.41"
                11 -> res = "Притч 21.5; 1 Тим 6.9"
                14 -> res = "Иов 1.21; Иез 28.4"
                17 -> res = "Лк 12.19-20"
                18 -> res = "Еккл 9.12; Иер 17.11"
                19 -> res = "Мф 10.22"
                21 -> res = "1 Цар 2.7"
                24 -> res = "Сир 5.1; Откр 3.17"
                25 -> res = "Сир 18.25"
                26 -> res = "Сир 17.19"
                30 -> res = "Иер 5.27"
                32 -> res = "Сир 28.13"
            }
        }
        if (glava == 12) {
            when (stih) {
                2 -> res = "Притч 19.17; Мф 10.41"
                3 -> res = "Притч 17.13"
                4 -> res = "Гал 6.10"
                5 -> res = "2 Фес 3.10"
                6 -> res = "Втор 32.35"
                8 -> res = "Сир 6.8"
                10 -> res = "3 Цар 2.23; Притч 11.9"
                13 -> res = "Пс 57.6"
                15 -> res = "Пс 54.22; Иер 41.6"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Втор 7.3-4; Сир 8.5"
                4 -> res = "Пс 72.6"
                19 -> res = "Сир 27.9"
                21 -> res = "2 Кор 6.15"
                23 -> res = "Иов 24.4; Иак 5.4"
                28 -> res = "Деян 12.22"
                30 -> res = "Пс 61.11; Притч 30.9"
                31 -> res = "Сир 19.26"
                32 -> res = "Еккл 8.1"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Сир 19.17; Иак 3.2"
                2 -> res = "1 Ин 3.21"
                3 -> res = "Сир 31.28"
                4 -> res = "Еккл 5.9"
                6 -> res = "Притч 11.17"
                9 -> res = "Притч 27.20; Кол 3.5"
                10 -> res = "Сир 31.14"
                11 -> res = "Чис 18.29; Притч 3.9"
                12 -> res = "Евр 9.27"
                13 -> res = "Тов 4.7; Сир 4.1; Лк 14.13"
                14 -> res = "Лк 16.19"
                15 -> res = "Лк 12.20"
                16 -> res = "Лк 6.38"
                18 -> res = "Ис 40.6; Иак 1.11; 1 Пет 1.24; Быт 2.17"
                19 -> res = "Еккл 1.4"
                21 -> res = "Втор 6.7; Пс 1.2"
                24 -> res = "Притч 8.34"
                26 -> res = "Еф 6.4"
            }
        }
        if (glava == 15) {
            when (stih) {
                2 -> res = "Ис 66.13"
                3 -> res = "Ин 4.14; Еф 5.17"
                7 -> res = "Притч 14.6"
                9 -> res = "Пс 49.16; Ис 52.7; 2 Тим 3.7"
                10 -> res = "Сир 39.8"
                11 -> res = "Пс 5.5"
                12 -> res = "Иак 1.13"
                14 -> res = "Быт 1.27"
                15 -> res = "Мф 19.17"
                17 -> res = "Иер 21.8"
                19 -> res = "Пс 33.16"
                20 -> res = "Пс 5.5; Ос 5.5"
            }
        }
        if (glava == 16) {
            when (stih) {
                3 -> res = "Прем 4.1"
                5 -> res = "Притч 11.11"
                7 -> res = "Чис 11.1; Втор 29.20"
                8 -> res = "Быт 6.4, 7"
                9 -> res = "Быт 19.11, 24"
                10 -> res = "Быт 19.24"
                11 -> res = "Исх 12.37; Чис 14.22; 26.65"
                12 -> res = "1 Цар 2.6"
                14 -> res = "Еккл 8.12; Прем 3.9"
                15 -> res = "Мф 10.42"
                16 -> res = "Иов 22.14; Сир 23.25"
                18 -> res = "2 Пет 3.10"
                19 -> res = "Пс 17.8"
                21 -> res = "Рим 11.33"
                22 -> res = "Иов 12.13"
                26 -> res = "Быт 1.1-31"
                27 -> res = "Иов 9.9; Пс 147.6"
                31 -> res = "Еккл 3.21"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Быт 2.7; 5.1; Прем 2.23"
                3 -> res = "Быт 1.27"
                4 -> res = "Быт 1.28; 9.2"
                5 -> res = "Быт 2.20"
                9 -> res = "Втор 4.13; Рим 7.10"
                10 -> res = "Быт 12.1; Исх 20.1"
                14 -> res = "Прем 6.3; Рим 13.1"
                15 -> res = "Втор 4.20"
                16 -> res = "Сир 23.27-28"
                17 -> res = "Пс 89.8"
                18 -> res = "Сир 29.15"
                19 -> res = "Мф 16.27"
                21 -> res = "Иер 3.12"
                22 -> res = "Пс 33.15"
                24 -> res = "Пс 6.6; 113.25; Ис 38.18-19"
                27 -> res = "Пс 102.13; Еф 2.3, 7"
                30 -> res = "Рим 8.7; 1 Кор 2.14"
                31 -> res = "Быт 3.10; 18.27"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "Быт 1.31"
                6 -> res = "Лк 17.10"
                8 -> res = "Пс 89.10"
                9 -> res = "2 Пет 3.9; Прем 12.18"
                11 -> res = "Иез 13.23"
                12 -> res = "Мф 5.45; 6.12"
                13 -> res = "Пс 117.18"
                15 -> res = "Сир 20.15; 41.28"
                17 -> res = "Притч 16.24; 25.11"
                20 -> res = "Лк 4.23"
                21 -> res = "Лк 6.42"
                22 -> res = "Пс 94.8; Рим 12.11"
                24 -> res = "Сир 1.30"
                25 -> res = "Мф 14.20"
                26 -> res = "Евр 13.3"
                27 -> res = "Притч 28.14"
                28 -> res = "Притч 1.5"
                30 -> res = "Рим 6.12; 8.13"
                32 -> res = "Лк 16.19"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "Притч 21.17"
                2 -> res = "3 Цар 11.1, 4; Ос 4.11"
                4 -> res = "Притч 15.14; Мф 11.7"
                11 -> res = "Сир 27.18"
                14 -> res = "Мф 18.15"
                17 -> res = "Сир 14.1"
                21 -> res = "Мф 11.25"
                22 -> res = "Ис 5.20"
                26 -> res = "Сир 13.31; Притч 6.12-13"
                28 -> res = "Притч 25.15"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "Пс 140.5; Притч 25.12"
                4 -> res = "Сир 30.21"
                7 -> res = "Еккл 3.7; Притч 25.11"
                8 -> res = "Притч 10.19; 17.28"
                9 -> res = "Притч 10.2"
                11 -> res = "Притч 16.18; 1 Пет 5.5"
                13 -> res = "Сир 18.17"
                15 -> res = "Сир 18.15"
                16 -> res = "Пс 40.10"
                20 -> res = "Притч 25.11"
                27 -> res = "Быт 41.38-39; Дан 2.46, 48"
                28 -> res = "Притч 12.11"
                29 -> res = "Исх 23.8; Втор 16.19"
                30 -> res = "Сир 41.17"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "Сир 17.21"
                2 -> res = "Втор 32.33; Ис 59.5; 1 Кор 15.56"
                4 -> res = "Евр 2.2; Иак 1.15; 1 Пет 2.24"
                5 -> res = "Сир 10.17"
                7 -> res = "Притч 13.13"
                9 -> res = "Притч 28.22"
                10 -> res = "Быт 19.24"
                11 -> res = "Мф 7.13"
                12 -> res = "Сир 32.25"
                13 -> res = "Сир 1.20"
                15 -> res = "Сир 19.22"
                16 -> res = "Притч 18.4"
                18 -> res = "Иов 21.14; Иез 5.6; Ос 4.6"
                28 -> res = "Еккл 10.12"
                31 -> res = "Сир 5.16; 28.15"
            }
        }
        if (glava == 22) {
            when (stih) {
                3 -> res = "Притч 17.21"
                6 -> res = "Сир 19.28"
                9 -> res = "Сир 38.16"
                10 -> res = "1 Фес 4.15"
                11 -> res = "Быт 50.10; Чис 19.11; 2 Цар 11.27"
                15 -> res = "Сир 21.19"
                16 -> res = "Притч 27.3"
                18 -> res = "Иез 13.10"
                20 -> res = "Прем 17.11"
                24 -> res = "Сир 27.17"
                31 -> res = "Пс 140.3; Притч 21.23"
            }
        }
        if (glava == 23) {
            when (stih) {
                4 -> res = "Гал 5.24"
                9 -> res = "Исх 20.7; Мф 5.34"
                11 -> res = "Лев 19.12; Втор 5.11"
                12 -> res = "Лев 5.4"
                14 -> res = "Лев 24.15-16"
                16 -> res = "Мф 5.33"
                17 -> res = "Сир 3.3"
                19 -> res = "Притч 10.18"
                22 -> res = "Евр 13.4"
                23 -> res = "Притч 9.17"
                24 -> res = "Ис 29.15"
                25 -> res = "Иез 8.12"
                27 -> res = "Сир 17.16; Евр 4.13"
                28 -> res = "Иер 23.24"
                29 -> res = "Пс 138.16"
                30 -> res = "Лев 20.10"
                32 -> res = "Втор 22.22; Ин 8.5"
                33 -> res = "Втор 22.22; Иез 16.40"
                34 -> res = "Прем 3.16; 4.3"
                35 -> res = "Чис 5.27"
                36 -> res = "Пс 18.11; 118.72"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "Втор 4.6; 1 Кор 1.24; Иак 3.17"
                3 -> res = "Евр 1.3"
                5 -> res = "Прем 1.7; 12.1"
                10 -> res = "Притч 8.22"
                15 -> res = "Втор 34.3"
                20 -> res = "Ин 15.1"
                21 -> res = "Ис 55.1; Притч 9.5"
                22 -> res = "Пс 18.11"
                23 -> res = "Ин 4.14; 7.37"
                24 -> res = "Исх 24.3"
                27 -> res = "Быт 2.11"
                28 -> res = "Нав 3.15"
                29 -> res = "Ам 8.8"
                30 -> res = "1 Кор 13.9"
                31 -> res = "Рим 11.33"
                34 -> res = "Флп 1.9"
                35 -> res = "Пс 18.9; Ис 60.1"
                36 -> res = "Авв 2.3"
            }
        }
        if (glava == 25) {
            when (stih) {
                1 -> res = "Пс 132.1"
                3 -> res = "Притч 30.21"
                4 -> res = "Дан 13.10"
                5 -> res = "Притч 6.6"
                7 -> res = "Притч 16.31"
                10 -> res = "Быт 3.15; 45.26"
                11 -> res = "Иак 3.2"
                15 -> res = "Быт 27.6; Суд 16.4"
                17 -> res = "Быт 3.1"
                18 -> res = "Притч 21.19"
                23 -> res = "Быт 34.1; Суд 16.4; 2 Цар 11.2"
                27 -> res = "Быт 3.6; 1 Тим 2.14"
            }
        }
        if (glava == 26) {
            when (stih) {
                1 -> res = "Притч 11.16; 12.4; 14.1"
                3 -> res = "Притч 18.23"
                7 -> res = "Сир 25.23"
                12 -> res = "Сир 42.11"
                16 -> res = "Иез 24.16"
            }
        }
        if (glava == 27) {
            when (stih) {
                1 -> res = "1 Тим 6.9"
                5 -> res = "Притч 27.21"
                6 -> res = "Притч 26.24"
                9 -> res = "Сир 13.12"
                11 -> res = "Притч 15.4; Еф 4.29"
                14 -> res = "Сир 23.10; Иов 4.15"
                16 -> res = "Притч 11.13; Сир 19.10"
                19 -> res = "Сир 6.14"
                21 -> res = "Сир 37.2"
                22 -> res = "Сир 22.24"
                24 -> res = "Притч 10.10"
                28 -> res = "Рим 12.19"
                29 -> res = "Притч 26.27"
            }
        }
        if (glava == 28) {
            when (stih) {
                1 -> res = "Втор 32.35; Рим 12.19"
                2 -> res = "Мф 6.14"
                4 -> res = "Мф 6.15"
                6 -> res = "Сир 7.39"
                7 -> res = "Лев 19.18"
                11 -> res = "Притч 26.21"
                12 -> res = "Притч 17.11"
                14 -> res = "Притч 11.12"
                16 -> res = "Притч 16.28; 17.20"
                20 -> res = "Притч 18.7; Иер 9.8"
                29 -> res = "Иак 3.3"
            }
        }
        if (glava == 29) {
            when (stih) {
                1 -> res = "Пс 36.26"
                2 -> res = "2 Кор 8.14"
                4 -> res = "Сир 8.15"
                12 -> res = "Втор 15.7; Ис 58.7"
                13 -> res = "Иак 5.3"
                14 -> res = "Втор 26.11; Мф 6.20"
                15 -> res = "Тов 4.7; Сир 17.18; Дан 4.24; Лк 11.41; Деян 10.4"
                20 -> res = "Притч 11.15"
                24 -> res = "Сир 39.32"
                27 -> res = "Быт 19.9"
            }
        }
        if (glava == 30) {
            when (stih) {
                1 -> res = "Притч 13.25"
                12 -> res = "Сир 7.25"
                19 -> res = "Дан 14.7"
                21 -> res = "Сир 20.4"
                22 -> res = "Притч 15.13"
                23 -> res = "Притч 14.30; 15.13; 17.22"
                25 -> res = "2 Кор 7.10"
                26 -> res = "Иов 5.2"
            }
        }
        if (glava == 31) {
            when (stih) {
                2 -> res = "Дан 6.18"
                5 -> res = "Сир 27.1; 1 Тим 6.9"
                6 -> res = "Сир 8.3"
                8 -> res = "Лк 6.24; Пс 61.11; 1 Тим 6.17-18"
                13 -> res = "Притч 23.1"
                14 -> res = "Притч 23.6; Сир 14.10"
                18 -> res = "Сир 37.33"
                22 -> res = "Еккл 5.11"
                24 -> res = "Сир 32.15"
                27 -> res = "Притч 22.9"
                28 -> res = "1 Цар 25.10"
                29 -> res = "Иудифь 12.20; Ис 5.22"
                31 -> res = "Суд 9.13; Притч 31.4"
                32 -> res = "Пс 103.15"
            }
        }
        if (glava == 32) {
            when (stih) {
                4 -> res = "Иов 12.12-13"
                6 -> res = "Еккл 3.7; Сир 20.7"
                15 -> res = "Втор 8.10"
                16 -> res = "Иер 25.3"
                17 -> res = "Сир 14.21; 2 Пет 2.20"
                22 -> res = "Притч 15.19"
                23 -> res = "Мих 7.6"
                24 -> res = "Пс 36.5"
                25 -> res = "Пс 33.11"
            }
        }
        if (glava == 33) {
            when (stih) {
                3 -> res = "Пс 18.8; Тит 1.9; Евр 13.9"
                5 -> res = "Сир 21.28"
                7 -> res = "Кол 2.16"
                8 -> res = "Быт 2.3"
                9 -> res = "Лев 23.2"
                10 -> res = "Быт 2.7"
                11 -> res = "Еф 3.10; 1 Кор 12.4-5"
                13 -> res = "Ис 45.9; Рим 9.20"
                14 -> res = "Сир 42.25"
                17 -> res = "Сир 24.37"
                18 -> res = "Прем 6.2"
                26 -> res = "Притч 29.21"
                33 -> res = "Сир 7.22"
            }
        }
        if (glava == 34) {
            when (stih) {
                1 -> res = "Сир 5.6; Иер 29.8"
                4 -> res = "Мф 12.34"
                6 -> res = "Быт 20.3; 37.5; 3 Цар 3.5"
                8 -> res = "Мф 15.9; Кол 2.8, 22"
                13 -> res = "Пс 55.12"
                14 -> res = "Пс 3.4; 90.2"
                15 -> res = "Пс 127.1"
                16 -> res = "Пс 33.16"
                18 -> res = "Притч 21.27"
                19 -> res = "Притч 15.8; 21.27"
                20 -> res = "Ис 66.3"
                21 -> res = "Втор 24.15; Сир 7.22"
                22 -> res = "Лев 19.13"
                25 -> res = "Чис 19.11"
                26 -> res = "2 Пет 2.22"
            }
        }
        if (glava == 35) {
            when (stih) {
                1 -> res = "1 Цар 15.22; Притч 21.3; Иер 7.22"
                2 -> res = "Тов 4.8; Флп 4.18"
                3 -> res = "Ис 1.11"
                4 -> res = "Исх 23.15; Втор 16.16"
                5 -> res = "Быт 4.4"
                7 -> res = "Исх 23.19"
                8 -> res = "2 Кор 9.7"
                9 -> res = "Тов 4.8"
                12 -> res = "Втор 10.17"
                15 -> res = "Исх 22.22; Втор 27.19"
                17 -> res = "Иак 5.16"
                18 -> res = "Исх 2.24"
                19 -> res = "2 Пет 3.9"
                21 -> res = "Пс 61.13; Рим 2.6; 2 Фес 1.6"
            }
        }
        if (glava == 36) {
            when (stih) {
                3 -> res = "Иер 10.25"
                4 -> res = "4 Цар 19.19"
                12 -> res = "Исх 4.22"
                18 -> res = "Чис 6.23"
                24 -> res = "2 Езд 4.18-19"
            }
        }
        if (glava == 37) {
            when (stih) {
                3 -> res = "Иак 3.15"
                4 -> res = "Сир 6.7"
                15 -> res = "Сир 6.35"
                16 -> res = "Сир 6.17"
                18 -> res = "3 Цар 12.7"
                20 -> res = "Сир 38.22"
                21 -> res = "Притч 18.21"
                26 -> res = "Сир 4.16"
                29 -> res = "Прем 8.9"
                31 -> res = "1 Кор 6.12; 10.23"
                32 -> res = "Сир 31.19"
            }
        }
        if (glava == 38) {
            when (stih) {
                5 -> res = "Исх 15.25"
                8 -> res = "Иак 1.17"
                9 -> res = "Ис 38.2-3; Иак 5.14"
                10 -> res = "Ис 1.16; Иак 4.8"
                15 -> res = "Втор 28.21"
                16 -> res = "1 Фес 4.13"
                17 -> res = "Притч 15.13"
                18 -> res = "Притч 17.22; Сир 30.25"
                21 -> res = "2 Цар 12.23"
                23 -> res = "2 Цар 12.20"
                32 -> res = "Иер 18.3; Прем 15.7"
                36 -> res = "Сир 10.30"
            }
        }
        if (glava == 39) {
            when (stih) {
                3 -> res = "Тит 1.9"
                6 -> res = "Пс 118.47; Еф 3.14; Флп 1.9; 1 Цар 12.23"
                7 -> res = "1 Кор 2.13; 2 Тим 2.7"
                8 -> res = "Втор 32.2; Ис 55.10-11"
                12 -> res = "Притч 10.7"
                13 -> res = "2 Тим 2.2"
                17 -> res = "Флп 4.18"
                21, 40 -> res = "Быт 1.31"
                23 -> res = "Исх 14.21; Нав 3.16"
                25 -> res = "Пс 138.1"
                26 -> res = "Еккл 1.9"
                28 -> res = "Пс 64.11"
                29 -> res = "Пс 93.10"
                30 -> res = "Пс 17.27; Лк 7.35"
                31 -> res = "Рим 8.28; Быт 1.17"
                32 -> res = "Сир 29.24"
                36 -> res = "Пс 147.6-7"
                37 -> res = "Сир 40.10"
                38 -> res = "Иов 37.12"
            }
        }
        if (glava == 40) {
            when (stih) {
                1 -> res = "Быт 47.9; Иов 14.1; Пс 89.10"
                2 -> res = "Еккл 1.8; Евр 9.27"
                3 -> res = "Пс 81.7; Прем 6.5"
                5 -> res = "Иов 7.13"
                10 -> res = "Быт 7.12"
                11 -> res = "Быт 3.19; Еккл 12.7; Сир 41.13"
                13 -> res = "Иов 6.15"
                14 -> res = "Пс 36.20"
                15 -> res = "Прем 4.4"
                18 -> res = "Флп 4.12; 1 Тим 6.6"
                19 -> res = "Притч 31.23"
                20 -> res = "Пс 103.15"
                24 -> res = "Лк 16.9"
                26 -> res = "Сир 1.20"
                27 -> res = "Тов 4.21; Пс 33.10"
            }
        }
        if (glava == 41) {
            when (stih) {
                3 -> res = "Иов 5.26"
                5 -> res = "Пс 88.49"
                7 -> res = "Прем 4.13"
                8 -> res = "Прем 3.12"
                9 -> res = "Иов 20.10"
                10 -> res = "Прем 3.16"
                13 -> res = "Быт 3.19; Сир 40.11"
                15 -> res = "Притч 22.1"
                16 -> res = "Еккл 7.1"
                19 -> res = "Сир 4.25"
                26 -> res = "Исх 20.17; Иов 31.1; Мф 5.28"
                28 -> res = "Сир 18.15; 20.15"
                29 -> res = "Сир 19.24; 27.18"
            }
        }
        if (glava == 42) {
            when (stih) {
                1 -> res = "Втор 1.17; Иак 2.1"
                2 -> res = "Исх 23.6; Лев 19.15; Втор 1.16"
                5 -> res = "Сир 33.27, 30"
                9 -> res = "Сир 7.26"
                11 -> res = "Сир 26.12"
                12 -> res = "Иов 31.1"
                13 -> res = "Притч 7.27"
                15 -> res = "Рим 1.20"
                18 -> res = "Пс 7.10; Иер 17.10; Деян 1.24"
                19 -> res = "Пс 138.2"
                21 -> res = "Пс 89.3"
                22 -> res = "Рим 11.34; 1 Кор 13.9"
                25 -> res = "Сир 33.14"
            }
        }
        if (glava == 43) {
            when (stih) {
                1 -> res = "Пс 18.2; Рим 1.20"
                2 -> res = "Пс 135.8"
                3 -> res = "Пс 18.7"
                5 -> res = "Прем 13.3"
                6 -> res = "Пс 135.9; Рим 1.20"
                12 -> res = "Быт 9.13"
                13 -> res = "Пс 103.2"
                17 -> res = "Наум 1.5"
                21 -> res = "Пс 147.5-6"
                25 -> res = "Иов 38.10"
                26 -> res = "Пс 106.23"
                27 -> res = "Пс 103.25"
                28 -> res = "Пс 32.6; Деян 17.28; Евр 1.3"
                30 -> res = "1 Кор 15.28; Пс 70.15"
                31 -> res = "Пс 95.4"
                34 -> res = "Пс 105.2"
                35 -> res = "1 Кор 13.9"
                36 -> res = "Пс 24.14"
            }
        }
        if (glava == 44) {
            when (stih) {
                11 -> res = "Исх 20.6"
                13 -> res = "Притч 10.7"
                15 -> res = "Быт 5.24; Прем 4.10; Евр 11.5"
                16 -> res = "Быт 6.9; 7.1; Прем 10.4; Евр 11.7"
                18 -> res = "Быт 9.11"
                19 -> res = "Быт 17.4"
                20 -> res = "Быт 17.10"
                21 -> res = "Быт 22.16"
                22 -> res = "Быт 12.3; 22.16-18"
                23 -> res = "Быт 13.16; Пс 71.8"
                24 -> res = "Быт 26.3"
                25 -> res = "Быт 27.28"
                26 -> res = "Втор 32.9"
                27 -> res = "Исх 2.10; 11.3"
            }
        }
        if (glava == 45) {
            when (stih) {
                3 -> res = "Исх 11.3"
                5 -> res = "Исх 19.19"
                6 -> res = "Исх 19.5; 31.18"
                7 -> res = "Исх 4.27"
                9 -> res = "Исх 28.2"
                11 -> res = "Исх 28.33-35"
                14 -> res = "Исх 28.36"
                18 -> res = "Лев 8.12"
                19 -> res = "Чис 18.19; Втор 11.21"
                22 -> res = "Чис 16.1"
                23 -> res = "Чис 16.31"
                24 -> res = "Чис 16.35"
                27 -> res = "Чис 18.20"
                28 -> res = "Чис 25.7, 13"
                29 -> res = "Чис 25.12-13; 1 Мак 2.54"
                30 -> res = "Пс 88.5"
            }
        }
        if (glava == 46) {
            when (stih) {
                1 -> res = "Чис 27.18"
                3 -> res = "Нав 6.1; 8.21; 10.1"
                5 -> res = "Нав 10.12"
                9 -> res = "Чис 14.6-7"
                10 -> res = "Чис 26.65"
                11 -> res = "Нав 14.11"
                14 -> res = "Сир 49.12; Ис 66.14"
                16 -> res = "1 Цар 10.1"
                17 -> res = "1 Цар 7.15"
                18 -> res = "1 Цар 10.9"
                19 -> res = "1 Цар 7.9"
                20 -> res = "1 Цар 7.10"
                22 -> res = "1 Цар 12.3; Деян 20.33"
                23 -> res = "1 Цар 28.17, 19"
            }
        }
        if (glava == 47) {
            when (stih) {
                1 -> res = "2 Цар 7.3; 1 Пар 17.2"
                3 -> res = "1 Цар 17.34"
                4 -> res = "1 Цар 17.49"
                7 -> res = "1 Цар 18.7"
                8 -> res = "2 Цар 8.1"
                10 -> res = "2 Цар 23.1"
                11 -> res = "1 Пар 25.1"
                12 -> res = "1 Пар 16.4"
                13 -> res = "2 Цар 12.13"
                14 -> res = "3 Цар 1.35"
                15 -> res = "3 Цар 2.12; 5.4-5"
                16 -> res = "3 Цар 4.29"
                17 -> res = "3 Цар 4.32"
                18 -> res = "3 Цар 10.1"
                21 -> res = "3 Цар 10.27"
                22 -> res = "3 Цар 11.1"
                23 -> res = "3 Цар 12.16"
                26 -> res = "3 Цар 11.43"
                27 -> res = "3 Цар 12.13"
                29 -> res = "3 Цар 12.28"
                30 -> res = "Втор 4.26"
            }
        }
        if (glava == 48) {
            when (stih) {
                1 -> res = "Иер 5.14; Ин 5.35"
                3 -> res = "3 Цар 17.1"
                4 -> res = "3 Цар 18.38; 4 Цар 1.10"
                5 -> res = "3 Цар 17.22"
                6 -> res = "3 Цар 21.19; 4 Цар 5.4"
                7 -> res = "3 Цар 21.19"
                8 -> res = "3 Цар 19.16"
                9, 13 -> res = "4 Цар 2.11"
                10 -> res = "Мал 4.6"
                14 -> res = "4 Цар 13.21"
                15 -> res = "4 Цар 2.14; 13.21"
                19 -> res = "4 Цар 20.20"
                20 -> res = "4 Цар 18.13; 2 Пар 32.1; Ис 36.1"
                24 -> res = "4 Цар 19.35; Ис 37.36; 1 Мак 7.41; 2 Мак 15.22"
                26 -> res = "4 Цар 20.9, 11; 2 Пар 32.24; Ис 38.8"
            }
        }
        if (glava == 49) {
            when (stih) {
                1 -> res = "4 Цар 22.1-2"
                3 -> res = "4 Цар 23.4; 2 Пар 34.4"
                4 -> res = "4 Цар 23.25"
                8 -> res = "4 Цар 25.9"
                9 -> res = "Иер 1.5, 10"
                10 -> res = "Иез 1.4"
                11 -> res = "Иез 13.13"
                13 -> res = "1 Езд 3.2; Агг 2.23"
                14 -> res = "1 Езд 3.2; Зах 3.1"
                15 -> res = "Неем 7.1"
                16 -> res = "Быт 5.24; Евр 11.5"
                17 -> res = "Быт 50.18, 20, 22; Нав 24.32"
            }
        }
        if (glava == 50) {
            when (stih) {
                1 -> res = "2 Мак 3.4"
                12 -> res = "Исх 28.4"
                18 -> res = "Чис 10.10"
                22 -> res = "Чис 6.23"
                24 -> res = "Иоил 2.21"
                26 -> res = "3 Цар 8.23-24"
                28 -> res = "Ин 4.9"
            }
        }
        if (glava == 51) {
            if (stih == 34) {
                res = "Мф 11.29"
            }
        }
        return res
    }

    fun kniga28(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                2 -> res = "Втор 32.1"
                3 -> res = "Втор 32.6"
                4 -> res = "Ис 30.9; 57.3; Дан 9.5"
                5 -> res = "Иер 2.30; 4.19"
                6 -> res = "Втор 28.35"
                7 -> res = "Втор 28.51-52; Ис 5.5"
                9 -> res = "Плач 3.22; Рим 9.29; Быт 19.24; Иер 23.14"
                11 -> res = "Притч 15.8; Ис 66.3; Иер 6.20; Ам 5.21-22"
                12 -> res = "Иер 7.22"
                13 -> res = "Притч 21.27"
                15 -> res = "Притч 1.28; Иер 14.12; Иез 8.18; Мих 3.4; Ис 59.3"
                16 -> res = "Пс 33.15; 1 Пет 3.11"
                17 -> res = "Пс 81.4"
                18 -> res = "Ис 41.1; 43.25; 44.22"
                19 -> res = "Лев 25.18"
                21 -> res = "Мф 23.34-35, 37"
                22 -> res = "Иер 6.30; Иез 22.18"
                23 -> res = "Ос 9.15; Исх 22.22; Иер 5.28; Зах 7.10"
                24 -> res = "Втор 28.63"
                25 -> res = "Ис 1.22; Мал 3.2-3"
                26 -> res = "Иер 33.16"
                28 -> res = "Иов 31.3; Пс 1.6"
                29 -> res = "Ис 65.3; Ос 4.13"
                30 -> res = "Пс 1.3"
                31 -> res = "Мал 4.1"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Ис 56.7; Мих 4.1; Иер 3.17"
                3 -> res = "Мих 4.2"
                4 -> res = "Ин 4.27; Иоил 3.10; Зах 9.10"
                6 -> res = "Иер 12.7"
                8 -> res = "Ис 44.10; Иер 2.28"
                10 -> res = "Иер 23.24; Ам 9.2"
                11 -> res = "Ис 5.15"
                12 -> res = "Иер 46.10; Иоил 2.10; Мал 4.1"
                14 -> res = "Ис 41.15; Зах 4.7"
                15 -> res = "Ис 30.25"
                17 -> res = "Ис 5.15-16"
                19 -> res = "Ос 10.8; Лк 23.30; Откр 6.16"
                20 -> res = "Ис 31.7"
                22 -> res = "2 Пар 35.21; Иов 27.3"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Иез 4.16; 5.16"
                3 -> res = "4 Цар 24.14"
                4 -> res = "Еккл 10.16"
                5 -> res = "Иез 22.29"
                7 -> res = "Исх 15.26"
                9 -> res = "Быт 13.13; 18.20"
                10 -> res = "Ис 32.17; Иак 3.18"
                11 -> res = "Иер 25.14"
                13 -> res = "Пс 97.9"
                15 -> res = "Ис 1.17; Ам 2.7"
                16 -> res = "1 Тим 2.9"
                25 -> res = "Плач 1.4"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Быт 30.23"
                2 -> res = "Иер 23.5; Ин 1.9"
                3 -> res = "Лк 10.20"
                4 -> res = "Иез 24.6; Ин 16.8; Еф 5.26"
                5 -> res = "Исх 13.21; Ис 10.32; 1 Кор 10.1"
                6 -> res = "Ис 25.4; Ос 14.8; Мф 7.25"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Иер 2.21; Мф 21.33; Мк 12.1; Лк 20.9"
                2 -> res = "Иер 8.13"
                5 -> res = "Пс 79.13; 1 Езд 9.9; Ос 2.12"
                6 -> res = "Ис 1.30; Зах 14.17"
                7 -> res = "Пс 79.16"
                8 -> res = "Мих 2.2"
                11 -> res = "Притч 23.30; Еккл 10.16; Лк 6.25"
                12 -> res = "Ис 28.7; Ам 6.5"
                14 -> res = "Ис 30.33"
                15 -> res = "Ис 2.11"
                17 -> res = "Ис 14.30"
                18 -> res = "Притч 5.22; Мих 7.3"
                19 -> res = "Иер 17.15; Ам 5.18; 2 Пет 3.4"
                20 -> res = "4 Цар 17.9; Ам 6.12"
                21 -> res = "Притч 3.7; Рим 12.16"
                22 -> res = "Притч 31.4"
                23 -> res = "Притч 17.15"
                24 -> res = "Ис 9.18"
                25 -> res = "Ис 9.12; 10.6"
                26 -> res = "Лев 26.25; Ис 13.2"
                28 -> res = "Иер 4.13"
                29 -> res = "Иов 4.10; Иер 2.15; 4.7; Иез 32.2"
                30 -> res = "Иов 18.5; Ис 8.22"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Исх 24.10; 2 Пар 26.23; Ин 12.41"
                2 -> res = "Дан 7.9-10"
                3 -> res = "Откр 3.7; 4.8; Лк 1.49"
                4 -> res = "Иез 10.4"
                5 -> res = "Исх 30.20; Втор 5.25; Суд 13.22"
                6 -> res = "Евр 13.10"
                7 -> res = "Иер 1.9; Дан 10.16"
                8 -> res = "1 Тим 3.1"
                9 -> res = "Иер 5.21; Мф 13.14; Мк 4.12; Лк 8.10; Ин 12.40; Деян 28.26; Рим 11.8"
                11 -> res = "2 Пар 33.11"
                13 -> res = "Зах 8.12; 13.8; Ис 53.10; Ос 2.23"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "4 Цар 16.5"
                2 -> res = "Пс 77.9; 79.3"
                3 -> res = "Ис 36.2"
                7 -> res = "Ис 8.10"
                8, 16 -> res = "Ис 8.4"
                9 -> res = "Ис 28.16"
                11 -> res = "Ис 38.7; Лк 2.12"
                12 -> res = "Втор 6.16"
                14 -> res = "Мф 1.23; Лк 1.31"
                17 -> res = "4 Цар 15.29"
                18 -> res = "Ис 5.26"
                20 -> res = "4 Цар 16.7-8"
                23 -> res = "Лев 26.22"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Ис 30.8; Авв 2.2"
                4 -> res = "Ис 7.8, 16"
                6 -> res = "Неем 3.15; Ин 9.11"
                7 -> res = "Откр 17.15; Ис 10.8"
                8 -> res = "Ис 30.28"
                10 -> res = "Ис 7.7"
                11 -> res = "Ис 42.8"
                12 -> res = "Мф 10.26"
                13 -> res = "1 Пет 3.15"
                14 -> res = "Ис 28.16"
                15 -> res = "Ис 28.13"
                16 -> res = "Ис 29.11; 54.13; Ин 6.45"
                18 -> res = "Евр 2.13"
                19 -> res = "Лев 19.31; Втор 18.11, 15"
                20 -> res = "Мф 13.52; Деян 28.23"
                21 -> res = "Пс 58.16"
                22 -> res = "Ис 5.30"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Мф 4.15"
                2 -> res = "Мф 4.16; Еф 5.14; Лк 1.79"
                3 -> res = "Рим 15.9; Пс 118.162"
                4 -> res = "Ис 10.26; 14.5; Суд 7.23"
                5 -> res = "Иез 39.9"
                6 -> res = "Лк 2.7; Ин 3.16; 1 Ин 4.9; Суд 13.18"
                7 -> res = "Лк 1.32-33"
                12 -> res = "Ис 5.25"
                13 -> res = "Иер 5.3; Пс 33.5"
                14 -> res = "Ис 19.15"
                15 -> res = "Ис 3.3"
                16 -> res = "Мф 15.14; Лк 6.39"
                17 -> res = "Ис 5.25; 10.6"
                18 -> res = "Ис 5.24; 10.16; Наум 1.10"
                19 -> res = "Соф 1.18"
                21 -> res = "Ис 9.12; 11.13; Гал 5.15"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Мф 23.4"
                2 -> res = "Исх 22.22; Иер 7.6"
                3, 4 -> res = "Ис 9.12"
                5 -> res = "Ис 7.20; 36.1"
                6 -> res = "Ис 5.25; 9.17; Зах 10.5"
                7 -> res = "Деян 4.28; 13.27"
                8 -> res = "Ис 8.7"
                9 -> res = "Быт 10.10; Ис 36.19; Иер 46.2"
                12 -> res = "4 Цар 19.35; Ис 37.36"
                13 -> res = "Авв 1.16"
                16 -> res = "Ис 5.17; Ам 4.1"
                18 -> res = "Иер 21.14"
                19 -> res = "Ис 10.33"
                20 -> res = "Иер 3.23; Зах 13.9"
                21 -> res = "Ис 9.6"
                22 -> res = "Рим 9.27"
                23 -> res = "Ис 28.22"
                24 -> res = "Мих 7.14; Исх 1.14"
                25 -> res = "Ис 54.9"
                26 -> res = "Суд 7.25; Пс 82.12; Ис 9.4"
                28 -> res = "1 Цар 14.5"
                29 -> res = "Нав 18.25"
                30 -> res = "Суд 18.14; Нав 21.18"
                33 -> res = "Ис 10.19"
                34 -> res = "Ис 9.18"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Лк 3.32; Деян 13.22; Рим 15.12"
                2 -> res = "Ис 61.1"
                3 -> res = "Ис 2.4"
                4 -> res = "Иов 4.9; 2 Фес 2.8"
                5 -> res = "Пс 44.5"
                6 -> res = "Ис 65.25"
                8 -> res = "1 Кор 3.1; Пс 57.5"
                9 -> res = "Ам 5.24"
                10 -> res = "Рим 15.12"
                12 -> res = "Мф 15.24; Лк 21.28; Ин 10.16"
                13 -> res = "Ос 1.11"
                14 -> res = "Втор 32.43; Ис 60.7; Зах 8.13"
                16 -> res = "Исх 14.29"
            }
        }
        if (glava == 12) {
            when (stih) {
                2 -> res = "Исх 15.2; Пс 117.14"
                3 -> res = "Ин 4.14; 7.38"
                4 -> res = "1 Пар 16.8"
                5 -> res = "Пс 46.7; Ис 24.14"
                6 -> res = "Ис 54.1; Пс 70.22"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Иер 30.1; 50.1"
                2 -> res = "Ис 5.26; 18.3; Иер 4.6"
                3 -> res = "Иер 22.7"
                6 -> res = "Иоил 1.15"
                8 -> res = "4 Цар 19.3; Пс 47.7; Ис 21.3"
                9 -> res = "Ис 22.5"
                10 -> res = "Ис 24.23; Иез 32.7; Иоил 2.31; 3.15; Мф 24.29; Мк 13.24; Лк 21.25"
                14 -> res = "3 Цар 22.17; Мк 6.34"
                16 -> res = "Пс 136.9; Иер 8.10"
                17 -> res = "Иер 51.11; Дан 5.31"
                19 -> res = "Быт 19.24-25; Иер 50.40; Откр 18.2"
                21 -> res = "Иер 50.39"
            }
        }
        if (glava == 14) {
            when (stih) {
                2 -> res = "Авд 1.17; Откр 13.10"
                4 -> res = "Иер 50.23"
                5 -> res = "Пс 124.3; Ис 9.4"
                8 -> res = "4 Цар 19.23"
                9 -> res = "Иез 31.16; Иер 50.9; Дан 8.5"
                10 -> res = "Иез 32.21"
                11 -> res = "Дан 4.29-31; Лк 1.52"
                12 -> res = "Дан 8.10"
                13 -> res = "1 Ин 2.16; Иез 40.2"
                15 -> res = "Иез 32.23"
                20 -> res = "Иов 18.19"
                21 -> res = "Исх 20.5"
                23 -> res = "Иер 25.12"
                25 -> res = "4 Цар 19.35"
                27 -> res = "2 Пар 20.6; Иов 9.12; Дан 4.32"
                28 -> res = "2 Пар 28.27"
                29 -> res = "2 Пар 26.6; Иер 48.17; 4 Цар 18."
                30 -> res = "Ис 5.17"
                32 -> res = "Пс 86.2; 101.17"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Иер 48.13"
                2 -> res = "Иер 48.37; Иез 7.18"
                3 -> res = "Ис 22.1"
                5 -> res = "Иер 48.34"
                6 -> res = "Чис 32.36"
                8 -> res = "Чис 21.15; 2 Цар 8.2; 4 Цар 1.1"
            }
        }
        if (glava == 16) {
            when (stih) {
                5 -> res = "Дан 7.14, 27; Мих 4.7; Лк 1.32"
                7 -> res = "Иер 48.20"
                8 -> res = "Иер 48.32"
                10 -> res = "Иер 48.33"
                11 -> res = "Иер 4.19; 48.36; Плач 1.20"
                13 -> res = "Ис 15.1"
                14 -> res = "Ис 21.16"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Ис 7.8"
                5 -> res = "Ис 24.13"
                6 -> res = "Ис 1.9; Иер 6.9"
                8 -> res = "Ис 2.20"
                10 -> res = "Втор 32.32; Мф 15.13"
                12 -> res = "4 Цар 19.35; Ис 37.36"
                13 -> res = "Пс 1.4"
                14 -> res = "4 Цар 19.35"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "Ис 20.3; Иез 30.4; Наум 3.9"
                3 -> res = "Ис 5.26; Иер 4.5-6; 6.1"
                4 -> res = "Ис 42.14"
                6 -> res = "Иез 31.13"
                7 -> res = "Ис 18.2; 19.19; 2 Пар 6.6"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "Иер 46.2; Иез 29.2; 30.18; Ис 10.10"
                2 -> res = "2 Пар 20.23; Иез 38.21"
                3 -> res = "Ис 8.10; 4 Цар 1.2; Иез 21.21"
                5 -> res = "Иез 30.12"
                11 -> res = "Чис 13.23; Пс 77.12; Ис 30.4"
                13 -> res = "Иер 2.16; Ос 9.6"
                14 -> res = "3 Цар 22.21"
                15 -> res = "Ис 9.14"
                18 -> res = "Втор 10.20; Ис 48.1; Иер 12.16"
                19 -> res = "Ис 18.7; Быт 28.18; Исх 24.4"
                20 -> res = "Нав 24.27"
                21 -> res = "Пс 50.21; Мал 3.3; 1 Пет 2.5"
                23 -> res = "Ис 11.16; 35.8; 57.14; Деян 15.17"
                25 -> res = "Ос 2.1"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "4 Цар 18.17"
                2 -> res = "4 Цар 1.8; Зах 13.4"
                6 -> res = "4 Цар 17.4"
            }
        }
        if (glava == 21) {
            when (stih) {
                2 -> res = "Ис 22.6; Иер 49.35; Деян 2.9"
                3 -> res = "Иер 4.19; Мих 1.8; Ис 13.8"
                4 -> res = "Ис 15.5"
                5 -> res = "Иер 6.4-5"
                6 -> res = "Пс 120.4"
                8 -> res = "Авв 2.1"
                9 -> res = "Иер 51.8; Откр 14.8; 18.2, 10"
                10 -> res = "Ис 25.10; Иер 51.33; Мих 4.13"
                13 -> res = "Иер 25.23"
                14 -> res = "Быт 25.3, 15"
                16 -> res = "Ис 16.14; Иер 49.28"
                17 -> res = "Ис 22.25; 25.8"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "Ис 15.3"
                2 -> res = "Ис 27.10"
                4 -> res = "Иер 4.20"
                5 -> res = "Ис 13.5"
                6 -> res = "Ис 21.2; Иер 49.35"
                8 -> res = "3 Цар 7.2; 10.17"
                10 -> res = "Иер 33.4"
                11 -> res = "Ис 7.3"
                12 -> res = "Мих 1.16"
                13 -> res = "Прем 2.6; Ис 56.12; 1 Кор 15.32"
                14 -> res = "Мф 12.32; Евр 6.4"
                18 -> res = "Пс 48.11; Иер 22.18"
                20 -> res = "4 Цар 18.18"
                22 -> res = "Иов 12.14; Откр 3.7"
                23 -> res = "1 Езд 9.8; Зах 10.4"
                25 -> res = "Ис 21.17"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "Иер 47.4; Чис 24.24"
                4 -> res = "Иез 28.21"
                8 -> res = "Откр 18.23"
                11 -> res = "Иов 12.24"
                16 -> res = "Иез 26.13"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "Иер 13.24; 18.17; Иез 5.10"
                2 -> res = "Ос 4.9"
                5 -> res = "Соф 1.3"
                6 -> res = "Ис 1.9"
                8 -> res = "Иер 16.9; Иез 26.13; Ос 2.11"
                13 -> res = "Ис 17.5"
                14 -> res = "Ис 12.5"
                18 -> res = "Иер 48.44"
                19 -> res = "Иер 2.37; 32.5"
                20 -> res = "Ис 19.14; Иов 27.18"
                21 -> res = "Ис 5.14; 40.2"
                22 -> res = "Иез 32.18"
                23 -> res = "Ис 13.10"
            }
        }
        if (glava == 25) {
            when (stih) {
                1 -> res = "Исх 15.2; Ис 28.29"
                2 -> res = "4 Цар 19.25; Ис 26.5"
                3 -> res = "Иов 12.14"
                4 -> res = "Ис 4.6; Иер 16.19"
                5 -> res = "Ис 18.4"
                6 -> res = "Мф 22.2; Лк 14.16"
                8 -> res = "1 Кор 15.54; Откр 7.17; 21.4"
                9 -> res = "Ос 13.14; Ин 3.36; Евр 2.14"
                10 -> res = "Ис 41.15; Зах 10.5"
            }
        }
        if (glava == 26) {
            when (stih) {
                1 -> res = "Пс 45.2; 124.1; Притч 18.11"
                2 -> res = "Пс 117.19"
                3 -> res = "Ис 27.5"
                4 -> res = "Втор 32.4"
                5 -> res = "Ис 25.12"
                6 -> res = "Ис 28.3"
                8 -> res = "Пс 43.18"
                9 -> res = "Пс 76.7"
                10 -> res = "Ис 5.12; Деян 12.19"
                11 -> res = "Ис 33.3; Мф 21.15"
                12 -> res = "Рим 8.28"
                14 -> res = "Откр 20.5"
                16 -> res = "Пс 17.7"
                17 -> res = "Ин 16.21; 4 Цар 19.3; Ис 13.8"
                19 -> res = "4 Цар 4.35; Иез 37.3"
                20 -> res = "Пс 29.6; Ис 54.8"
                21 -> res = "Мих 1.3"
            }
        }
        if (glava == 27) {
            when (stih) {
                1 -> res = "Иов 26.13; Откр 19.20"
                6 -> res = "Пс 71.16; Ис 37.31"
                7 -> res = "2 Цар 7.14; 2 Кор 4.17"
                8 -> res = "Иер 10.24; 30.11; 46.28"
                9 -> res = "Зах 3.4; Лев 26.30"
                10 -> res = "4 Цар 19.25; Ис 24.10"
                11 -> res = "Иов 24.20; Иер 5.21"
                13 -> res = "Ис 2.2; Иез 20.40"
            }
        }
        if (glava == 28) {
            when (stih) {
                2 -> res = "4 Цар 17.3"
                3 -> res = "Дан 7.7; Мих 7.10"
                4 -> res = "Ис 1.30"
                5 -> res = "Притч 4.9; Ис 62.3; Иез 16.12"
                7 -> res = "Притч 20.1; Ос 4.11; 9.7"
                10 -> res = "Ис 42.20"
                11 -> res = "1 Кор 14.21"
                12 -> res = "Мф 11.28-29"
                13 -> res = "Ис 8.15"
                14 -> res = "Деян 13.40"
                15 -> res = "Иер 5.12; Ис 29.15"
                16 -> res = "Пс 117.22; Ис 8.14; Мф 21.42; Мк 12.10; Лк 20.17; Деян 4.11; 1 Пет 2.7; Рим 9.33"
                18 -> res = "Ис 28.15; Мф 7.27"
                19 -> res = "Мф 6.13"
                21 -> res = "2 Цар 5.20; 1 Пар 14.11; Нав 10.12"
                22 -> res = "Ис 10.23"
                23 -> res = "Ис 34.1"
                26 -> res = "Прем 3.5; Вар 3.37"
                27 -> res = "Ис 25.10"
                29 -> res = "Ис 55.8; Иер 32.19"
            }
        }
        if (glava == 29) {
            when (stih) {
                1 -> res = "2 Цар 5.9"
                3 -> res = "Иер 6.3; Иез 17.17; Лк 19.43"
                4 -> res = "Лев 19.31; Ис 8.19"
                5 -> res = "Пс 34.5"
                6 -> res = "Ис 30.30"
                7 -> res = "Ис 30.30; Пс 72.20"
                10 -> res = "Иер 51.39; Рим 11.8"
                11 -> res = "Ис 8.16; Иез 20.49; Дан 12.4"
                12 -> res = "2 Кор 3.14"
                13 -> res = "Мф 15.8; Мк 7.6"
                14 -> res = "Иер 49.7; Авд 1.8; 1 Кор 1.19"
                15 -> res = "Сир 23.24"
                16 -> res = "Ис 45.9; Иер 18.6"
                17 -> res = "Ис 32.15"
                18 -> res = "Мф 15.30; Ис 42.18; Евр 10.7"
                20 -> res = "Откр 19.17; Мих 2.1"
                21 -> res = "Ам 5.10"
                22 -> res = "Быт 11.31; 48.16"
                23 -> res = "Пс 99.3; Еф 2.10; Евр 2.10"
            }
        }
        if (glava == 30) {
            when (stih) {
                1 -> res = "Лк 12.17"
                2 -> res = "4 Цар 18.21; Иер 2.18; 37.7"
                3, 5 -> res = "Иер 2.36"
                4 -> res = "Ис 19.13; Иер 2.16"
                8 -> res = "Ис 8.1"
                9 -> res = "Деян 7.52"
                10 -> res = "Ам 2.12"
                11 -> res = "Ис 1.4"
                12 -> res = "Пс 61.11; Ис 47.10"
                13 -> res = "Ис 29.5"
                14 -> res = "Пс 2.9"
                15 -> res = "Плач 3.26"
                16 -> res = "Ос 14.4"
                17 -> res = "Лев 26.36"
                18 -> res = "Лк 1.54; Рим 2.4; Притч 16.20; Иер 17.7"
                19 -> res = "Пс 90.15; Ис 58.9"
                20 -> res = "Пс 79.6"
                21 -> res = "Втор 5.32; 28.14; Притч 4.27"
                22 -> res = "Лев 15.19"
                23 -> res = "Втор 11.14"
                25 -> res = "Ис 2.15; 41.18"
                26 -> res = "Иер 4.23; Иоил 2.10; Откр 21.23"
                27 -> res = "Иез 22.21; Исх 24.17; Втор 4.24"
                28 -> res = "2 Цар 22.16; Ис 8.8"
                29 -> res = "Пс 41.5"
                30 -> res = "Ис 29.6; Откр 20.15"
                31 -> res = "Пс 28.4"
                33 -> res = "Откр 19.20; Мф 25.41"
            }
        }
        if (glava == 31) {
            when (stih) {
                1 -> res = "Ис 30.1; Иер 2.36; Ос 8.13"
                2 -> res = "Ам 3.6; Пс 9.21"
                3 -> res = "Иер 17.5; Иез 28.9-10; Плач 4.17"
                4 -> res = "Откр 20.8"
                5 -> res = "Втор 32.11; Мф 23.37"
                6 -> res = "Иер 3.14"
                7 -> res = "Ис 2.20"
                8 -> res = "Ис 37.36"
                9 -> res = "1 Езд 1.3"
            }
        }
        if (glava == 32) {
            when (stih) {
                1 -> res = "Иер 23.5; 33.15; Ис 11.5"
                2 -> res = "Пс 142.6"
                4 -> res = "Лк 10.21"
                6 -> res = "1 Цар 24.14"
                7 -> res = "1 Цар 8.3; Притч 29.4; Деян 20.35"
                8 -> res = "Лк 6.45"
                10 -> res = "Лев 26.34"
                13 -> res = "Ис 34.13; Ос 9.6"
                14 -> res = "2 Пар 27.3"
                15 -> res = "Ис 29.17"
                16 -> res = "Ис 35.1"
                17 -> res = "Рим 5.1"
                18 -> res = "Иер 33.16; Иез 34.27"
                20 -> res = "Пс 71.16"
            }
        }
        if (glava == 33) {
            when (stih) {
                1 -> res = "Пс 136.8; Иер 30.16; Авд 1.10"
                2 -> res = "Пс 16.7"
                3 -> res = "Пс 67.2; Ис 26.11"
                5 -> res = "Ис 9.7; 11.4"
                6 -> res = "4 Цар 18.5; Иер 10.16"
                7 -> res = "2 Пар 36.15"
                8 -> res = "Ис 37.2"
                10 -> res = "Пс 101.14; Ис 33.3"
                11 -> res = "Пс 7.15; Ис 1.31; 47.14"
                12 -> res = "Ис 9.18"
                13 -> res = "Ис 60.4; Еф 2.13"
                14 -> res = "Деян 5.11; Втор 5.24"
                15 -> res = "Пс 14.2"
                16 -> res = "Авв 3.19; Пс 17.3"
                17 -> res = "Пс 44.3; 92.1; Мк 9.2"
                18 -> res = "1 Кор 1.20"
                19 -> res = "Втор 28.49; Иер 5.15; Иез 3.5"
                20 -> res = "Мф 16.18; Пс 124.1"
                22 -> res = "Пс 43.5; 57.12; Ис 43.15; Иак 4.12"
                23 -> res = "Ис 35.6"
                24 -> res = "Ис 40.29; 45.24; 1 Пет 1.3"
            }
        }
        if (glava == 34) {
            when (stih) {
                1 -> res = "Ис 28.23"
                2 -> res = "Иер 25.33"
                3 -> res = "Иез 39.17; Откр 19.18"
                4 -> res = "Дан 8.10; Мк 13.24; 2 Пет 3.10; Откр 6.14"
                5 -> res = "Иер 46.10; Ис 63.1"
                6 -> res = "Соф 1.7"
                7 -> res = "Пс 21.22; Ам 4.1"
                8 -> res = "Ис 63.4"
                10 -> res = "Ис 66.24; Мф 5.26; Мк 9.44"
                11 -> res = "Соф 2.14; Откр 18.2"
                13 -> res = "Ис 32.13; Ос 9.6; Иер 9.11"
                14 -> res = "Откр 18.2"
                16 -> res = "Втор 28.15; Нав 21.45; Иез 12.24"
                17 -> res = "Пс 36.9"
            }
        }
        if (glava == 35) {
            when (stih) {
                1 -> res = "Ис 32.16"
                2 -> res = "3 Цар 4.33; 18.9; Ин 1.14"
                3 -> res = "Евр 12.12"
                4 -> res = "Лк 1.70; Ис 40.1"
                5 -> res = "Мф 9.30; 11.5; 15.30; Лк 7.22; Ин 9.6-7"
                6 -> res = "Ин 5.8-9; 7.38; Деян 3.8; Мф 9.32-33; 21.14; Ис 41.18"
                8 -> res = "Ин 14.6"
                9 -> res = "1 Пет 5.8"
                10 -> res = "Ис 51.11; 61.7; 66.14"
            }
        }
        if (glava == 36) {
            when (stih) {
                1 -> res = "4 Цар 18.13; 2 Пар 32.1; Сир 48.20"
                2 -> res = "Ис 7.3"
                5 -> res = "4 Цар 18.7"
                6 -> res = "Иез 29.6-7"
                9 -> res = "4 Цар 18.24"
                10 -> res = "2 Пар 35.21"
                11 -> res = "2 Пар 32.18"
                14 -> res = "4 Цар 18.29"
                16 -> res = "4 Цар 18.31"
                18 -> res = "4 Цар 18.33; Ис 10.9; 37.12"
                19 -> res = "Чис 13.22; 4 Цар 17.31"
                21 -> res = "4 Цар 18.36"
            }
        }
        if (glava == 37) {
            when (stih) {
                1 -> res = "4 Цар 19.1"
                3 -> res = "4 Цар 19.3; Ос 13.13"
                9 -> res = "4 Цар 19.9"
                13 -> res = "Ис 36.19"
                14 -> res = "4 Цар 19.14"
                16 -> res = "Пс 79.2; Ис 42.5; Деян 4.24"
                20 -> res = "2 Пар 20.12"
                21 -> res = "4 Цар 19.20"
                24 -> res = "Иер 22.27"
                25 -> res = "4 Цар 19.24"
                27 -> res = "Пс 36.2; 128.6"
                28 -> res = "Иер 48.30"
                31 -> res = "Иез 12.16; Ам 2.9"
                32 -> res = "4 Цар 19.31; Ис 9.7"
                33 -> res = "4 Цар 19.32"
                35 -> res = "4 Цар 20.6"
                36 -> res = "4 Цар 19.35; Сир 48.24; Ис 10.12; 1 Мак 7.41; 2 Мак 8.19; 15.22; 2 Пар 32.21"
                38 -> res = "Тов 1.21"
            }
        }
        if (glava == 38) {
            when (stih) {
                1 -> res = "4 Цар 20.1; 2 Пар 32.24"
                2 -> res = "Сир 38.9"
                3 -> res = "Мф 5.48"
                5 -> res = "4 Цар 20.5; Евр 11.34"
                8 -> res = "Сир 48.26"
                12 -> res = "2 Пет 1.13; Иов 30.22"
                13 -> res = "Иов 4.21"
                17 -> res = "Ин 3.16; Иез 18.22"
                18 -> res = "Пс 6.6; 113.25; Вар 2.17"
                19 -> res = "4 Цар 20.18"
                20 -> res = "Пс 26.6"
                22 -> res = "Ис 38.8"
            }
        }
        if (glava == 39) {
            when (stih) {
                1 -> res = "4 Цар 20.12"
                2 -> res = "2 Пар 32.25"
                7 -> res = "Дан 1.3-4"
                8 -> res = "4 Цар 20.19"
            }
        }
        if (glava == 40) {
            when (stih) {
                1 -> res = "Ис 35.4; 52.9; Лк 2.10"
                2 -> res = "Иер 16.18"
                3 -> res = "Мф 3.3; Мк 1.3; Лк 3.4; Ин 1.23"
                4 -> res = "Лк 18.14; Ис 42.16"
                5 -> res = "Деян 11.14"
                6 -> res = "Иов 14.2; Пс 102.15; Сир 14.18; Иак 1.10; 1 Пет 1.24"
                8 -> res = "Пс 118.89; Мф 24.35; 1 Пет 1.25"
                10 -> res = "Ин 1.27; Ис 62.11"
                11 -> res = "Иез 34.23; Ин 10.11"
                12 -> res = "Ис 48.13"
                13 -> res = "Прем 9.13; Сир 1.6; Рим 11.34; 1 Кор 2.14, 16"
                15 -> res = "Пс 102.14; Дан 4.32; Сир 7.31"
                17 -> res = "Пс 38.6"
                18 -> res = "Деян 17.29"
                19 -> res = "Ис 44.12; Прем 13.11; 15.9"
                22 -> res = "Иер 10.12"
                23 -> res = "Иов 12.21"
                25 -> res = "Ис 40.18"
                26 -> res = "Пс 146.4"
                27 -> res = "Иов 34.5, 12"
                28 -> res = "Ис 42.5; 45.11"
                29 -> res = "Ис 33.24; 2 Кор 12.9; Кол 1.11 "
                31 -> res = "Иов 29.20; Ис 41.1"
            }
        }
        if (glava == 41) {
            when (stih) {
                1 -> res = "Ис 1.18; 40.31; Иер 2.35"
                2 -> res = "Деян 7.4"
                4 -> res = "Ис 43.10; Откр 1.17; 22.13"
                7 -> res = "Иер 10.4"
                8 -> res = "Втор 7.8; Пс 134.4; Ис 44.1; Лк 1.54; Иак 2.23"
                10 -> res = "Быт 15.1; Ис 43.1"
                11 -> res = "Исх 23.22; Иер 30.16; Зах 12.3"
                13 -> res = "Пс 72.23"
                14 -> res = "Лк 12.32"
                15 -> res = "Мих 4.13"
                16 -> res = "Ос 4.19"
                18 -> res = "Ис 30.25; Пс 106.35"
                19 -> res = "Ис 55.13"
                20 -> res = "Ис 44.7"
                23 -> res = "Иер 10.5"
                27 -> res = "Мф 23.34"
                29 -> res = "Пс 95.5; Иер 10.3"
            }
        }
        if (glava == 42) {
            when (stih) {
                1 -> res = "Мф 12.18"
                3 -> res = "Ин 20.27; Ис 43.17"
                5 -> res = "Ис 37.16"
                6 -> res = "Ис 49.6; Деян 13.47"
                7 -> res = "Ис 61.1; Лк 4.18"
                8 -> res = "Ис 48.11"
                10 -> res = "Откр 5.9"
                13 -> res = "Ис 59.1"
                14 -> res = "Ис 57.11; 62.1; 65.6"
                16 -> res = "Ис 35.5"
                17 -> res = "Пс 96.7"
                18 -> res = "Ис 29.18; Иез 12.2"
                19 -> res = "Мф 15.14"
                20 -> res = "Иез 33.31"
                21 -> res = "Зах 8.8"
                25 -> res = "Иер 21.14"
            }
        }
        if (glava == 43) {
            when (stih) {
                1 -> res = "Ис 41.8"
                2 -> res = "Пс 68.2; 90.15; Мф 8.26"
                4 -> res = "Мал 1.2"
                5 -> res = "Мф 8.11; Зах 8.7"
                7 -> res = "Втор 28.10; Иер 14.8; Еф 1.12"
                8 -> res = "Ис 42.18; Лк 1.79"
                9 -> res = "Ис 42.9"
                10 -> res = "Ис 41.4"
                11 -> res = "Ос 13.4"
                13 -> res = "Иов 9.12; Ис 14.27"
                15 -> res = "Ис 33.22; 49.7; Ос 3.5"
                16 -> res = "Исх 14.22"
                18 -> res = "Ис 65.17"
                19 -> res = "2 Кор 5.17; Откр 21.5"
                22 -> res = "Ин 15.16; 1 Ин 4.10"
                24 -> res = "Ис 53.12; Лк 24.27"
                25 -> res = "Ис 44.22"
            }
        }
        if (glava == 44) {
            when (stih) {
                1 -> res = "Ис 43.10"
                2 -> res = "Иер 30.10; 46.27"
                3 -> res = "Иоил 2.28; Ин 7.38; Деян 2.17"
                4 -> res = "Пс 1.3"
                5 -> res = "Ам 9.12; Откр 3.12"
                6 -> res = "Ис 41.4; 48.12; Откр 1.17; 22.13"
                7 -> res = "Ис 42.9; 4 Цар 19.25; Деян 17.26"
                8 -> res = "Втор 4.35; Ис 45.5"
                10 -> res = "Ис 2.8; 45.16"
                12 -> res = "Ис 40.19; 41.6-7"
                13 -> res = "Прем 13.11; Иер 10.3"
                17 -> res = "Ис 42.17"
                18 -> res = "Лк 10.21"
                22 -> res = "Ис 43.25"
                23 -> res = "Ис 49.13; Иез 6.3"
                24 -> res = "Пс 103.2; Ис 40.22; Иер 51.15"
                25 -> res = "Иов 5.12-13; 1 Кор 1.19"
                26 -> res = "Ис 14.32; Иер 31.4"
                27 -> res = "Исх 14.21; Нав 3.16"
                28 -> res = "3 Цар 13.2; Ис 49.13; Дан 6.28"
            }
        }
        if (glava == 45) {
            when (stih) {
                1 -> res = "2 Пар 36.23; Ис 44.28"
                5 -> res = "Ис 44.8"
                7 -> res = "Быт 1.3; Ам 3.6; Мих 1.12"
                8 -> res = "Ис 61.11; Ос 10.12"
                9 -> res = "Ис 29.16; Иер 18.6; Рим 9.21"
                12 -> res = "Ис 40.28; 42.5; Пс 32.6"
                13 -> res = "Ис 52.3"
                14 -> res = "Ис 13.3; 18.7; Исх 29.46"
                16 -> res = "Ис 44.11"
                17 -> res = "Иез 6.9; 39.7"
                18 -> res = "Ис 42.5; Втор 4.35"
                19 -> res = "Ин 18.20"
                20 -> res = "Ис 46.7; Втор 32.37; Суд 10.14"
                21 -> res = "Ис 42.9; Втор 4.35; 2 Цар 7.22"
                23 -> res = "Рим 14.11; Флп 2.10"
                24 -> res = "Ис 65.16"
                25 -> res = "Иер 4.2; 23.6; 2 Кор 5.21"
            }
        }
        if (glava == 46) {
            when (stih) {
                1 -> res = "Иер 50.2"
                4 -> res = "Пс 70.9, 18"
                5 -> res = "Ис 40.18; 41.7"
                6 -> res = "Суд 17.4"
                7 -> res = "Иер 10.5; Вар 4.7"
                9 -> res = "Втор 32.39"
                10 -> res = "Пс 32.11; Евр 6.17"
                11 -> res = "Пс 32.9"
            }
        }
        if (glava == 47) {
            when (stih) {
                1 -> res = "Иер 13.18; 48.18; Втор 28.56"
                2 -> res = "Суд 16.21"
                3 -> res = "Наум 3.5"
                4 -> res = "1 Тим 4.10"
                6 -> res = "Зах 1.15; 2 Цар 24.14"
                7 -> res = "Откр 18.7"
                8 -> res = "Соф 2.15"
                9 -> res = "Ис 51.19"
                10 -> res = "Пс 61.11; Ис 30.12; Иез 28.2"
                14 -> res = "Ис 33.11; Иов 31.12"
            }
        }
        if (glava == 48) {
            when (stih) {
                1 -> res = "Иер 4.2"
                2 -> res = "Иер 25.29; Дан 9.18; Тит 1.16"
                4 -> res = "2 Пар 30.8; Иер 5.3; Иез 2.4; 3.7"
                8 -> res = "Пс 57.5; Зах 7.12"
                9 -> res = "Чис 14.8; Пс 105.45"
                10 -> res = "Зах 13.9; Мал 3.3; 1 Пет 1.7"
                11 -> res = "Ис 42.8"
                12 -> res = "Ис 41.4; 44.6"
                13 -> res = "Пс 101.26; Ис 40.28; Рим 4.17"
                16 -> res = "Втор 30.11; Ин 1.2; 15.26"
                17 -> res = "Ис 45.19"
                18 -> res = "Втор 5.29; Пс 80.15; Ис 66.12"
                20 -> res = "Иер 50.8; Откр 18.4"
                21 -> res = "Исх 17.6; Чис 20.10-11; Пс 77.15; 104.41; Прем 11.4; 1 Кор 10.4"
                22 -> res = "Ис 57.21"
            }
        }
        if (glava == 49) {
            when (stih) {
                1 -> res = "Ис 45.3-4; Иер 1.5; Мф 1.21"
                2 -> res = "Евр 4.12; Откр 1.16; Ис 51.16"
                3 -> res = "Мф 12.18; Ин 17.4"
                6 -> res = "Ис 42.6; Деян 13.47"
                7 -> res = "Ис 53.3"
                8 -> res = "2 Кор 6.2"
                9 -> res = "Ис 61.1"
                10 -> res = "Откр 7.16"
                11 -> res = "Ис 62.10"
                13 -> res = "Пс 95.11; Откр 12.12; Ис 52.9"
                14 -> res = "Иер 31.20"
                15 -> res = "Мф 7.11; Лк 15.20; Ин 14.18"
                16 -> res = "Пс 50.20"
                18 -> res = "Ис 56.7; 60.4"
                21 -> res = "Ис 60.4"
                22 -> res = "Ис 66.12, 20; Лк 18.15, 17"
                23 -> res = "Ис 60.16"
                24 -> res = "Мф 12.29"
                25 -> res = "Лк 11.22; Ис 49.9"
                26 -> res = "Откр 16.6; Иез 7.27; 21.15"
            }
        }
        if (glava == 50) {
            when (stih) {
                2 -> res = "Чис 11.23; Ис 59.1; 65.2; Наум 1.4"
                3 -> res = "Откр 6.14"
                4 -> res = "Мф 7.29; Мк 1.22"
                5 -> res = "Ин 15.10"
                6 -> res = "Мф 26.67"
                8 -> res = "Рим 8.33"
                9 -> res = "Рим 8.34; Пс 101.27; Ис 51.8"
                10 -> res = "Пс 111.4; Ис 49.23"
            }
        }
        if (glava == 51) {
            when (stih) {
                2 -> res = "Быт 12.1"
                3 -> res = "Иез 36.35; Пс 109.2; Ис 2.3"
                5 -> res = "Ис 59.16"
                6 -> res = "Пс 101.27"
                7 -> res = "Пс 36.31"
                8 -> res = "Ис 51.6"
                9 -> res = "Лк 1.51; Исх 14.14"
                10 -> res = "Исх 14.21"
                11 -> res = "Пс 125.5; Ис 66.14; Ин 16.22"
                12 -> res = "Мф 10.28; Пс 89.6"
                13 -> res = "Иер 51.15"
                15 -> res = "Иов 26.12; Ис 54.5"
                16 -> res = "Ис 49.2"
                17 -> res = "Пс 59.5; Иер 25.15; Иез 23.31"
                19 -> res = "Ис 47.9"
                21 -> res = "Иер 25.18, 27"
                22 -> res = "Ис 51.17"
                23 -> res = "Пс 74.9; 128.3; Ис 49.26"
            }
        }
        if (glava == 52) {
            when (stih) {
                1 -> res = "Ис 60.1; Деян 7.51; Откр 21.27"
                3 -> res = "1 Пет 1.18-19"
                4 -> res = "Быт 46.6"
                5 -> res = "Иез 36.20; Рим 2.24"
                7 -> res = "Пс 67.12; Наум 1.15; Рим 10.15"
                8 -> res = "Иез 3.17"
                9 -> res = "Ис 40.1"
                10 -> res = "Пс 97.2-3"
                11 -> res = "2 Кор 6.17; Откр 18.4"
                12 -> res = "Исх 12.33"
                13 -> res = "Зах 3.8; Мф 12.18; Флп 2.9"
                14 -> res = "Ис 8.14; Лк 2.34"
                15 -> res = "Рим 15.21"
            }
        }
        if (glava == 53) {
            when (stih) {
                1 -> res = "Ис 42.20; Ин 12.38; Рим 10.16"
                2 -> res = "Лк 2.46"
                3 -> res = "Мк 9.12"
                4 -> res = "Пс 109.7; Мф 20.19"
                5 -> res = "Рим 4.25; 1 Кор 15.3; 1 Пет 2.24"
                6 -> res = "Рим 3.12; Ин 3.16"
                7 -> res = "Мф 26.63; 27.12; Мк 14.61; Деян 8.32"
                8 -> res = "Мф 17.23; 1 Кор 15.3"
                9 -> res = "1 Пет 2.22; 1 Ин 3.5"
                10 -> res = "Ин 12.24"
                11 -> res = "Иер 23.6; Деян 7.52; Ин 1.29"
                12 -> res = "Мк 15.28; Лк 22.37"
            }
        }
        if (glava == 54) {
            when (stih) {
                1 -> res = "Лк 23.29; Гал 4.27"
                3 -> res = "Быт 9.27"
                4 -> res = "Зах 8.15"
                5 -> res = "Лк 1.31-32"
                6 -> res = "Ис 62.4"
                7 -> res = "Прем 3.5"
                8 -> res = "Ис 26.20"
                9 -> res = "Быт 9.11"
                10 -> res = "Иер 31.31; Авв 3.6; Иез 34.25"
                12 -> res = "Откр 21.12"
                13 -> res = "Иер 31.34; Ин 6.45; Евр 8.11; Рим 5.1"
                17 -> res = "Лк 21.15; Деян 6.10"
            }
        }
        if (glava == 55) {
            when (stih) {
                1 -> res = "Ин 7.37"
                2 -> res = "Мал 4.2"
                3 -> res = "2 Цар 7.12; Деян 13.34"
                4 -> res = "Втор 18.15"
                5 -> res = "Деян 13.46"
                6 -> res = "Ис 45.19; Иер 29.13; Ос 10.12"
                7 -> res = "Иез 18.23"
                8 -> res = "1 Кор 3.19"
                10 -> res = "Втор 32.2"
                11 -> res = "2 Тим 2.9"
                13 -> res = "Ис 41.19"
            }
        }
        if (glava == 56) {
            when (stih) {
                1 -> res = "Прем 1.1"
                3 -> res = "Втор 23.3; Еф 2.19"
                4 -> res = "Ис 58.13"
                5 -> res = "Ин 1.12; 1 Ин 3.2; Откр 2.17"
                6 -> res = "Ис 60.10; Иез 47.22; Деян 10.35"
                7 -> res = "Ис 2.2; Мф 21.13; Мк 11.17; Лк 19.46"
                8 -> res = "Ин 10.16; Еф 2.13"
                9 -> res = "Иер 7.33"
                10 -> res = "Лк 6.39; Откр 22.15; 2 Пет 2.13"
                11 -> res = "Иер 6.13; 8.10"
                12 -> res = "Ис 22.13; Прем 2.6; 1 Кор 15.32"
            }
        }
        if (glava == 57) {
            when (stih) {
                1 -> res = "Пс 11.2; Мих 7.2"
                2 -> res = "Прем 4.7"
                3 -> res = "Мф 12.39"
                4 -> res = "Рим 9.6"
                5 -> res = "4 Цар 16.4; Иер 2.20"
                7 -> res = "Иез 18.6"
                9 -> res = "Ос 12.1"
                11 -> res = "Пс 49.21; Ис 42.14"
                12 -> res = "Ис 64.6"
                13 -> res = "Пс 14.1; Ис 28.16"
                14 -> res = "Ис 62.10"
                15 -> res = "Пс 137.6; Ис 66.2"
                16 -> res = "Пс 102.9; Соф 3.9; Мих 7.18"
                18 -> res = "Втор 32.39"
                19 -> res = "Ис 52.7; Рим 5.1"
                21 -> res = "Ис 48.22"
            }
        }
        if (glava == 58) {
            when (stih) {
                1 -> res = "Иез 33.7; 2 Тим 4.2"
                2 -> res = "Ис 1.18; Иез 33.17; Мал 3.7"
                3 -> res = "Мф 6.16; Лк 5.33; 18.12"
                4 -> res = "Лк 6.35"
                5 -> res = "Зах 7.5"
                6 -> res = "Иер 21.12"
                7 -> res = "Иез 18.7; Мф 25.35"
                8 -> res = "Пс 36.6"
                9 -> res = "Ис 1.19; 65.24"
                10 -> res = "Ис 42.16"
                11 -> res = "Иер 31.12; Ин 4.10"
                12 -> res = "Ис 61.4"
                13 -> res = "Ис 56.4; Иер 17.24"
                14 -> res = "Втор 32.13"
            }
        }
        if (glava == 59) {
            when (stih) {
                1 -> res = "Чис 11.23; Ис 50.2"
                2 -> res = "Плач 3.44"
                3 -> res = "Ис 1.15"
                4 -> res = "Пс 7.15; Иер 7.8; Иов 15.35"
                5 -> res = "Мф 12.34"
                7 -> res = "Притч 1.16; Рим 3.15"
                8 -> res = "Ис 57.20"
                9 -> res = "Ис 59.14; Иов 30.26"
                10 -> res = "Втор 28.29"
                11 -> res = "Ис 38.14; Иер 8.15"
                12 -> res = "Пс 39.13"
                14 -> res = "Ис 59.9; Ос 4.1"
                16 -> res = "Ис 63.5"
                17 -> res = "Прем 5.18; Еф 6.17; 1 Фес 5.8"
                19 -> res = "Ис 45.6"
                20 -> res = "Рим 11.26"
                21 -> res = "Иез 36.27"
            }
        }
        if (glava == 60) {
            when (stih) {
                1 -> res = "Ис 52.1; Лк 1.78; Ин 1.9"
                2 -> res = "Еф 4.18"
                3 -> res = "Лк 2.32"
                4 -> res = "Откр 21.24; Ис 49.22; 66.12"
                5 -> res = "Деян 11.18"
                6 -> res = "Пс 71.10"
                7 -> res = "Ис 11.14; 42.11; Мал 1.11"
                10 -> res = "Пс 29.6"
                11 -> res = "Откр 21.25"
                12 -> res = "Иер 12.17; Зах 14.17"
                13 -> res = "Ис 35.1"
                15 -> res = "Ис 35.10"
                16 -> res = "Ис 49.23"
                17 -> res = "Ис 54.11"
                19 -> res = "Откр 22.5"
                20 -> res = "Ис 42.7"
                21 -> res = "Ис 52.1; 61.3; Откр 21.27"
                22 -> res = "Быт 15.5"
            }
        }
        if (glava == 61) {
            when (stih) {
                1 -> res = "Ис 11.2; 42.7; Лк 4.18; Пс 146.3"
                2 -> res = "Ис 63.4; Мф 5.4; Лк 6.21"
                3 -> res = "Ис 60.21"
                4 -> res = "Ис 58.12; Иез 36.34"
                5 -> res = "Ис 60.10"
                6 -> res = "Иер 33.21; Откр 1.6; 21.26"
                8 -> res = "Притч 15.8"
                9 -> res = "Ис 65.23; Зах 8.13"
                10 -> res = "Ис 59.17; Мф 22.11; Пс 44.10"
                11 -> res = "Ис 45.8"
            }
        }
        if (glava == 62) {
            when (stih) {
                1 -> res = "Ис 42.14; 61.11; 64.12"
                2 -> res = "Ис 56.5; 65.15; Откр 2.17"
                4 -> res = "Ос 1.10; 1 Пет 2.10"
                5 -> res = "Мк 2.19; Соф 3.17"
                6 -> res = "Ис 41.27; Иер 16.17"
                7 -> res = "Пс 101.15"
                8 -> res = "Ис 54.9; 65.21; Ам 9.13"
                9 -> res = "Ис 41.16"
                10 -> res = "Ис 57.14"
                11 -> res = "Зах 9.9; Мф 21.5; Ин 12.15; Ис 40.10"
                12 -> res = "Дан 7.27; Ис 51.11; 62.4"
            }
        }
        if (glava == 63) {
            when (stih) {
                1 -> res = "Ис 34.6"
                2 -> res = "Откр 19.13"
                3 -> res = "Ис 43.25; Плач 1.15; Ин 13.33"
                4 -> res = "Ис 34.8; 61.2"
                5 -> res = "Пс 97.1; Ис 59.16"
                6 -> res = "Ис 49.26"
                9 -> res = "Втор 7.7-8; 32.11-12; Исх 19.4"
                10 -> res = "Чис 14.11; Пс 77.57"
                11 -> res = "Исх 14.30"
                12 -> res = "Исх 14.21; Чис 14.17"
                13 -> res = "Прем 19.9"
                14 -> res = "Пс 105.8"
                15 -> res = "Втор 26.15; Вар 2.16"
                16 -> res = "Ис 64.8"
                17 -> res = "Рим 11.7; 2 Кор 3.14; Втор 32.9"
                18 -> res = "Пс 73.3"
                19 -> res = "Ис 64.10"
            }
        }
        if (glava == 64) {
            when (stih) {
                1 -> res = "Лк 10.24; Откр 22.20; Пс 96.5"
                2 -> res = "Пс 82.19"
                3 -> res = "Суд 5.5"
                4 -> res = "1 Кор 2.9"
                5 -> res = "Пс 30.20"
                6 -> res = "Пс 89.6"
                8 -> res = "Ис 63.16"
                9 -> res = "Пс 78.8"
                10 -> res = "Пс 78.1"
                12 -> res = "Ис 62.1"
            }
        }
        if (glava == 65) {
            when (stih) {
                1 -> res = "Ис 66.19; Рим 9.24; 10.20; Еф 2.12-13"
                2 -> res = "Притч 1.24; Ис 50.2"
                3 -> res = "Втор 32.5; Ис 1.29"
                4 -> res = "Втор 14.8"
                5 -> res = "Ис 66.5; Рим 14.3; Иер 4.4"
                6 -> res = "Иер 17.1"
                7 -> res = "Иез 18.6"
                8 -> res = "Мф 24.22"
                10 -> res = "Ис 35.2; Нав 7.26"
                11 -> res = "Иер 7.18"
                12 -> res = "Притч 1.24; Иер 7.13; 35.14; Ис 66.4"
                13 -> res = "Лк 6.25"
                15 -> res = "Чис 5.21; Деян 11.26; Гал 3.14"
                16 -> res = "Втор 6.13"
                17 -> res = "2 Пет 3.13; Откр 21.1; Ис 43.18; 66.22"
                18 -> res = "Иер 31.13"
                19 -> res = "Ис 61.3; 62.5; Откр 21.4"
                20 -> res = "Зах 8.4"
                21 -> res = "Ис 62.8"
                22 -> res = "Пс 1.3; 91.13"
                23 -> res = "Ис 61.9; Евр 6.10"
                24 -> res = "Пс 33.16; Ис 58.9"
                25 -> res = "Ис 11.6"
            }
        }
        if (glava == 66) {
            when (stih) {
                1 -> res = "Деян 7.49"
                2 -> res = "Ис 57.15"
                3 -> res = "Ис 1.11; Мф 5.24; Втор 14.8"
                4 -> res = "Притч 1.24; Ис 65.12; Иер 7.13"
                6 -> res = "Откр 18.6"
                8 -> res = "Ис 54.1; 60.4"
                9 -> res = "Иер 3.19"
                10 -> res = "Ис 61.2-3; Лк 6.21"
                11 -> res = "Ис 60.16"
                12 -> res = "Ис 60.4"
                14 -> res = "Ис 35.10; 51.11; Ин 16.22"
                15 -> res = "Пс 49.3; 2 Фес 1.8"
                16 -> res = "Иер 25.33; Откр 19.21"
                17 -> res = "Ис 65.4"
                18 -> res = "Откр 7.9"
                19 -> res = "Исх 19.5; Ис 65.1"
                20 -> res = "Ис 49.22; 60.7; Рим 15.16"
                21 -> res = "1 Пет 2.9; Откр 1.6"
                22 -> res = "Ис 65.17"
                23 -> res = "Чис 28.10; Откр 15.4"
                24 -> res = "Мк 9.44"
            }
        }
        return res
    }

    fun kniga29(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "1 Пар 6.60"
                2 -> res = "4 Цар 21.26"
                3 -> res = "4 Цар 23.34; 24.17; 25.8"
                5 -> res = "Гал 1.15"
                6 -> res = "Исх 4.10"
                8 -> res = "Втор 31.6, 8; Иез 3.9; Нав 11.6"
                9 -> res = "Ис 6.7; Иер 5.14"
                10 -> res = "Сир 49.9; Иер 18.7"
                12 -> res = "Дан 9.14; 2 Пет 2.3"
                14 -> res = "Иер 4.6; 10.22; 13.20"
                15 -> res = "Иер 5.15"
                17 -> res = "Лк 12.35; 1 Пет 1.13"
                18 -> res = "Иер 15.20; Иез 3.8"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Иез 16.8; Ос 9.10"
                3 -> res = "Исх 19.6; Пс 113.2"
                5 -> res = "Мих 6.3-4"
                6 -> res = "Втор 8.15"
                7 -> res = "Втор 8.1; Лев 25.23"
                8 -> res = "Рим 2.20-21"
                10 -> res = "Иер 18.13"
                11 -> res = "Рим 1.23"
                13 -> res = "Пс 35.10; Рим 1.25; 2 Пет 2.17"
                15 -> res = "Пс 53.5; Ис 5.29; Иер 4.7"
                16 -> res = "Ис 19.13; 30.4"
                17 -> res = "Втор 29.25; 3 Цар 9.8-9"
                18 -> res = "Ис 30.2; Ос 5.13"
                19 -> res = "Ис 3.9; Ос 5.5"
                20 -> res = "Пс 2.3; Ис 57.5; Иер 3.6"
                21 -> res = "Исх 15.17; Ис 5.1-2; Мф 21.33; Мк 12.1"
                22 -> res = "Иов 9.30"
                23 -> res = "Иер 7.32; 32.35"
                25 -> res = "Иер 18.12"
                26 -> res = "Иер 48.27; Иез 28.17; Дан 9.8"
                27 -> res = "Иер 3.9; Ос 4.12; 3 Цар 14.9"
                28 -> res = "Иер 11.13"
                29 -> res = "Пс 52.4"
                30 -> res = "Ис 1.5; Иер 5.3"
                32 -> res = "Иер 3.21; 18.14; Иез 23.35"
                35 -> res = "Ис 1.18; Иез 17.20; Иоил 3.2"
                36 -> res = "2 Пар 28.21; Иер 2.18"
                37 -> res = "2 Цар 13.19; Иер 32.5"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Втор 24.4"
                2 -> res = "Иез 16.24"
                4 -> res = "Мф 6.9; Иез 16.43"
                6 -> res = "Иер 2.20"
                7 -> res = "Иез 16.46; 23.2"
                8 -> res = "Иез 23.11"
                9 -> res = "Иер 2.27"
                11 -> res = "Иез 16.52"
                12 -> res = "Ис 31.6; Исх 34.6; Иоил 2.13; Зах 1.3"
                13 -> res = "Ис 57.5"
                14 -> res = "Ис 31.6"
                15 -> res = "Иер 23.4"
                17 -> res = "Ис 2.2"
                18 -> res = "Ос 1.11; Иер 31.8"
                19 -> res = "Пс 86.4; Ис 60.4"
                20 -> res = "Иер 2.8"
                22 -> res = "Ос 3.5"
                23 -> res = "Пс 120.1"
                24 -> res = "Ос 4.19"
                25 -> res = "Иер 14.7"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "Втор 6.13; 10.20; Ис 45.25"
                3 -> res = "Ос 10.12"
                4 -> res = "Втор 10.16; Иер 21.12"
                5 -> res = "Иер 8.14"
                6 -> res = "Иер 1.14"
                7 -> res = "Ис 5.29; 34.5; Иер 2.15"
                8 -> res = "Иер 6.26"
                9 -> res = "Иез 32.10"
                10 -> res = "Иер 6.14"
                11 -> res = "Иер 18.17; 51.1"
                12 -> res = "Иер 1.16"
                13 -> res = "Авв 1.8"
                14 -> res = "Ис 1.16"
                15 -> res = "Иер 8.16"
                16 -> res = "Иер 2.15"
                18 -> res = "Прем 1.8"
                19 -> res = "Ис 22.4; Иер 9.1"
                22 -> res = "Лк 16.4"
                23 -> res = "Ис 5.30"
                25 -> res = "Иер 9.10; 50.3"
                26 -> res = "Иер 2.7"
                27 -> res = "Иез 12.20; 14.22; Иер 5.10"
                28 -> res = "Иер 18.8"
                29 -> res = "Иер 4.25"
                31 -> res = "Плач 1.20; Иер 6.24; 13.21"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Быт 18.24; Пс 13.2; Иер 6.6"
                3 -> res = "Ис 1.5; 9.13"
                5 -> res = "Пс 2.3"
                6 -> res = "Иер 4.7; Соф 3.3; Ос 13.7"
                7 -> res = "Втор 32.21; Ос 13.6; Иер 23.10"
                8 -> res = "Иер 13.27; Иез 22.11"
                9, 29 -> res = "Иер 9.9"
                10 -> res = "Мф 24.6; Иер 4.27"
                12 -> res = "Ис 28.15"
                13 -> res = "Иер 22.22"
                14 -> res = "Иер 1.9"
                15 -> res = "Втор 28.49; Иер 1.15"
                17 -> res = "Лев 26.17"
                18 -> res = "Иер 4.27"
                19 -> res = "Иер 13.22; 16.10; Втор 28.36"
                21 -> res = "Ис 6.9; Мф 13.14; Мк 4.12; Лк 8.10; Ин 12.40; Деян 28.26; Рим 11.8"
                22 -> res = "Иов 38.8"
                23 -> res = "Втор 31.27"
                24 -> res = "Втор 11.14"
                26 -> res = "Притч 1.11"
                28 -> res = "Втор 32.15; Ис 1.23; Зах 7.10"
                31 -> res = "Иер 23.25; Иез 13.6"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Чис 10.9; Иер 4.5"
                3 -> res = "Иер 12.10"
                4 -> res = "Иер 51.27"
                6 -> res = "Ис 5.7"
                7 -> res = "Иер 9.3"
                9 -> res = "Иер 8.13; 17.6"
                10 -> res = "Деян 7.51-52"
                11 -> res = "Иер 7.20"
                12 -> res = "Втор 28.30"
                13 -> res = "Ис 56.11; Иер 8.10"
                14 -> res = "Иер 8.11; 23.17"
                15 -> res = "Иер 18.11"
                16 -> res = "Иер 18.15; Мф 11.29"
                17 -> res = "Ис 62.6"
                19 -> res = "Чис 14.35; Ис 1.2"
                20 -> res = "Ис 1.11; Ам 5.21; Мих 6.7"
                22 -> res = "Втор 28.49; Иер 5.15; 50.41"
                24 -> res = "Иер 4.31; 13.21; 22.23"
                25 -> res = "Мф 24.17"
                26 -> res = "Иер 4.8"
                27 -> res = "Иер 1.10"
                28 -> res = "Иез 22.18"
                30 -> res = "Ис 1.22"
            }
        }
        if (glava == 7) {
            when (stih) {
                2 -> res = "Ис 29.21"
                3 -> res = "4 Цар 17.13; Иер 26.13"
                4 -> res = "Иер 13.25"
                5 -> res = "Иер 5.28"
                6 -> res = "Иер 22.3"
                8 -> res = "Ис 59.4"
                9 -> res = "Ис 1.23; Иер 9.2"
                10, 22 -> res = "Ис 1.12"
                11 -> res = "Ис 56.7; Мф 21.13; Мк 11.17; Лк 19.46"
                12 -> res = "Нав 18.1"
                13 -> res = "Иер 11.7-8; 35.14; Притч 1.24; Ис 65.12; 66.4"
                14 -> res = "1 Цар 4.12; Пс 77.60; Иер 26.6"
                15 -> res = "4 Цар 17.18"
                16 -> res = "Исх 32.10; Иер 11.14"
                18 -> res = "Иер 44.17, 19"
                20 -> res = "Иер 4.4"
                21 -> res = "Иер 6.20"
                23 -> res = "Иер 11.4"
                24 -> res = "Иер 11.8; 16.12; 17.23"
                25 -> res = "Иер 25.4"
                26 -> res = "Иер 6.10; Исх 32.8; 33.5; Втор 9.13"
                28 -> res = "Ос 4.1"
                29 -> res = "Втор 32.19-20"
                30 -> res = "Иез 8.5"
                31 -> res = "Лев 18.21; 4 Цар 23.10; Иер 19.6"
                32 -> res = "Иер 19.11"
                33 -> res = "Иер 16.4; 34.20"
                34 -> res = "Иер 16.9; 25.10; Иез 26.13"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Плач 2.20; 4 Цар 23.16"
                2 -> res = "4 Цар 17.16; Иер 16.4"
                3 -> res = "Откр 9.6"
                5 -> res = "Иез 14.3"
                6 -> res = "Ос 4.16"
                7 -> res = "Мф 16.3; Лк 19.42"
                8 -> res = "2 Тим 3.5"
                9 -> res = "Иов 5.13"
                10 -> res = "Ис 13.16; 56.11; Иер 6.13; 23.11"
                11 -> res = "Иер 6.14"
                12 -> res = "Иер 6.15"
                13 -> res = "Ис 5.2; Мф 21.19; Лк 13.6"
                14 -> res = "Иер 4.5; 9.15"
                15 -> res = "Иер 14.19"
                16 -> res = "Иер 4.15"
                17 -> res = "Пс 57.5"
                22 -> res = "Иер 46.11"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Ис 22.4; Иер 14.17"
                2 -> res = "Иер 7.9"
                3 -> res = "Пс 63.4; Иез 22.29; Мк 12.14"
                4 -> res = "Мих 7.5; Мф 10.36"
                5 -> res = "Пс 63.4"
                6 -> res = "Ос 4.1"
                7 -> res = "Ис 1.25; 48.10"
                8 -> res = "Пс 27.3; 54.22; Притч 30.14"
                9 -> res = "Иер 5.9"
                11 -> res = "Пс 78.1; Мих 3.12; Иез 12.20"
                12 -> res = "Втор 32.28; Пс 106.43; Ос 14.10"
                13 -> res = "Втор 29.25"
                14 -> res = "Ис 65.2; Вар 1.22"
                15 -> res = "Иер 8.14; 23.15"
                16 -> res = "Лев 26.33"
                17 -> res = "Ам 5.16"
                18 -> res = "Иер 13.17"
                22 -> res = "Иер 7.33"
                23 -> res = "1 Кор 1.31"
                24 -> res = "Ин 17.3; Иер 22.16"
                26 -> res = "Деян 7.51; Рим 2.28"
            }
        }
        if (glava == 10) {
            when (stih) {
                2 -> res = "Втор 18.9"
                3 -> res = "Ис 44.13"
                4 -> res = "Прем 13.10; Ис 40.19"
                5 -> res = "Пс 113.12-13; Ис 46.7"
                6 -> res = "Пс 85.8"
                7 -> res = "Откр 15.4"
                8 -> res = "Пс 113.16; Ис 41.29; Ос 8.6"
                10 -> res = "Пс 9.37"
                11 -> res = "Гал 4.8; Вар 3.18"
                12 -> res = "Пс 135.6; Иер 51.15"
                13 -> res = "Пс 134.7; 148.4"
                14 -> res = "Иер 51.17; Рим 1.22"
                16 -> res = "Иер 51.19"
                21 -> res = "Иер 50.6; Ос 9.7"
                22 -> res = "Иер 1.14"
                23 -> res = "Пс 36.23; Притч 20.24"
                24 -> res = "Пс 6.2; 37.2"
                25 -> res = "Пс 78.6; Сир 36.2-3"
            }
        }
        if (glava == 11) {
            when (stih) {
                3 -> res = "Втор 27.26; Гал 3.10"
                4 -> res = "Втор 4.20; Иер 7.23"
                5 -> res = "Втор 7.12"
                7 -> res = "Иер 7.13"
                8 -> res = "Иер 7.24"
                10 -> res = "Иер 7.26"
                11 -> res = "Притч 1.28; Ис 1.15; Иер 14.12; Иез 8.18; Мих 3.4"
                12 -> res = "Втор 32.37-38"
                13 -> res = "Иер 2.28; Ос 8.11; 10.1"
                14 -> res = "Иер 7.16; 14.11"
                15 -> res = "Ис 1.16"
                16 -> res = "Ис 42.25; Иер 50.32; Рим 11.17"
                17 -> res = "Иер 32.29"
                19 -> res = "Ис 53.7; Иер 18.23"
                20 -> res = "1 Цар 16.7; 1 Пар 28.9; Пс 7.10; 25.2; Иер 17.10; 20.12; Откр 2.23"
                22 -> res = "Иер 18.21"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Иов 21.7; Пс 72.3; Авв 1.13"
                3 -> res = "Пс 16.3"
                4 -> res = "Иер 4.25; 14.6; 23.10"
                6 -> res = "Иер 9.4; Мк 14.68"
                7 -> res = "Мф 23.38"
                8 -> res = "Пс 78.1"
                9 -> res = "Плач 3.52; Откр 9.17"
                10 -> res = "Иер 6.3"
                13 -> res = "Лев 26.16; Втор 28.38; Мих 6.15; Агг 1.6"
                14 -> res = "Иер 32.37"
                16 -> res = "Втор 6.13; 10.20; Иер 4.2"
                17 -> res = "Ис 60.12"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Деян 21.11"
                9 -> res = "4 Цар 24.2"
                10 -> res = "Иер 11.8; 22.21; Вар 1.22"
                11 -> res = "Втор 26.19"
                14 -> res = "Иер 16.5"
                15 -> res = "Иак 1.21"
                16 -> res = "Нав 7.19; Ин 9.24; Ис 59.9"
                17 -> res = "Плач 1.2, 16"
                18 -> res = "Ис 47.1; Плач 5.16"
                20 -> res = "Иер 1.14"
                21 -> res = "Иер 6.24"
                22 -> res = "Иер 5.19; 30.15"
                27 -> res = "Иер 5.8"
            }
        }
        if (glava == 14) {
            when (stih) {
                2 -> res = "Плач 3.6"
                3 -> res = "Втор 28.24; 2 Цар 13.30"
                4 -> res = "Иоил 1.11"
                6 -> res = "Иер 12.4"
                7 -> res = "Иер 3.25"
                8 -> res = "Иер 17.13; 50.7"
                9 -> res = "Пс 43.24; Исх 25.10, 22"
                11 -> res = "Иер 11.14"
                12 -> res = "Притч 1.28; Ис 1.15; 58.3"
                13 -> res = "Иер 5.12; 6.13; 8.10"
                14 -> res = "Иер 23.21, 25; 27.15; Иез 13.9"
                15 -> res = "Иер 5.13"
                16 -> res = "Иер 16.4"
                17 -> res = "Иер 9.1; Плач 1.16; 2.18"
                19 -> res = "Пс 73.1; Иер 8.15"
                20 -> res = "1 Езд 9.15"
                21 -> res = "Иер 3.17; 17.12"
                22 -> res = "Зах 10.1"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Исх 32.11; 1 Цар 7.9"
                2 -> res = "Иер 43.11; Зах 11.9"
                3 -> res = "Иер 22.19"
                4 -> res = "Втор 28.25; Иер 24.9; 29.18; 4 Цар 21.11"
                9 -> res = "Ам 8.9"
                10 -> res = "Иер 20.14"
                13 -> res = "Иер 17.3; 20.5"
                14 -> res = "Втор 28.36; 32.22; Иер 17.4; Рим 10.19"
                15 -> res = "Иер 17.18"
                16 -> res = "Пс 18.8"
                17 -> res = "Пс 1.1"
                18 -> res = "Иер 30.15"
                19 -> res = "Иак 4.8"
                20 -> res = "Иер 1.18-19"
            }
        }
        if (glava == 16) {
            when (stih) {
                2 -> res = "1 Кор 7.26"
                4 -> res = "Иер 7.33; 8.2; 25.33"
                5 -> res = "Иер 13.14"
                6 -> res = "Лев 19.27-28"
                7 -> res = "Втор 26.14"
                8 -> res = "Иез 24.22"
                9 -> res = "Ис 24.8; Иер 7.34; Иез 26.13"
                10 -> res = "Иер 5.19"
                11 -> res = "Ис 65.7; Иер 3.25; Иез 21.7"
                12 -> res = "Иер 7.26"
                13 -> res = "Втор 4.27-28"
                14 -> res = "Иер 23.7"
                16 -> res = "Мф 4.19; 13.47; Ам 4.2"
                17 -> res = "Иов 34.21; Притч 5.21"
                18 -> res = "Ис 40.2"
                19 -> res = "Ис 25.4; Иер 17.17; Рим 1.25"
                20 -> res = "Ис 40.19; Иер 10.3; Прем 13.11"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Ис 65.6"
                2 -> res = "Иер 11.13"
                3 -> res = "Иер 15.13"
                4 -> res = "Иер 15.14"
                5 -> res = "Пс 117.8; Притч 29.25; Ис 31.1"
                6 -> res = "Ис 1.30; Иер 48.6"
                7 -> res = "Пс 2.12; Притч 16.20; Ис 30.18"
                8 -> res = "Пс 1.3"
                9 -> res = "Пс 63.7"
                10 -> res = "1 Цар 16.7; 1 Пар 28.9; Пс 7.10; Притч 17.3; Иер 11.20; 20.12; Откр 2.23"
                12 -> res = "Иер 14.21"
                13 -> res = "Иер 2.13; 14.8; Ин 4.14; 8.6"
                15 -> res = "Ис 5.19"
                16 -> res = "Иов 32.21; 1 Кор 4.3"
                17 -> res = "Иер 16.19"
                18 -> res = "Иер 20.11"
                19 -> res = "Ис 29.21"
                21 -> res = "Неем 13.19; Ин 5.9"
                22 -> res = "Исх 20.8; Иез 20.12"
                23 -> res = "Иер 7.24"
                24 -> res = "Ис 56.2; 58.13"
                25 -> res = "Иер 22.4"
                26 -> res = "Иер 32.44"
                27 -> res = "Ис 1.31; Ам 5.6; Иер 21.14"
            }
        }
        if (glava == 18) {
            when (stih) {
                6 -> res = "Прем 15.7; Ис 45.9; Рим 9.20"
                7 -> res = "Иер 1.10"
                8 -> res = "Иез 18.21"
                11 -> res = "Иер 7.3; 25.5; 35.15; Ин 3.8"
                12 -> res = "Иер 2.25"
                13 -> res = "Иер 2.10"
                15 -> res = "Иер 6.16"
                16 -> res = "Иер 19.8; 49.13; 50.13"
                17 -> res = "Притч 1.26"
                18 -> res = "Мал 2.7"
                19 -> res = "Иер 20.12"
                20 -> res = "Быт 44.4; Пс 7.16; Мф 22.15"
                21 -> res = "Пс 108.9-10"
                22 -> res = "Пс 34.7; Лк 20.20"
                23 -> res = "Иер 11.19; Пс 108.14"
            }
        }
        if (glava == 19) {
            when (stih) {
                2 -> res = "Иер 7.31"
                3 -> res = "1 Цар 3.11"
                4 -> res = "Иер 2.13; 15.6"
                5 -> res = "Иер 7.18; 16.18; 4 Цар 16.3"
                6, 11 -> res = "Иер 7.32"
                7 -> res = "Иер 7.33"
                8 -> res = "Иер 18.16; 50.13"
                9 -> res = "Втор 28.53; Плач 4.10"
                13 -> res = "4 Цар 23.12"
                15 -> res = "Исх 32.9; Неем 9.17; Иер 7.26"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "1 Езд 2.37; 1 Пар 24.14"
                2 -> res = "Иер 37.15; Евр 11.36"
                4 -> res = "Иер 21.7"
                5 -> res = "Иер 15.13"
                7 -> res = "Иер 1.5, 8; 6.10"
                9 -> res = "Иов 32.18; Лк 24.32; 1 Кор 9.16-17"
                11 -> res = "Иер 17.18; 23.40"
                12 -> res = "Иер 11.20"
                14 -> res = "Иов 3.3"
                16 -> res = "Быт 19.24-25"
                18 -> res = "Иов 3.11"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "1 Пар 24.9"
                5 -> res = "Исх 6.6; Втор 5.15; Иер 32.21"
                7 -> res = "Иер 20.4; 34.2; Исх 4.19"
                8 -> res = "Сир 15.17"
                9 -> res = "Иер 38.2; 45.5"
                10 -> res = "Лев 17.10; Иер 32.29; 34.2"
                12 -> res = "Иер 4.4; 22.3"
                13 -> res = "Иер 49.4; Иез 11.15"
                14 -> res = "Иер 17.27; 22.7"
            }
        }
        if (glava == 22) {
            when (stih) {
                3 -> res = "Иер 21.12; Исх 22.21"
                4 -> res = "Иер 17.25"
                5 -> res = "Мф 23.38"
                7 -> res = "Иер 21.14; Ис 13.3; 37.24"
                8 -> res = "Втор 29.24; 3 Цар 9.8-9"
                11 -> res = "4 Цар 23.31"
                12 -> res = "4 Цар 23.34"
                13 -> res = "Лев 19.13"
                16 -> res = "Иер 9.24; 1 Ин 2.4"
                17 -> res = "Иер 26.23"
                18 -> res = "Иер 16.6; 3 Цар 13.30"
                19 -> res = "Иер 36.30"
                20 -> res = "Иер 14.18; 30.14"
                21 -> res = "Иер 2.20; 5.23; 11.7-8"
                22 -> res = "Ос 12.1"
                23 -> res = "Иер 4.31; 22.14; Сир 48.21"
                24 -> res = "4 Цар 24.6; Песн 8.6; Агг 2.23"
                26 -> res = "4 Цар 24.12"
                27 -> res = "Иер 44.14"
                28 -> res = "Ос 8.8; 4 Цар 24.15"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "Иез 34.3"
                3 -> res = "Втор 30.3; Иер 29.14; Лк 1.54"
                4 -> res = "Пс 22.1; Ис 40.11; 45.13; Иер 3.15; Иез 34.12"
                5 -> res = "Ис 4.2; Иер 33.15; Дан 9.24; Зах 3.8; 6.12; Ин 1.45"
                6 -> res = "Втор 33.28; Иер 33.16"
                7 -> res = "Иер 16.14"
                10 -> res = "Иер 5.7; 9.2; 12.4"
                11 -> res = "Иер 8.10"
                12 -> res = "Иер 13.16"
                14 -> res = "Иер 5.30; Ис 1.9; 28.15; Иез 13.22"
                15 -> res = "Иер 9.15"
                16 -> res = "Иер 27.9"
                17 -> res = "Иер 6.14; Иез 13.10; Зах 10.2"
                18 -> res = "Иов 15.8; Ис 40.13"
                19 -> res = "Иер 30.23"
                20 -> res = "Иер 30.24"
                21 -> res = "Иер 14.14; 27.15; 29.9"
                22 -> res = "Ис 55.11"
                24 -> res = "Иов 34.21; Пс 138.7-9; Сир 23.27; Ам 9.2"
                25 -> res = "Иер 5.31; 14.14"
                27 -> res = "Суд 3.7"
                28 -> res = "1 Пет 4.11"
                29 -> res = "Сир 48.1; Лк 24.32; Откр 11.5"
                30 -> res = "Втор 18.20; Иер 14.15"
                31 -> res = "Иез 13.6; 22.28"
                32 -> res = "Иез 14.9; Соф 3.4"
                33 -> res = "Иез 12.9"
                40 -> res = "Иер 20.11"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "4 Цар 24.12, 14"
                6 -> res = "Иер 42.10"
                7 -> res = "Втор 30.6; Иер 30.22; 32.39; Иез 11.19; Евр 8.10"
                8 -> res = "Иер 29.17"
                9 -> res = "Втор 28.25; Пс 43.14; Иер 15.4"
                10 -> res = "Иез 14.21"
            }
        }
        if (glava == 25) {
            when (stih) {
                4 -> res = "Иер 7.25; 29.19; 44.4"
                5 -> res = "4 Цар 17.13; Иер 18.11; 35.15; Иона 3.8"
                6 -> res = "Втор 8.19; 11.28; Иер 7.6"
                9 -> res = "4 Цар 17.23; Иер 19.4, 8"
                10 -> res = "Ис 24.8; Иер 7.34"
                12 -> res = "2 Пар 36.21-22; 1 Езд 1.1; Иер 29.10; Дан 9.2"
                14 -> res = "Иер 27.7"
                15 -> res = "Откр 16.19"
                16 -> res = "Наум 3.11"
                18 -> res = "Ис 51.21; Иер 29.22; 42.18"
                19 -> res = "Иер 46.2"
                21 -> res = "Иер 48.1"
                23 -> res = "Лев 19.27; Иер 9.26"
                25 -> res = "Иер 49.34"
                26 -> res = "Иер 51.41"
                27 -> res = "Иер 51.7; Ис 51.21"
                29 -> res = "1 Пет 4.17"
                30 -> res = "Иоил 3.16; Ам 1.2"
                31 -> res = "Иоил 3.2; Соф 3.8; Откр 19.15"
                33 -> res = "Ис 34.3; Иер 7.33; Откр 11.8"
                34 -> res = "Ис 65.12"
            }
        }
        if (glava == 26) {
            when (stih) {
                2 -> res = "Втор 4.2; Притч 30.6"
                3 -> res = "Иер 18.8; Иоил 2.13"
                5 -> res = "Иер 7.13"
                6 -> res = "Иер 7.14"
                9 -> res = "Иер 7.12"
                10 -> res = "Иер 36.10"
                11 -> res = "Плач 4.13"
                13 -> res = "Иер 7.3"
                15 -> res = "Иер 22.17; Мф 23.35"
                18 -> res = "Мих 1.1; 3.12"
                19 -> res = "Иер 18.8; Иона 3.10"
                20 -> res = "Суд 18.12"
                23 -> res = "Иер 22.17"
                24 -> res = "4 Цар 22.12; 25.22; Иер 39.14"
            }
        }
        if (glava == 27) {
            when (stih) {
                2 -> res = "2 Пар 10.4; Наум 1.13"
                3 -> res = "Иер 48.1"
                5 -> res = "Дан 4.22"
                6 -> res = "Иер 25.9; 28.14"
                7 -> res = "Иер 25.14"
                9 -> res = "Иер 23.16"
                13 -> res = "Иез 18.32"
                14 -> res = "Вар 2.24"
                15 -> res = "Иер 14.14; 23.21"
                16 -> res = "Иер 28.3"
                19 -> res = "4 Цар 25.13; Иер 52.17"
                20 -> res = "4 Цар 24.12"
                22 -> res = "4 Цар 25.13; 2 Пар 36.18, 22"
            }
        }
        if (glava == 28) {
            when (stih) {
                1 -> res = "Нав 21.17"
                2 -> res = "Иер 27.12"
                3 -> res = "Иер 27.16"
                9 -> res = "Втор 18.22"
                14 -> res = "Иер 27.6"
                16 -> res = "Втор 13.5"
            }
        }
        if (glava == 29) {
            when (stih) {
                2 -> res = "4 Цар 24.12"
                7 -> res = "Вар 1.11"
                8 -> res = "Иер 14.14; 23.21; 27.15"
                9 -> res = "Иер 23.16; Мф 24.5"
                10 -> res = "Иер 25.12"
                12 -> res = "Ис 58.9"
                13 -> res = "Мф 7.7"
                14 -> res = "Втор 30.3"
                17 -> res = "Иер 24.8"
                18 -> res = "Иер 15.4"
                19 -> res = "Иер 25.4"
                21 -> res = "Иез 13.8"
                22 -> res = "Ис 65.15; Иер 44.12"
                28 -> res = "Иез 11.3"
                31 -> res = "Иер 28.15"
                32 -> res = "Иер 28.16"
            }
        }
        if (glava == 30) {
            when (stih) {
                2 -> res = "Иер 36.2"
                3 -> res = "Иер 25.12"
                6 -> res = "Иер 4.31"
                7 -> res = "Иоил 2.11; Ам 5.18; Соф 1.14"
                9 -> res = "Иез 34.24"
                10 -> res = "Ис 44.2; Иер 46.27"
                11 -> res = "Чис 14.18; Ис 41.10; Иер 46.28"
                12 -> res = "Иер 8.22"
                14 -> res = "Плач 1.19; Иер 2.19"
                15 -> res = "Иер 13.22; 15.18"
                16 -> res = "Исх 23.22; Ис 41.11"
                17 -> res = "Иер 33.6"
                18 -> res = "Иер 31.23"
                21 -> res = "Мих 5.2; Пс 39.8; Ин 4.34"
                22 -> res = "Иер 24.7"
                23 -> res = "Иер 23.19"
                24 -> res = "Иер 23.20"
            }
        }
        if (glava == 31) {
            when (stih) {
                1 -> res = "Иер 24.7"
                3 -> res = "Лк 1.54; Ин 6.44; 13.1"
                4 -> res = "Пс 121.3; Иер 33.7"
                5 -> res = "Ис 65.21"
                6 -> res = "Ис 2.3"
                7 -> res = "Ис 2.2"
                8 -> res = "Втор 30.3"
                9 -> res = "2 Кор 6.18; Исх 4.22"
                10 -> res = "Иер 32.37; Иез 11.16"
                11 -> res = "Лк 11.22"
                12 -> res = "Ис 58.11"
                13 -> res = "Пс 148.12; Ис 65.18; Ин 16.20"
                14 -> res = "Ис 66.21"
                15 -> res = "Мф 2.18"
                18 -> res = "Песн 1.3; Сир 17.21; Ос 10.11; Плач 5.21"
                19 -> res = "Рим 2.4"
                20 -> res = "Рим 9.16"
                22 -> res = "Ис 43.19; 2 Кор 5.17; Откр 21.5"
                23 -> res = "Лк 1.54; Иер 29.14; 30.3; 32.44"
                25 -> res = "Ис 40.29; Мф 11.28; Евр 12.12"
                28 -> res = "Иер 24.6; 32.42; 45.4"
                29 -> res = "Иез 18.2-3"
                31 -> res = "Евр 8.8"
                33 -> res = "Евр 8.10; Иер 24.7"
                34 -> res = "Ис 54.13; Ин 6.45; Евр 8.11; Иер 33.8; Мих 7.18; Деян 10.43"
                36 -> res = "Быт 1.16; Пс 135.8-9"
                37 -> res = "Иер 33.20-21"
                38 -> res = "Неем 3.1; 2 Пар 26.9; Зах 14.10"
                40 -> res = "4 Цар 11.16; Неем 3.28"
            }
        }
        if (glava == 32) {
            when (stih) {
                2 -> res = "Иер 33.1"
                3 -> res = "Иер 21.7; 27.6"
                4 -> res = "Иер 34.3"
                5 -> res = "Иез 17.12; Иер 52.11; Ис 24.19"
                7 -> res = "Мф 27.9; Лев 25.25"
                8 -> res = "Иер 1.1"
                12 -> res = "Иер 36.4"
                15 -> res = "Иер 32.44"
                17 -> res = "Иер 27.5; 32.27"
                18 -> res = "Исх 34.7; Втор 5.10"
                19 -> res = "Пс 61.13; Притч 24.12; Иез 33.20; Мф 16.27; Рим 2.6; Иер 16.17"
                20 -> res = "Исх 4.6-7"
                21 -> res = "Исх 6.6; 2 Цар 7.23"
                22 -> res = "Быт 12.7; Исх 13.5"
                27 -> res = "Чис 16.22"
                29 -> res = "Иер 11.17"
                30 -> res = "Быт 8.21"
                33 -> res = "Иер 2.27; 18.17"
                34 -> res = "Втор 12.11; 4 Цар 21.4; 2 Пар 33.4-5"
                35 -> res = "Лев 18.21; 4 Цар 21.6"
                37 -> res = "Втор 30.3; Иер 12.14-15"
                38 -> res = "Иер 24.7"
                39 -> res = "Иез 11.19; 36.26"
                40 -> res = "Иер 31.31, 33; Рим 11.27"
                41 -> res = "Втор 30.9; Иер 24.6; Быт 9.15"
                42 -> res = "Иер 31.28"
                43 -> res = "Иер 33.10"
                44 -> res = "Иер 17.26; 29.14; 30.3; 31.23"
            }
        }
        if (glava == 33) {
            when (stih) {
                1 -> res = "Иер 32.2"
                2 -> res = "Исх 15.3; Пс 82.19"
                4 -> res = "Иер 22.10"
                5 -> res = "Втор 31.17"
                6 -> res = "Иер 30.17"
                7 -> res = "Иер 29.14; 30.3; 31.4"
                8 -> res = "Иер 31.34"
                9 -> res = "Втор 26.19"
                10 -> res = "Иер 32.43"
                11 -> res = "Пс 135.1"
                14 -> res = "Иер 23.5"
                15 -> res = "Ис 11.1; Иер 23.5"
                16 -> res = "Втор 33.28; Иер 23.6"
                17 -> res = "Ис 11.1; Лк 1.32"
                18 -> res = "1 Пет 2.5; Ис 61.6; Мал 3.3"
                20 -> res = "Иер 31.37"
                22 -> res = "Быт 15.5; 22.17; 28.14"
                25 -> res = "Иер 31.36; 33.20"
                26 -> res = "Пс 125.1; Иер 31.20; Иез 39.25"
            }
        }
        if (glava == 34) {
            when (stih) {
                1 -> res = "4 Цар 25.1"
                2 -> res = "Иер 21.7"
                3 -> res = "Иер 32.4; Иез 17.16"
                5 -> res = "Иер 22.18"
                7 -> res = "Мих 1.13"
                9 -> res = "Исх 21.2; Лев 25.39; Втор 15.12"
                13 -> res = "Исх 21.2; Втор 15.12"
                14 -> res = "Иер 7.24; 25.4; 35.15"
                17 -> res = "Втор 28.64"
                18 -> res = "Быт 15.10"
                20 -> res = "Иер 7.33"
            }
        }
        if (glava == 35) {
            when (stih) {
                2 -> res = "1 Пар 2.55"
                4 -> res = "1 Езд 10.6"
                6 -> res = "4 Цар 10.15, 23"
                14 -> res = "Иер 7.13"
                15 -> res = "Иер 7.3; 18.11; Иона 3.8"
                17 -> res = "Ис 65.12; 66.4"
                19 -> res = "Иер 33.17"
            }
        }
        if (glava == 36) {
            when (stih) {
                2 -> res = "Иер 30.2; 51.60"
                3 -> res = "Иер 26.3; Иез 12.3"
                4 -> res = "Иер 45.1"
                7 -> res = "Вар 1.5"
                10 -> res = "Иер 26.10"
                23 -> res = "2 Пар 36.16"
                29 -> res = "Иер 32.43; 33.10"
                30 -> res = "Иер 22.19"
            }
        }
        if (glava == 37) {
            when (stih) {
                1 -> res = "4 Цар 24.17; 2 Пар 36.10"
                2 -> res = "2 Пар 36.12"
                3 -> res = "Ис 37.4"
                5 -> res = "Иер 34.21"
                7 -> res = "Ис 30.2; Плач 4.17"
                15 -> res = "Иер 20.2"
            }
        }
        if (glava == 38) {
            when (stih) {
                2 -> res = "Иер 21.9; 39.18; 45.5"
                3 -> res = "2 Пар 36.12; Иер 34.2"
                4 -> res = "Лк 23.2; Ам 7.10"
                7 -> res = "Иер 39.16"
                18 -> res = "Иер 34.2"
                20 -> res = "2 Пар 36.12"
                22 -> res = "Ис 3.12"
                23 -> res = "4 Цар 25.6; Иер 32.4"
            }
        }
        if (glava == 39) {
            when (stih) {
                1 -> res = "4 Цар 25.1; Иер 52.4"
                5 -> res = "Иер 32.4"
                6 -> res = "Соф 1.8"
                7 -> res = "4 Цар 25.7"
                8 -> res = "4 Цар 25.9; Иер 12.13"
                10 -> res = "4 Цар 25.12"
                14 -> res = "Иер 26.24"
                16 -> res = "Иер 38.7"
                18 -> res = "Иер 21.9; 38.2"
            }
        }
        if (glava == 40) {
            when (stih) {
                3 -> res = "Иер 50.7"
                5, 7 -> res = "4 Цар 25.22"
                9 -> res = "4 Цар 25.24"
                15 -> res = "2 Цар 16.9"
            }
        }
        if (glava == 41) {
            when (stih) {
                2, 7 -> res = "4 Цар 25.25"
                5 -> res = "Лев 19.27; Втор 14.1"
                9 -> res = "3 Цар 15.22"
                17 -> res = "4 Цар 25.26"
            }
        }
        if (glava == 42) {
            when (stih) {
                2 -> res = "Ис 37.4; Иер 37.3"
                5 -> res = "Исх 19.8; Нав 24.24"
                10 -> res = "Иер 24.6"
                11 -> res = "Ис 41.10; 43.5; Иер 30.10"
                16 -> res = "Иер 44.12; Ос 9.6"
                17 -> res = "Иез 6.12; 14.21"
                18 -> res = "Иер 7.20; 44.6; Иез 5.15"
            }
        }
        if (glava == 43) {
            when (stih) {
                2 -> res = "4 Цар 25.23"
                4 -> res = "Иер 22.4"
                6 -> res = "4 Цар 25.26"
                7 -> res = "Ос 9.3; Ис 30.4"
                11 -> res = "Иер 15.2"
                12 -> res = "Иез 30.13; Чис 33.4; Иер 46.25"
            }
        }
        if (glava == 44) {
            when (stih) {
                1 -> res = "Иер 46.14; Иез 29.14; 30.14"
                3 -> res = "Исх 23.24"
                4 -> res = "Иер 25.4"
                5 -> res = "Иер 7.24; 11.8"
                6 -> res = "Иер 42.18"
                11 -> res = "Ам 9.4"
                12 -> res = "Иер 44.27; Чис 5.21"
                13 -> res = "Иер 24.10; 29.17; 42.17"
                14 -> res = "Иер 44.11"
                15 -> res = "Иер 7.18"
                16 -> res = "Иер 6.16"
                17 -> res = "Втор 29.19; Иез 20.32; Иер 7.18"
                18 -> res = "4 Цар 6.25, 33"
                19 -> res = "Соф 1.5; Иер 7.18"
                22 -> res = "Иер 26.6; 44.12"
                26 -> res = "Иер 44.24"
                27 -> res = "Иер 31.28; Дан 9.14"
                30 -> res = "Иер 21.7; 22.25; 2 Пар 36.17, 20"
            }
        }
        if (glava == 45) {
            when (stih) {
                1 -> res = "Иер 36.4"
                4 -> res = "Иер 24.6; Ам 9.11"
                5 -> res = "Рим 12.16; Иер 21.9"
            }
        }
        if (glava == 46) {
            when (stih) {
                2 -> res = "2 Пар 35.20; Иер 25.19"
                3 -> res = "Иез 23.24"
                4 -> res = "Иер 51.11"
                5 -> res = "Иер 47.3"
                9 -> res = "Иез 27.10"
                10 -> res = "Ис 2.12; Иер 25.33"
                11 -> res = "Иер 8.22"
                14 -> res = "Иер 44.1"
                18 -> res = "3 Цар 18.19; Ам 9.3"
                21 -> res = "Иер 50.31"
                25 -> res = "Иез 30.15"
                27 -> res = "Ис 44.2-4; Иер 30.10"
                28 -> res = "Быт 26.24; Ис 27.8; 41.10"
            }
        }
        if (glava == 47) {
            when (stih) {
                1 -> res = "Иез 25.15"
                2 -> res = "Откр 17.15"
                3 -> res = "Откр 9.9"
                4 -> res = "Ам 1.10; Быт 10.14; Втор 2.23"
            }
        }
        if (glava == 48) {
            when (stih) {
                1 -> res = "Иез 25.8-9"
                2 -> res = "Иер 11.19"
                5 -> res = "Ис 15.5"
                7 -> res = "Иер 5.17; 49.4; 3 Цар 11.7"
                11 -> res = "Соф 1.12"
                13 -> res = "3 Цар 12.29"
                18 -> res = "Ис 47.1"
                20 -> res = "Ис 16.7"
                24 -> res = "Ам 2.2; Ис 63.1"
                25 -> res = "Плач 2.3; Иез 30.21"
                27 -> res = "Иер 2.26"
                29 -> res = "Ис 16.6"
                32 -> res = "Ис 16.8-9"
                33 -> res = "Ис 16.10"
                34 -> res = "Иер 25.25; Ис 15.4-6"
                36 -> res = "Ис 16.11; Плач 1.20"
                37 -> res = "Ис 15.2-3; Иез 7.18"
                38 -> res = "Иер 22.28; 51.34"
                40 -> res = "Авв 1.8; Дан 7.4; Ос 8.1"
                41 -> res = "Иер 30.6"
                43 -> res = "Ис 24.17"
                44 -> res = "Ам 5.19"
                45 -> res = "Чис 21.28"
                46 -> res = "Чис 21.29"
                47 -> res = "Иер 49.39"
            }
        }
        if (glava == 49) {
            when (stih) {
                1 -> res = "Иез 25.2-3"
                2 -> res = "Ам 1.14"
                3 -> res = "Нав 8.2"
                4 -> res = "Иер 21.13"
                6 -> res = "Иер 33.7"
                7 -> res = "Иез 25.12; Ис 29.14; Авд 1.8"
                8 -> res = "Иер 49.30; 50.31"
                9 -> res = "Авд 1.5"
                12 -> res = "Иер 25.15, 28-29; 1 Пет 4.17"
                13 -> res = "Иер 18.16"
                14 -> res = "Авд 1.1"
                15 -> res = "Авд 1.2"
                16 -> res = "Иер 51.55; Ам 9.3"
                17 -> res = "Иер 50.13"
                18 -> res = "Быт 19.25; Ис 13.19-20; Иер 50.40"
                19 -> res = "Иер 50.44; Иов 41.1"
                21 -> res = "Иер 50.46"
                22 -> res = "Иер 48.40"
                23 -> res = "Ис 17.1; 36.19; Ам 1.3"
                24 -> res = "Иер 4.31"
                26 -> res = "Иер 50.30"
                27 -> res = "Ам 1.4"
                28 -> res = "Иер 2.10; Ис 21.16"
                32 -> res = "Иез 5.10"
                34 -> res = "Иер 25.25"
                35 -> res = "Ис 22.6"
                39 -> res = "Иер 48.47"
            }
        }
        if (glava == 50) {
            when (stih) {
                1 -> res = "Ис 13.1; 14.4"
                2 -> res = "Ис 46.1"
                3 -> res = "Иер 4.25; 9.10"
                4 -> res = "Ис 55.6; Ос 3.5; 6.1"
                6 -> res = "Иер 2.8; 10.21; Иез 34.1-13"
                8 -> res = "Ис 48.20; Иер 51.6; Откр 18.4"
                11 -> res = "Иез 34.18, 21"
                13 -> res = "Иер 18.16; 49.17"
                15 -> res = "Втор 32.35; Рим 12.19"
                17 -> res = "4 Цар 15.19; 16.7; 17.3"
                18 -> res = "4 Цар 19.35; Ис 37.36"
                19 -> res = "3 Цар 18.19; Втор 32.14"
                20 -> res = "Иер 31.34; 33.8; Дан 9.24"
                23 -> res = "Ис 13.19; 14.4; Откр 18.17"
                25 -> res = "Втор 32.34; Ис 13.5; Рим 2.5"
                27 -> res = "Иер 46.21; 4 Цар 25.9"
                29 -> res = "Откр 17.16; 18.6"
                30 -> res = "Иер 49.26"
                31 -> res = "Иер 46.10; Откр 18.8"
                32 -> res = "Иер 11.16"
                37 -> res = "Иер 51.30"
                39 -> res = "Ис 13.21; Откр 18.2"
                40 -> res = "Быт 19.25; Иер 49.18"
                41 -> res = "Иер 6.22; Мих 5.5"
                43 -> res = "Дан 5.5-6"
                44 -> res = "Иер 49.19; Иов 41.1"
                45 -> res = "Иер 49.20, 29"
                46 -> res = "Иер 49.21; 51.29; Откр 18.15"
            }
        }
        if (glava == 51) {
            when (stih) {
                1 -> res = "Ис 13.1; Иер 4.11"
                2 -> res = "Ис 27.12"
                5 -> res = "Ин 14.18"
                6 -> res = "Иер 50.8"
                7 -> res = "Иер 25.27"
                8 -> res = "Ис 21.9; Откр 14.8; 18.2, 10"
                9 -> res = "Откр 16.19; 18.5"
                10 -> res = "Мих 7.9"
                11 -> res = "Иер 46.4; 50.28; Ис 13.17"
                13 -> res = "Откр 17.2"
                14 -> res = "Ам 6.8"
                15 -> res = "Быт 1.6; Иер 10.12"
                16 -> res = "Пс 134.7"
                17 -> res = "Иер 10.14; Ис 44.9"
                19 -> res = "Иер 10.16"
                20 -> res = "Иер 50.23"
                24 -> res = "Иер 30.16; 50.29; 2 Фес 1.6"
                25 -> res = "Иов 9.5; Откр 8.8"
                27 -> res = "Иер 6.4; Быт 8.4; Ис 37.38"
                30 -> res = "Иер 50.37"
                32 -> res = "Иер 50.38"
                33 -> res = "Мих 4.12; Откр 14.15"
                37 -> res = "Иер 50.13; Откр 18.2"
                38 -> res = "Ис 5.29"
                39 -> res = "Ис 29.10"
                41 -> res = "Иер 25.26"
                42 -> res = "Ис 8.7; Иез 26.3"
                45 -> res = "Иер 51.6"
                48 -> res = "Откр 18.20"
                52 -> res = "Иез 26.15"
                53 -> res = "Пс 138.8; Ам 9.2; Авд 1.4"
                56 -> res = "Втор 32.35; Рим 12.19; Евр 10.30"
                58 -> res = "Ис 2.15"
                60 -> res = "Иер 36.7"
                64 -> res = "Откр 18.21"
            }
        }
        if (glava == 52) {
            when (stih) {
                1 -> res = "4 Цар 24.18; 2 Пар 36.11"
                3 -> res = "4 Цар 24.20"
                4 -> res = "4 Цар 25.1; Иер 39.1"
                6 -> res = "4 Цар 25.3"
                8 -> res = "4 Цар 25.5; Плач 4.19-20"
                9 -> res = "4 Цар 25.6"
                10 -> res = "Иер 39.6"
                11 -> res = "4 Цар 25.7; Иез 12.13; 17.16"
                12 -> res = "4 Цар 25.8"
                13 -> res = "4 Цар 25.9; Иер 39.8"
                16 -> res = "4 Цар 25.12"
                17 -> res = "2 Пар 3.15; Иер 27.19"
                18 -> res = "4 Цар 25.14"
                19 -> res = "4 Цар 25.15"
                20 -> res = "3 Цар 7.23"
                21 -> res = "3 Цар 7.15; 4 Цар 25.17"
                24 -> res = "4 Цар 25.18"
                27 -> res = "4 Цар 25.21"
                30 -> res = "1 Езд 2.64"
                31 -> res = "4 Цар 25.27"
            }
        }
        return res
    }

    fun kniga30(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Плач 5.8"
                2 -> res = "Иер 13.17"
                3 -> res = "Иер 13.19; 14.2"
                4 -> res = "Иер 14.2; Плач 5.11"
                5 -> res = "Втор 28.44"
                6 -> res = "Иер 13.20"
                8 -> res = "Иер 13.22; 30.14"
                9 -> res = "Втор 32.29; Лк 19.42"
                10 -> res = "Втор 23.3"
                11 -> res = "Пс 36.25"
                12 -> res = "Иов 19.21; Дан 9.12; Лк 22.44; Ис 1.6"
                13 -> res = "Иез 12.13; Ос 7.12"
                14 -> res = "Пс 37.5"
                15 -> res = "Ис 3.1"
                16 -> res = "Плач 1.2; 2.18"
                17 -> res = "Иер 4.31; Плач 1.8"
                18 -> res = "Дан 9.7"
                19 -> res = "Иер 14.3; 30.14; Плач 2.10"
                20 -> res = "Пс 24.17; Лк 21.26; Втор 32.25"
                21 -> res = "Плач 1.16; Иер 49.12"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Иез 7.8; Плач 4.1; Авд 1.4"
                2 -> res = "Иер 5.17; Ис 47.6"
                3 -> res = "Иер 48.25"
                4 -> res = "Пс 7.13; Плач 3.12"
                6 -> res = "Пс 79.13; Ис 5.5"
                7 -> res = "Иер 2.15; 7.14"
                8 -> res = "4 Цар 21.13; Ис 34.11"
                9 -> res = "Пс 73.9"
                10 -> res = "Плач 1.19"
                11 -> res = "Плач 1.16; Втор 32.25; Иер 44.7"
                12 -> res = "Иез 4.17"
                13 -> res = "Иер 15.18"
                14 -> res = "Иер 2.8"
                15 -> res = "Иез 5.14; Мк 15.29"
                16 -> res = "Плач 1.5; 3.46"
                17 -> res = "Лев 26.17; Втор 28.15"
                18 -> res = "Иер 9.1; 14.17; Плач 1.16"
                19 -> res = "Иов 30.16"
                20 -> res = "Втор 28.53; Иер 19.9"
                21 -> res = "Плач 3.42"
                22 -> res = "Плач 1.15"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Иез 7.10"
                2 -> res = "Иер 13.16"
                3 -> res = "Иов 19.21"
                5 -> res = "Иер 9.15"
                6 -> res = "Пс 142.3"
                7 -> res = "Иов 19.8"
                9 -> res = "Ос 2.6"
                10 -> res = "Ос 5.14; 13.7-8"
                12 -> res = "Иов 16.12"
                14 -> res = "Иов 30.9"
                15 -> res = "Иов 9.18"
                16 -> res = "Притч 20.17"
                18 -> res = "Иер 17.13"
                20 -> res = "Мк 15.23"
                22 -> res = "Неем 9.31; Пс 85.13; Ин 3.16"
                23 -> res = "Пс 137.8"
                24 -> res = "Пс 15.5; Иер 10.16"
                25 -> res = "Пс 33.9; Авв 2.3"
                27 -> res = "Пс 118.71"
                28 -> res = "Пс 38.10; 76.11"
                30 -> res = "Мф 5.39"
                31 -> res = "Пс 76.8"
                32 -> res = "Пс 29.6; Ис 54.7-8; Мих 7.18"
                38 -> res = "Ин 1.3"
                39 -> res = "Иер 30.15; Мф 7.3"
                40 -> res = "Иер 3.23; 1 Кор 11.28"
                42 -> res = "Дан 9.5"
                45 -> res = "1 Кор 4.13"
                47 -> res = "Ис 24.17"
                48 -> res = "Иер 14.17"
                50 -> res = "Пс 79.15"
                51 -> res = "Плач 1.16"
                52 -> res = "Иер 12.9"
                53 -> res = "Иер 37.15"
                55 -> res = "Пс 129.1"
                64 -> res = "Пс 27.4"
                66 -> res = "Пс 78.6"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Ис 1.22"
                2 -> res = "Иер 18.4"
                4 -> res = "Плач 2.11"
                5 -> res = "Откр 6.5-6"
                6 -> res = "Быт 18.20; 19.4"
                8 -> res = "Лев 26.16; Иез 37.11; Плач 3.4"
                10 -> res = "4 Цар 6.29; Иер 19.9"
                11 -> res = "Иер 7.20"
                13 -> res = "Иер 5.31"
                16 -> res = "Плач 5.12"
                18 -> res = "Иез 7.2"
                19 -> res = "Иер 4.13"
                20 -> res = "Дан 9.24"
                21 -> res = "Пс 136.7"
                22 -> res = "Ис 40.2"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Иез 5.14"
                2 -> res = "Иер 6.12"
                4 -> res = "Иез 4.16"
                7 -> res = "Исх 20.5; Иер 31.29; Иез 8.2"
                8 -> res = "Втор 28.48"
                10 -> res = "Иез 22.22"
                11 -> res = "Втор 28.30"
                12 -> res = "Плач 4.16"
                15 -> res = "Ос 2.11"
                16 -> res = "Иер 13.18"
                17 -> res = "Иер 13.16"
                19 -> res = "Пс 9.8"
                20 -> res = "Пс 12.2"
                21 -> res = "Иер 31.18"
            }
        }
        return res
    }

    fun kniga31(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                2 -> res = "2 Пар 36.14"
                3 -> res = "Иер 25.12; 29.10-11, 14; Дан 9.2"
                5 -> res = "Мф 4.10"
                8 -> res = "Деян 14.13; Пс 113.12"
                24 -> res = "Ис 46.6"
                25 -> res = "Пс 113.15"
                30 -> res = "Лев 19.27; 21.5"
                33 -> res = "Дан 2.21"
                34 -> res = "Прем 13.18-19"
                35 -> res = "Пс 59.14; 67.21"
                36 -> res = "Втор 32.37"
                50 -> res = "Втор 32.21"
                51 -> res = "Иер 14.22; Деян 14.17"
                71 -> res = "Иер 10.11"
            }
        }
        return res
    }

    fun kniga32(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                2 -> res = "4 Цар 25.9"
                3 -> res = "4 Цар 24.6"
                9 -> res = "4 Цар 24.12"
                10 -> res = "1 Езд 3.3"
                11 -> res = "Иер 29.7"
                12 -> res = "Иер 29."
                15 -> res = "Вар 2.6; Дан 9.7"
                17 -> res = "Дан 9.5"
                20 -> res = "Втор 28.15; Дан 9.11"
                22 -> res = "Иер 3.17"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Дан 9.2"
                2 -> res = "Втор 28.53"
                6 -> res = "Вар 1.15; Дан 9.7"
                9 -> res = "Дан 9.14"
                10 -> res = "Лев 26.14"
                11 -> res = "Дан 9.15"
                12 -> res = "Дан 9.5"
                13 -> res = "Дан 9.16"
                16 -> res = "Втор 26.15; Ис 63.15"
                17 -> res = "Пс 6.6; 113.25; Сир 17.24; Ис 38.18; Дан 9.18"
                18 -> res = "Мф 5.6"
                19 -> res = "Дан 9.18"
                21 -> res = "Иер 27.12"
                22 -> res = "Иер 38.2"
                23 -> res = "Иер 7.34; 16.9; 25.10"
                24 -> res = "Иер 27.17"
                28 -> res = "Лев 26.3, 9"
                29 -> res = "Лев 26.33"
                30 -> res = "Втор 9.13; Лев 26.41"
                31 -> res = "Втор 30.6"
                34 -> res = "Иер 30.10; Быт 12.7; 13.15"
                35 -> res = "Иер 32.38"
            }
        }
        if (glava == 3) {
            when (stih) {
                3 -> res = "Пс 91.9; 101.27"
                4 -> res = "Пс 9.14; Иез 14.13"
                8 -> res = "Втор 28.37"
                12 -> res = "Иер 2.13"
                13 -> res = "Пс 80.14"
                16 -> res = "Иер 28.14"
                18 -> res = "Мф 6.25"
                20 -> res = "Рим 1.21; Прем 13.1"
                23 -> res = "Сир 15.7, 9; 1 Кор 1.20, 22"
                26 -> res = "Быт 6.4"
                27 -> res = "1 Кор 1.27"
                29 -> res = "Втор 30.1"
                31 -> res = "1 Кор 2.7-8"
                32 -> res = "Быт 1.24"
                36 -> res = "Исх 15.11"
                37 -> res = "Ис 28.26"
                38 -> res = "Прем 2.15; Ин 1.10, 14; 1 Тим 1.15"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Иез 20.11"
                4 -> res = "Втор 4.8; Пс 147.8"
                7 -> res = "Втор 32.17"
                12 -> res = "Мих 7.8Мих 7.8"
                15 -> res = "Втор 28.49"
                27 -> res = "Ис 49.14-15"
                31 -> res = "Пс 136.7-8"
                35 -> res = "Ис 34.14"
                36 -> res = "Вар 5.5"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Ис 52.1"
                5 -> res = "Вар 4.36"
                7 -> res = "Ис 40.4"
            }
        }
        return res
    }

    fun kniga33(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Пс 136.1"
                2 -> res = "4 Цар 24.1"
                3 -> res = "Иез 3.23; 43.3"
                4 -> res = "Иов 38.1"
                6 -> res = "Иез 10.14"
                10 -> res = "Иез 41.19; Откр 4.7"
                14 -> res = "Иез 10.20"
                15 -> res = "Иез 10.9, 12"
                16 -> res = "Иез 10.9"
                18 -> res = "Откр 4.6"
                20 -> res = "Иез 10.17"
                24 -> res = "Иез 43.2"
                26 -> res = "Иез 10.1"
                27 -> res = "Иез 8.2"
                28 -> res = "Сир 43.12"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Деян 7.55; Откр 21.11; Дан 8.17"
                3 -> res = "Пс 77.8; Иер 3.25; 7.26"
                4 -> res = "Ис 48.4; Иер 5.3; Мк 10.5"
                5 -> res = "Иез 3.11; 12.2; Ис 30.9"
                6 -> res = "Иер 1.8; Мих 7.2"
                8 -> res = "Откр 10.9"
                9 -> res = "Иер 1.9; Откр 5.1"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Откр 10.9"
                3 -> res = "Откр 10.10"
                5 -> res = "Ис 33.19"
                7 -> res = "Ис 48.4"
                8 -> res = "Иер 1.18"
                9 -> res = "Иер 1.8"
                11 -> res = "Иез 2.5"
                12 -> res = "Иез 8.3"
                17 -> res = "Иез 33.7"
                18 -> res = "2 Пет 1.13; Иез 34.10; 1 Тим 5.22"
                19 -> res = "Деян 18.6; 20.26"
                20 -> res = "Иез 18.24"
                23 -> res = "Иез 1.3; 8.4"
                24 -> res = "Иез 2.2"
                25 -> res = "Иез 4.8"
                26 -> res = "Иез 12.2"
                27 -> res = "Иез 2.5; Откр 22.11"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "Иез 17.17"
                6 -> res = "Чис 14.3"
                8 -> res = "Иез 3.25"
                13 -> res = "Ос 9.3"
                14 -> res = "Лев 22.8"
                16 -> res = "Лев 26.26; Иез 5.16; 12.19; 14.13"
                17 -> res = "Плач 2.12; Иез 24.22-23"
            }
        }
        if (glava == 5) {
            when (stih) {
                3, 12 -> res = "Иез 12.14"
                6 -> res = "Ис 2.6; Иер 2.11; Иез 11.12"
                7 -> res = "Иез 11.12"
                8 -> res = "Иер 1.16; 7.14; Иез 5.14"
                10 -> res = "Втор 28.53; 4 Цар 6.29; Плач 4.10"
                11 -> res = "Иез 7.4"
                13 -> res = "Иез 7.8"
                14 -> res = "Плач 2.15; 5.1"
                15 -> res = "Втор 28.37; Иез 14.8"
                16 -> res = "Иез 4.16; 14.13"
                17 -> res = "Лев 26.22; Иез 21.17"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Иез 36.1"
                3 -> res = "Иез 36.2; Ам 4.1"
                4 -> res = "Лев 26.30"
                7 -> res = "Иез 7.27"
                8 -> res = "Ис 43.5; Иез 12.16"
                9 -> res = "Ис 45.17; Иез 20.43; 36.31"
                11 -> res = "Иез 21.12"
                12 -> res = "Иер 24.10; 48.17; Иез 14.21"
                13 -> res = "3 Цар 14.23; 4 Цар 16.4; Иер 2.20"
                14 -> res = "Иер 6.8"
            }
        }
        if (glava == 7) {
            when (stih) {
                2 -> res = "Плач 4.18"
                4 -> res = "Иез 5.11; 22.31"
                8 -> res = "Иез 22.31"
                9 -> res = "Иез 8.18"
                10 -> res = "Иоил 2.2"
                15 -> res = "Плач 1.20; Иез 5.12"
                16 -> res = "Ис 38.14"
                17 -> res = "Иез 21.7"
                18 -> res = "Ис 15.2-3; Иер 48.37"
                19 -> res = "Иов 20.20; Притч 10.2; Сир 5.10; Соф 1.18"
                21 -> res = "Ис 1.7; Иер 6.12; Ос 7.9"
                25 -> res = "Иер 8.11"
                26 -> res = "Ис 29.14"
                27 -> res = "Втор 28.59; Ис 29.14; Иер 29.17"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Иез 14.1"
                2 -> res = "Иез 1.27"
                3 -> res = "Дан 5.5"
                4 -> res = "Иез 3.23"
                5 -> res = "Иер 7.30; 4 Цар 21.7"
                10 -> res = "Рим 1.23; Лев 26.30; Втор 27.15"
                11 -> res = "Втор 10.8; Иер 23.11"
                12 -> res = "Иез 9.9"
                16 -> res = "Иез 11.1; Втор 17.3"
                18 -> res = "Иез 5.11; Ис 1.15; Иер 11.11"
            }
        }
        if (glava == 9) {
            when (stih) {
                2 -> res = "Иез 10.2"
                3 -> res = "Иез 1.4; 10.4"
                4 -> res = "Откр 7.3"
                5 -> res = "Исх 32.27"
                6 -> res = "Плач 5.14; Иер 25.29; 1 Пет 4.17"
                8 -> res = "Иез 11.13"
                9 -> res = "Иез 8.12"
                10 -> res = "Иез 5.11; 11.21"
                11 -> res = "Иез 9.2"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Иез 1.26"
                2 -> res = "Иез 9.2; Пс 17.9"
                4 -> res = "Ис 6.4; Иез 9.3; 43.4"
                6 -> res = "Иез 9.2"
                9 -> res = "Иез 1.15-16"
                12 -> res = "Иез 1.15; Откр 4.6"
                14 -> res = "Иез 1.6; 41.19"
                15, 20 -> res = "Иез 1.3"
                17 -> res = "Иез 1.19-20"
                18 -> res = "Иез 11.23"
                21 -> res = "Иез 1.6"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Иез 8.3, 16"
                8 -> res = "Притч 10.24"
                10 -> res = "4 Цар 25.21; Иер 39.6; 52.10"
                12 -> res = "Иез 5.6-7"
                13 -> res = "Чис 16.45; Иез 9.8"
                15 -> res = "Иер 21.13"
                16 -> res = "Ис 57.13; Зах 8.13; Соф 3.17"
                17 -> res = "Иер 23.3"
                19 -> res = "Иер 24.7; 32.39; Иез 18.31; 36.26"
                20 -> res = "Иез 36.28"
                21 -> res = "Иез 9.10"
                23 -> res = "Иез 10.18"
                24 -> res = "Иез 8.3"
            }
        }
        if (glava == 12) {
            when (stih) {
                2 -> res = "Иер 5.21"
                3 -> res = "Иер 26.3; 36.3"
                6 -> res = "Иез 24.24"
                9 -> res = "Иер 23.33"
                12 -> res = "Иер 52.7; Ам 4.3"
                13 -> res = "Иез 17.20; 32.3; 4 Цар 25.7"
                14 -> res = "Иез 5.12"
                15 -> res = "Иез 22.15"
                16 -> res = "Ис 4.3; Зах 13.8"
                18 -> res = "Иез 4.16; Ос 9.4; Пс 126.2"
                19 -> res = "Иез 4.16"
                20 -> res = "Иер 4.27; 9.11; Мих 6.13"
                22 -> res = "Авв 2.3; 2 Пет 3.4; Иер 17.15"
                23 -> res = "Ос 1.4"
                24 -> res = "Чис 23.19; 1 Цар 3.19; Ис 34.16"
                27 -> res = "Иез 11.3"
            }
        }
        if (glava == 13) {
            when (stih) {
                2 -> res = "Иер 23.1; Плач 2.14; 2 Кор 2.17"
                3 -> res = "Иез 14.9"
                4 -> res = "Песн 2.15"
                5 -> res = "Иез 22.30"
                6 -> res = "Иер 5.31"
                7 -> res = "Иер 14.14"
                9 -> res = "Зах 13.4"
                10 -> res = "Иер 6.14"
                11 -> res = "Ис 28.17"
                16 -> res = "Иер 6.14; 8.11; Иез 13.10"
                18 -> res = "Мих 3.5; Рим 16.18; 2 Тим 3.6"
                19 -> res = "Соф 3.4; 1 Пет 5.2; Притч 17.15"
                22 -> res = "Иер 23.14"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Иез 8.1; 20.1"
                3 -> res = "Иер 8.5; Иез 20.3"
                7 -> res = "Соф 1.6"
                8 -> res = "Втор 28.37; Иез 5.15"
                9 -> res = "Иез 13.3"
                11 -> res = "Исх 19.5; Лев 26.12; Иез 36.28"
                13 -> res = "Иез 4.16; 5.16"
                14 -> res = "Иер 15.1; 2 Пет 2.5; Иов 42.8"
                15 -> res = "Лев 26.22; Иез 5.17"
                21 -> res = "Лев 26.16; Иер 24.10; Иез 5.17"
                22 -> res = "Иер 4.27"
            }
        }
        if (glava == 15) {
            if (stih == 4) {
                res = "2 Цар 23.6; Ин 15.6"
            }
        }
        if (glava == 16) {
            when (stih) {
                2 -> res = "Ис 58.1"
                3 -> res = "Быт 10.16; 27.46"
                6 -> res = "Лк 15.20; Ам 5.4"
                7 -> res = "Откр 3.17"
                8 -> res = "Исх 19.4; Ос 2.19"
                10 -> res = "Ис 61.10; Откр 19.8"
                12 -> res = "Ис 28.5; Притч 4.9"
                13 -> res = "Лк 22.29"
                15 -> res = "Ис 1.21; Ос 2.2"
                16 -> res = "Ос 2.8-9"
                20 -> res = "Лев 18.21"
                21 -> res = "Иез 20.31"
                24 -> res = "Иер 3.2"
                26 -> res = "Иез 23.20"
                30 -> res = "Кол 2.11; Иез 23.44"
                31 -> res = "Ос 8.11"
                32 -> res = "Притч 7.19"
                33 -> res = "Быт 38.16-17"
                35 -> res = "Ос 5.3"
                37 -> res = "Наум 3.5"
                38 -> res = "Иез 23.10"
                40 -> res = "Иез 23.47"
                41 -> res = "4 Цар 25.9; Иер 52.10"
                42 -> res = "Иез 5.13"
                43 -> res = "Иез 9.10"
                44 -> res = "Ос 2.5"
                45 -> res = "Иез 16.3"
                46 -> res = "Иер 3.7; Ос 2.1; Рим 9.29"
                48 -> res = "Быт 18.20"
                49 -> res = "Сир 16.9; Лк 17.28"
                51 -> res = "4 Цар 17.7; Иез 23.11"
                52 -> res = "Иер 3.11"
                53 -> res = "Иер 29.14; Иез 39.25"
                54 -> res = "Иез 5.15"
                59 -> res = "Неем 10.29"
                60 -> res = "Лк 1.72; Евр 8.8"
                61 -> res = "Иез 36.31"
                62 -> res = "Гал 4.6"
                63 -> res = "Иез 6.9; Рим 6.21"
            }
        }
        if (glava == 17) {
            when (stih) {
                2 -> res = "Иез 20.49"
                3 -> res = "Дан 7.4; Ос 8.1; Иез 31.3"
                10 -> res = "Иез 27.26"
                12 -> res = "4 Цар 24.10; 2 Пар 36.10"
                13 -> res = "Иер 34.19"
                15 -> res = "4 Цар 24.20; Ис 30.2"
                16 -> res = "4 Цар 24.17, 20; Иер 34.3"
                17 -> res = "4 Цар 25.1; Ис 29.3; Иез 4.2"
                18 -> res = "1 Езд 10.19"
                19 -> res = "Иез 9.10"
                20 -> res = "Иез 12.13; 32.3"
                21 -> res = "Иез 12.14"
                22 -> res = "Иез 31.3"
                23 -> res = "Дан 4.9"
                24 -> res = "Иез 36.36; 37.14"
            }
        }
        if (glava == 18) {
            when (stih) {
                2 -> res = "Иер 31.29"
                4 -> res = "Втор 24.16; Рим 2.9"
                6 -> res = "Лев 18.20"
                7 -> res = "Исх 22.26-27; Лев 19.13; Втор 15.7; Ис 58.7; Мф 25.35"
                8 -> res = "Исх 22.25"
                13 -> res = "Иез 22.12; Неем 5.7"
                16 -> res = "Втор 15.8; Ис 58.7"
                20 -> res = "Втор 24.16; 4 Цар 14.6; 2 Пар 25.4"
                21 -> res = "Иер 18.8"
                22 -> res = "Мих 7.19"
                23 -> res = "Ис 55.7; Иез 33.11"
                24 -> res = "Иез 3.20"
                25 -> res = "Иез 33.17, 20"
                28 -> res = "3 Цар 12.16"
                30 -> res = "Мф 3.2"
                31 -> res = "Иер 32.39; Иез 11.19"
                32 -> res = "2 Цар 14.14; Прем 1.13; Иез 33.11"
            }
        }
        if (glava == 19) {
            when (stih) {
                2 -> res = "Наум 2.11; Соф 3.3"
                3 -> res = "4 Цар 23.31; Зах 11.3"
                4 -> res = "4 Цар 23.33; Иер 22.11-12"
                5 -> res = "4 Цар 23.34"
                7 -> res = "Ам 3.4, 6"
                8 -> res = "Иез 17.20"
                9 -> res = "2 Пар 36.6"
                12 -> res = "Ос 13.15"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "Иез 14.1"
                3 -> res = "Иез 14.3"
                4 -> res = "Иез 22.2"
                5 -> res = "Исх 3.6, 8"
                6 -> res = "Исх 3.17"
                7 -> res = "Исх 23.24; 34.13"
                9 -> res = "Чис 14.16; Ис 52.5"
                10 -> res = "Исх 16.1"
                11 -> res = "Лев 18.5; Неем 9.29; Рим 10.5; Гал 3.12"
                12 -> res = "Исх 20.8; 31.13; Втор 5.12"
                13 -> res = "Исх 16.28-29"
                14 -> res = "Чис 14.16; Втор 9.28"
                15 -> res = "Чис 14.30; Пс 94.11; Евр 3.11"
                16 -> res = "Ос 9.17"
                17 -> res = "Иез 5.11"
                18 -> res = "Втор 4.25"
                21 -> res = "Дан 9.11"
                22 -> res = "Чис 14.13"
                25 -> res = "Пс 80.13; 2 Фес 2.9-10"
                26 -> res = "Иез 20.31"
                28 -> res = "Быт 17.8; 22.16"
                29 -> res = "Втор 12.2"
                31 -> res = "Иез 16.21"
                32 -> res = "Иер 44.17; Ос 4.13"
                35 -> res = "Ис 1.18"
                36 -> res = "Чис 14.22"
                37 -> res = "1 Кор 4.21"
                38 -> res = "Мф 25.31-32"
                39 -> res = "Ис 29.23"
                40 -> res = "Ис 27.13; Зах 8.22; 14.16"
                41 -> res = "Рим 12.1; 15.16; Флп 4.18"
                43 -> res = "Иез 6.9; 16.61"
                46 -> res = "Ам 7.15"
                47 -> res = "Иер 11.16; 17.27; Иез 28.18"
                48 -> res = "Иер 7.20"
                49 -> res = "Иез 17.2"
            }
        }
        if (glava == 21) {
            when (stih) {
                2 -> res = "Иез 20.46"
                3 -> res = "Иез 20.47"
                7 -> res = "Иез 7.17"
                9 -> res = "Иез 33.27; Иер 47.6"
                12 -> res = "Иез 6.11"
                17 -> res = "Пс 2.4; Притч 1.26; Иез 5.17"
                21 -> res = "Авд 1.14; Ис 19.3"
                22 -> res = "Иез 23.24"
                26 -> res = "4 Цар 25.27"
                27 -> res = "Зах 9.9; Откр 19.16"
                28 -> res = "Иер 49.2"
                29 -> res = "Пс 36.13; Иез 35.5"
            }
        }
        if (glava == 22) {
            when (stih) {
                2 -> res = "Иез 20.4"
                4 -> res = "4 Цар 21.16"
                6 -> res = "Мих 3.1"
                7 -> res = "Пс 93.6"
                10 -> res = "Лев 18.7-8, 19"
                11 -> res = "Лев 18.9, 15, 20; Иез 33.26"
                12 -> res = "Лев 25.36; Притч 28.8"
                14 -> res = "Иез 17.24"
                15 -> res = "Иез 12.15"
                18 -> res = "Иер 6.28"
                21 -> res = "Втор 4.24; Ис 30.27; Наум 1.6"
                22 -> res = "Зах 13.9; Мал 3.3; 4.1"
                24 -> res = "Евр 6.7"
                25 -> res = "Ис 1.23; Мих 3.2; Соф 3.3; Мф 23.14"
                26 -> res = "Мих 3.11; Соф 3.4; Иез 44.23"
                27 -> res = "Мих 3.10; Соф 3.3"
                28 -> res = "Иез 13.6"
                29 -> res = "Ис 3.5; Иер 9.3; Исх 22.21"
                30 -> res = "Иез 13.5"
                31 -> res = "Иез 7.4, 8"
            }
        }
        if (glava == 23) {
            when (stih) {
                2 -> res = "Иер 3.7-8"
                3 -> res = "Пс 72.27; Ос 1.2; Наум 3.4; Иез 16.26"
                4 -> res = "Иез 16.46"
                5 -> res = "Ос 2.2; 5.3; 4 Цар 15.19"
                7 -> res = "Иез 16.15"
                8 -> res = "Иез 16.26"
                10 -> res = "Иез 16.38-39"
                11 -> res = "Иез 16.51"
                14 -> res = "Иез 8.3"
                17 -> res = "Иез 23.22"
                20 -> res = "Иер 5.8; 8.12; Иез 16.26"
                23 -> res = "Иез 23.12"
                24 -> res = "Иез 21.22"
                26 -> res = "Иез 16.39"
                29 -> res = "Иер 13.22; Иез 16.37"
                31 -> res = "Пс 74.9; Иер 25.15"
                35 -> res = "Иер 2.32; 3.21; Ос 2.13"
                37 -> res = "Иер 7.31; Иез 16.20; 20.26"
                39 -> res = "Ис 1.11-12"
                44 -> res = "Иез 16.30"
                45 -> res = "Иез 16.38; Ис 1.15"
                47 -> res = "Иез 16.40"
                49 -> res = "Иез 7.27; 26.6; 39.26"
            }
        }
        if (glava == 24) {
            when (stih) {
                2 -> res = "Иер 22.30; 4 Цар 25.1"
                4 -> res = "Мих 3.3"
                6 -> res = "Наум 3.1; Авв 2.12"
                7 -> res = "Быт 4.10; Иез 26.4; Пс 78.13"
                9 -> res = "Наум 3.1"
                13 -> res = "Иез 5.13; 16.42"
                16 -> res = "Притч 31.10; Сир 26.16; 1 Кор 7.29-30"
                17 -> res = "Втор 26.14; Ос 9.4; Иез 24.22"
                22 -> res = "Иер 16.7; Иез 24.17"
                23 -> res = "Иез 24.22"
                24 -> res = "Иез 12.6"
                25 -> res = "Пс 143.12"
                26 -> res = "Иез 33.21"
                27 -> res = "Иез 15.7; 24.24; 29.21; Ам 5.13"
            }
        }
        if (glava == 25) {
            when (stih) {
                2 -> res = "Иер 49.1"
                3 -> res = "Пс 34.21; Иез 26.2; 36.2"
                5 -> res = "Иез 24.27; 26.6"
                7 -> res = "Иез 7.27; 13.23"
                8 -> res = "Ис 15.1; Иер 48.1; Иез 35.2"
                9 -> res = "Иер 48.1; Ам 2.2"
                12 -> res = "Иер 49.7; Авд 1.8"
                13 -> res = "Ам 1.12"
                15 -> res = "Ис 14.2; Иер 47.1-2"
            }
        }
        if (glava == 26) {
            when (stih) {
                2 -> res = "Ис 23.1; Иер 47.4"
                3 -> res = "Ис 8.7"
                6 -> res = "Иез 25.7"
                7 -> res = "Иез 28.7; Дан 2.37"
                9 -> res = "Иез 4.2; 21.22"
                13 -> res = "Ис 24.8; Иер 7.34"
                14 -> res = "Иез 26.4"
                15 -> res = "Иез 24.21"
                16 -> res = "Откр 18.9"
                17 -> res = "Ос 9.13"
                20 -> res = "Иез 28.8; 31.14; Пс 142.7"
            }
        }
        if (glava == 27) {
            when (stih) {
                2 -> res = "Ис 23.1; Ам 1.9"
                3 -> res = "Иез 28.12"
                4 -> res = "Иез 28.2"
                5 -> res = "Втор 3.9"
                6 -> res = "Ис 2.13; Быт 10.4, 15; Чис 24.24"
                7 -> res = "Быт 10.4"
                8 -> res = "Быт 10.15, 18"
                9 -> res = "3 Цар 5.18; Пс 82.8"
                10 -> res = "Быт 10.13; 1 Цар 31.9; Иер 46.9"
                13 -> res = "Быт 10.2"
                15 -> res = "Иер 25.23"
                21 -> res = "Быт 25.13; Иер 2.10"
                22 -> res = "Быт 10.7"
                27 -> res = "Откр 18.17"
                30 -> res = "Откр 18.9"
                31 -> res = "Иер 16.6; 48.37"
                35 -> res = "Откр 18.11"
            }
        }
        if (glava == 28) {
            when (stih) {
                2 -> res = "Дан 5.20; Деян 12.22"
                3 -> res = "Дан 4.5"
                6 -> res = "Иез 28.2"
                7 -> res = "Иез 26.7; 30.11"
                8 -> res = "Иез 26.20; 31.16, 18"
                12 -> res = "Иез 27.3"
                13 -> res = "Иез 31.8; Откр 17.4"
                17 -> res = "1 Кор 4.9"
                18 -> res = "Иов 22.20; Иез 20.47"
                19 -> res = "Иез 27.36"
                21 -> res = "Ис 23.4, 12"
                22 -> res = "Исх 14.18; Пс 45.11; Иез 26.6"
                24 -> res = "Чис 33.55"
                25 -> res = "Лев 11.44"
            }
        }
        if (glava == 29) {
            when (stih) {
                2 -> res = "Ис 19.1; Иер 46.2"
                3 -> res = "Пс 73.13; Ис 27.1"
                4 -> res = "Пс 31.9; Ис 37.29; Иез 38.4"
                5 -> res = "Иер 7.33; 16.4; Иез 32.4"
                6 -> res = "4 Цар 18.21; Ис 36.6"
                8 -> res = "Иер 44.30"
                10 -> res = "Иез 30.6"
                11 -> res = "Иез 32.13"
                12 -> res = "Иез 30.23"
                13 -> res = "Ис 19.18"
                14 -> res = "Быт 10.14; Иер 44.1"
                16 -> res = "Плач 4.17; Иез 26.6"
                18 -> res = "Пс 136.8"
                20 -> res = "Ис 10.5"
                21 -> res = "Иез 24.27"
            }
        }
        if (glava == 30) {
            when (stih) {
                3 -> res = "Иоил 2.2; Соф 1.14"
                4 -> res = "Ис 20.3"
                6 -> res = "Иез 29.10"
                8 -> res = "Иез 29.16"
                9 -> res = "Исх 12.29"
                11 -> res = "Иез 31.11"
                12 -> res = "Ис 19.5; Иез 5.17"
                13 -> res = "Зах 13.2"
                14 -> res = "Иер 44.1"
                15 -> res = "Иер 46.25; Ос 9.6"
                17 -> res = "Исх 1.11"
                18 -> res = "Иер 46.14"
                19 -> res = "Иер 1.16"
                21 -> res = "Иер 48.25"
                23 -> res = "Иез 29.12"
            }
        }
        if (glava == 31) {
            when (stih) {
                3 -> res = "Иез 32.22; Пс 36.35; Дан 4.7"
                5 -> res = "Дан 4.8"
                6 -> res = "Дан 4.9"
                8 -> res = "Иез 28.13"
                11 -> res = "Иез 30.11"
                12 -> res = "Иез 28.7; 30.11"
                14 -> res = "Пс 33.17; 62.10; 142.7"
                15 -> res = "Ис 14.11"
                16 -> res = "Ис 14.9; Иез 28.8; 32.18"
                18 -> res = "Иез 28.8"
            }
        }
        if (glava == 32) {
            when (stih) {
                2 -> res = "Ис 5.29; Иер 49.19; Иез 29.3"
                3 -> res = "Иез 12.13; 17.20"
                4 -> res = "Иез 29.5"
                7 -> res = "Ис 13.10; Иоил 2.31; 3.15; Мф 24.29; Мк 13.24"
                9 -> res = "Исх 15.14"
                12 -> res = "Иез 28.7"
                13 -> res = "Иез 29.11"
                15 -> res = "Иез 30.8; 33.29"
                18 -> res = "Ис 14.9; Иез 26.20; 28.8"
                19 -> res = "Ис 14.11"
                21 -> res = "Ис 14.10"
                22 -> res = "Иез 31.3"
                23 -> res = "Ис 14.15"
                24 -> res = "Быт 10.22; Иер 49.34"
                25 -> res = "Иез 32.18"
            }
        }
        if (glava == 33) {
            when (stih) {
                2 -> res = "4 Цар 9.17"
                7 -> res = "Ис 58.1; Иез 3.17"
                8 -> res = "Иез 24.8; Деян 18.6"
                10 -> res = "Пс 37.5; 89.8-9"
                11 -> res = "2 Цар 14.14; Иез 18.23, 32; Агг 1.5"
                12 -> res = "Иез 18.24"
                13 -> res = "1 Кор 10.12"
                15 -> res = "Исх 22.26; Втор 24.13"
                16 -> res = "Ис 43.25; Иер 31.34"
                17 -> res = "Иез 18.25"
                20 -> res = "Пс 61.13; Притч 24.12; Иер 39.19; Иез 18.30; Мф 16.27; Рим 2.6"
                21 -> res = "4 Цар 25.4"
                22 -> res = "Иез 24.27"
                24 -> res = "Рим 4.13; Ис 51.2"
                25 -> res = "Втор 12.23"
                26 -> res = "Иез 22.11"
                27 -> res = "Ам 9.3"
                29 -> res = "Иез 26.6; 28.24"
                31 -> res = "Ис 42.20; 53.1"
            }
        }
        if (glava == 34) {
            when (stih) {
                3 -> res = "Иер 23.1; Зах 11.17"
                4 -> res = "1 Пет 5.3"
                5 -> res = "Ис 53.6; Мф 9.36"
                10 -> res = "Иез 3.18; 33.8"
                11 -> res = "Зах 13.7; Ин 10.12"
                12 -> res = "Иер 23.4; Лк 15.4"
                13 -> res = "Соф 3.13; Пс 64.14"
                14 -> res = "Пс 22.2"
                16 -> res = "Мф 10.6; 15.24; Лк 15.4"
                17 -> res = "Мф 25.32"
                23 -> res = "Пс 22.1; Ис 40.11; Иер 23.5; Иез 37.24; Ин 10.11; Евр 13.20"
                25 -> res = "Иез 37.26; Ос 2.18"
                26 -> res = "Иоил 2.23"
                27 -> res = "Пс 67.10"
                28 -> res = "Иер 46.27"
                29 -> res = "Ис 4.2; 11.1"
                31 -> res = "Пс 99.3; Иез 36.37; Ин 10.11"
            }
        }
        if (glava == 35) {
            when (stih) {
                2 -> res = "Иез 25.8; Авд 1.10"
                3 -> res = "Ис 31.3"
                4, 11 -> res = "Иез 7.27"
                5 -> res = "Ам 1.11; Иез 21.29"
                9 -> res = "Мал 1.4-5"
                10 -> res = "Пс 82.13"
                12 -> res = "Авд 1.12"
                15 -> res = "Авд 1.15"
            }
        }
        if (glava == 36) {
            when (stih) {
                1 -> res = "Иез 6.2"
                2 -> res = "Иез 25.3; 26.2; Авд 1.12"
                6 -> res = "Иез 39.25-26; Иоил 2.18"
                8 -> res = "Иер 31.4-5"
                9 -> res = "Зах 8.12; 10.8"
                11 -> res = "Втор 30.3, 5"
                13 -> res = "Лев 26.38"
                15 -> res = "Ис 25.8"
                17 -> res = "Ис 64.6"
                19 -> res = "Иез 20.23; 22.15"
                20 -> res = "Ис 52.5; Рим 2.24"
                21 -> res = "Чис 14.15-16"
                22 -> res = "Втор 9.6; Иез 36.32"
                23 -> res = "Мф 6.9; Рим 2.24; Иез 39.27"
                25 -> res = "Ис 44.3; Зах 13.1"
                26 -> res = "Иер 32.39; Иез 11.19; Иоил 2.28; Деян 2.17"
                27 -> res = "Ис 59.21"
                28 -> res = "Иез 11.20; 37.23"
                29 -> res = "Пс 31.2; Ос 2.21-22; Зах 9.17"
                31 -> res = "Иез 6.9; 16.61"
                32 -> res = "Иез 36.22"
                35 -> res = "Ис 51.3"
                36 -> res = "Иез 17.24"
                38 -> res = "Мих 2.12"
            }
        }
        if (glava == 37) {
            when (stih) {
                1 -> res = "Иез 1.3"
                3 -> res = "Ис 26.19; Дан 12.2"
                4 -> res = "Лк 7.14; Ин 5.29"
                5 -> res = "Быт 2.7"
                8 -> res = "Иов 19.25-26"
                11 -> res = "Плач 4.8; Ин 11.39"
                14 -> res = "Зах 12.10; Иез 17.24"
                16 -> res = "Иез 4.1"
                21 -> res = "Ис 11.12"
                22 -> res = "Ин 10.16"
                23 -> res = "Иер 7.23"
                24 -> res = "Ис 40.11; Иер 23.5; 30.9; Иез 34.23; Ин 10.11"
                25 -> res = "Дан 9.24"
                26 -> res = "Пс 88.4; Иез 34.25"
                27 -> res = "Лев 26.11-12; 2 Кор 6.16; Иез 11.20"
            }
        }
        if (glava == 38) {
            when (stih) {
                2 -> res = "Откр 20.7"
                3 -> res = "Иез 39.1"
                4 -> res = "4 Цар 19.28; Иез 29.4"
                6 -> res = "Быт 10.2-3"
                8 -> res = "Ис 24.22"
                16 -> res = "Иез 38.9"
                19 -> res = "Мф 24.29; Лк 21.26"
                20 -> res = "Откр 6.14"
                21 -> res = "Мк 13.12"
                22 -> res = "Иез 11.10; Откр 20.9"
                23 -> res = "Иез 26.6"
            }
        }
        if (glava == 39) {
            when (stih) {
                1 -> res = "Иез 38.3"
                3 -> res = "Ос 2.18"
                4 -> res = "Иез 29.5; 32.4"
                6 -> res = "Откр 20.7, 9"
                7 -> res = "Ис 45.17; Иез 38.23"
                9 -> res = "Ис 9.5"
                17 -> res = "Откр 19.17; Ис 34.3"
                18 -> res = "Ис 34.6"
                21 -> res = "Пс 45.11"
                23 -> res = "Иер 50.7"
                25 -> res = "Иер 31.23; 33.7; Иез 16.53"
                27 -> res = "Иер 32.37"
                29 -> res = "Ис 44.3; Иоил 2.28; Зах 12.10"
            }
        }
        if (glava == 40) {
            when (stih) {
                1 -> res = "4 Цар 25.4; Иез 1.2-3"
                2 -> res = "Откр 21.10"
                3 -> res = "Откр 21.15; Ам 7.7; Зах 2.1"
                4 -> res = "Иез 43.10"
                5 -> res = "Откр 21.15, 17"
                44 -> res = "1 Пар 23.5"
                46 -> res = "Евр 13.10"
                47 -> res = "Иез 43.13; Исх 40.5"
            }
        }
        if (glava == 41) {
            when (stih) {
                4 -> res = "Исх 26.33; Лев 16.2; Иез 43.12"
                7 -> res = "3 Цар 6.8"
                16 -> res = "3 Цар 6.4"
                18 -> res = "3 Цар 6.32; Иез 10.14"
                19 -> res = "Иез 1.10"
                22 -> res = "Исх 30.1-2"
                23 -> res = "3 Цар 6.34"
                26 -> res = "Иез 40.16"
            }
        }
        if (glava == 42) {
            when (stih) {
                1 -> res = "Иез 46.19"
                13 -> res = "Лев 10.17; Ис 64.11"
                14 -> res = "Иез 44.19"
                20 -> res = "Иез 45.2"
            }
        }
        if (glava == 43) {
            when (stih) {
                1 -> res = "Иез 40.6"
                2 -> res = "Иез 1.24"
                3 -> res = "Иез 1.3"
                5 -> res = "Иез 8.3; Исх 40.34; 3 Цар 8.11"
                7 -> res = "Пс 67.17; Зах 6.13; Откр 21.3"
                10 -> res = "Иез 16.63; 40.4"
                12 -> res = "Иез 41.4"
                13 -> res = "Иез 40.5"
                17 -> res = "Иез 43.13"
                18 -> res = "Исх 40.16; Лев 8.11"
                19 -> res = "Иез 40.46"
                21 -> res = "Лев 16.3"
                26 -> res = "Исх 28.41"
            }
        }
        if (glava == 44) {
            when (stih) {
                1 -> res = "Иез 40.3"
                3 -> res = "Иез 46.8"
                4 -> res = "Иез 43.5"
                5 -> res = "Иез 40.4"
                6 -> res = "Иез 45.9; Чис 16.7"
                7 -> res = "Деян 21.28"
                10 -> res = "Иез 48.11; Деян 21.28"
                13 -> res = "Ос 4.6"
                15 -> res = "Иез 40.46; 48.11"
                16 -> res = "Лев 24.6"
                17 -> res = "Лев 19.19; Втор 22.11"
                18 -> res = "Исх 28.42"
                19 -> res = "Иез 42.14"
                20 -> res = "Лев 19.27"
                21 -> res = "Лев 10.9"
                22 -> res = "Лев 21.13-14"
                23 -> res = "Лев 10.10; Иез 22.26; Мал 2.7"
                24 -> res = "Втор 17.18; 2 Пар 19.10"
                25 -> res = "Лев 21.1"
                26 -> res = "Чис 19.11-12"
                28 -> res = "Чис 18.20; Втор 10.9; 18.2"
                30 -> res = "Исх 13.2; 22.29"
                31 -> res = "Исх 22.31; Лев 22.8"
            }
        }
        if (glava == 45) {
            when (stih) {
                1 -> res = "Иез 48.8-9"
                2 -> res = "Иез 42.20"
                8 -> res = "Иез 46.18"
                9 -> res = "Иез 44.6; Ис 1.16"
                10 -> res = "Лев 19.35"
                12 -> res = "Исх 30.13; Лев 27.25; Чис 3.47"
                17 -> res = "Иез 46.11-12"
                21 -> res = "Лев 23.5; Чис 28.16-17"
                22 -> res = "Иез 46.2"
                23 -> res = "Чис 28.24"
                24 -> res = "Иез 46.11"
                25 -> res = "Чис 29.12"
            }
        }
        if (glava == 46) {
            when (stih) {
                2 -> res = "Иез 45.22"
                4 -> res = "Чис 28.10"
                8 -> res = "Иез 44.3"
                11 -> res = "Чис 28.26; Иез 45.17"
                13 -> res = "Чис 28.3"
                18 -> res = "Иез 45.8; 3 Цар 21.3"
                19 -> res = "Иез 42.1"
                24 -> res = "1 Цар 2.13"
            }
        }
        if (glava == 47) {
            when (stih) {
                1, 8 -> res = "Зах 14.8"
                5 -> res = "Рим 11.33"
                7 -> res = "Откр 22.1-2"
                9 -> res = "Рим 11.16; Мф 13.47"
                10 -> res = "Иер 16.16"
                12 -> res = "Ис 65.22; Откр 22.2"
                14 -> res = "Быт 12.7"
                17 -> res = "Чис 34.9"
                18 -> res = "Чис 34.10"
                19 -> res = "Чис 20.13; 34.3; Иез 48.28"
                22 -> res = "Ис 56.3; Гал 3.28"
            }
        }
        if (glava == 48) {
            when (stih) {
                8, 9 -> res = "Иез 45.1"
                11 -> res = "Иез 44.15"
                14 -> res = "Лев 25.34"
                20 -> res = "Откр 21.16"
                28 -> res = "Иез 47.19"
                31 -> res = "Откр 21.12"
                35 -> res = "Ис 62.2; Лев 26.12; Пс 45.6"
            }
        }
        return res
    }

    fun kniga34(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "4 Цар 24.10; 2 Пар 36.5"
                2 -> res = "2 Пар 36.6-7"
                3 -> res = "4 Цар 20.18; Ис 39.7"
                4 -> res = "Ис 39.7"
                5 -> res = "4 Цар 25.30"
                7 -> res = "Дан 5.12"
                8 -> res = "Лев 11.4; Тов 1.11; Иудифь 12.2"
                9 -> res = "Притч 16.7"
                17 -> res = "Быт 40.12-13; 41.28-29"
                19 -> res = "Иез 28.3"
                20 -> res = "Иез 28.3; Дан 5.11"
                21 -> res = "Дан 6.28"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Дан 4.3"
                4 -> res = "Дан 3.9; 5.10; 6.6"
                6 -> res = "Дан 5.7"
                10 -> res = "Быт 41.8"
                18 -> res = "Пс 144.19"
                19 -> res = "Иоил 2.28"
                20 -> res = "Пс 112.2"
                21 -> res = "1 Цар 2.7-8; Притч 8.14; Дан 4.14"
                22 -> res = "1 Кор 4.5; Евр 4.13; 1 Тим 6.16"
                26 -> res = "Дан 1.17"
                29 -> res = "Ам 3.7"
                30 -> res = "Дан 5.12"
                34 -> res = "Мф 21.44; Лк 20.18"
                35 -> res = "Пс 1.4; Лк 20.17-18; Еф 4.10"
                37 -> res = "Дан 5.18"
                38 -> res = "Иер 27.6; 28.14; Ис 13.19"
                43 -> res = "Дан 11.17"
                44 -> res = "Дан 4.31; 6.26; 7.14; Мих 4.7; Лк 1.33"
                46 -> res = "Деян 14.13"
                47 -> res = "Дан 4.6"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Рим 1.23"
                5 -> res = "Мф 4.9; Деян 19.28"
                9 -> res = "Дан 2.4; 5.10"
                10 -> res = "Дан 6.12"
                12 -> res = "Дан 2.48"
                15 -> res = "Исх 5.2; 4 Цар 18.35; Мф 27.43"
                16 -> res = "Деян 20.24"
                17 -> res = "Пс 65.12; 85.13"
                18 -> res = "Исх 20.5; 23.24; Деян 5.29"
                92 -> res = "Дан 7.13; Мф 27.54"
                93 -> res = "Дан 6.20"
                94 -> res = "Ис 43.2; Евр 11.34"
                95 -> res = "Пс 33.8; 90.11; Дан 6.22"
                96 -> res = "1 Езд 6.11; Иер 10.10; Дан 6.27"
                100 -> res = "Дан 7.14"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "Дан 2.1"
                5 -> res = "Иез 28.3"
                6 -> res = "Дан 2.47"
                7 -> res = "Иез 31.3"
                9 -> res = "Иез 31.6"
                10 -> res = "Пс 33.8; 90.11"
                11 -> res = "Иер 8.13"
                12 -> res = "Иов 14.7"
                14 -> res = "Пс 112.7-8"
                15 -> res = "Дан 1.17; 6.3"
                17 -> res = "Иез 31.3; Пс 36.35"
                19 -> res = "Дан 2.38; 5.18"
                22, 30 -> res = "Дан 5.21"
                24 -> res = "Сир 3.1"
                27 -> res = "Дан 5.20"
                28 -> res = "Деян 12.23; Иез 31.11-12"
                29 -> res = "Дан 4.22; 5.21"
                31 -> res = "Дан 2.44; 7.14"
                32 -> res = "Иов 9.12"
                34 -> res = "Пс 110.7"
            }
        }
        if (glava == 5) {
            when (stih) {
                2 -> res = "4 Цар 24.13"
                5 -> res = "Иез 8.3"
                7 -> res = "Дан 5.16"
                8 -> res = "Дан 2.2, 6"
                10 -> res = "Дан 2.4"
                11 -> res = "Дан 4.5"
                12 -> res = "Дан 1.7; 2.30"
                13 -> res = "Дан 1.6"
                18 -> res = "Дан 2.37"
                19 -> res = "Дан 11.3"
                20 -> res = "Иез 28.2; Дан 4.27; Деян 12.23"
                21 -> res = "Дан 4.22, 30"
                23 -> res = "Пс 103.29; 134.15-16; Иер 10.23"
                27 -> res = "Откр 3.16"
                29 -> res = "Ис 22.21"
                31 -> res = "Ис 13.17"
            }
        }
        if (glava == 6) {
            when (stih) {
                3 -> res = "Сир 11.1"
                4 -> res = "1 Кор 4.2; Тит 2.8"
                5 -> res = "Мк 14.55; Деян 4.14"
                8 -> res = "Есф 1.19; 8.8"
                10 -> res = "3 Цар 8.48; Пс 54.18"
                17 -> res = "Мф 27.66"
                20 -> res = "Дан 3.93; Иер 10.10; Мф 27.43"
                22 -> res = "1 Мак 2.60"
                23 -> res = "Пс 36.40; 90.14; Евр 11.33"
                24 -> res = "Притч 26.27; 28.10"
                26 -> res = "Пс 9.37; Дан 2.44"
                27 -> res = "Дан 3.50; 6.22; Ис 63.9"
                28 -> res = "Дан 1.21"
            }
        }
        if (glava == 7) {
            when (stih) {
                4 -> res = "Притч 30.30; Иер 48.40; Иез 17.3"
                7 -> res = "Дан 7.19; Ис 28.3; Откр 13.1"
                8 -> res = "Дан 8.9; Откр 13.5"
                9 -> res = "Откр 4.2; Дан 7.22; Ис 6.1"
                10 -> res = "Откр 5.11; 20.12"
                11 -> res = "Откр 13.5; 19.20; 20.10"
                12 -> res = "Дан 2.21"
                13 -> res = "Мф 24.30; Ин 3.13; Откр 1.13"
                14 -> res = "Дан 2.44; 4.31; Мих 4.7; Лк 1.33"
                16 -> res = "Дан 5.7"
                18 -> res = "Дан 7.27; Откр 7.12; 11.15"
                19 -> res = "Дан 7.7"
                20 -> res = "Откр 17.12, 16"
                21 -> res = "Откр 11.7"
                22 -> res = "Дан 7.9; Мф 25.24; Деян 3.20"
                24 -> res = "Откр 12.3; 17.12"
                25 -> res = "Дан 11.36; Откр 12.14"
                26 -> res = "1 Кор 15.24"
                27 -> res = "Лк 1.33"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Дан 7.1"
                2 -> res = "Есф 1.2"
                4 -> res = "Дан 11.36"
                8 -> res = "Дан 8.22; 11.4"
                9 -> res = "Дан 7.8"
                10 -> res = "Ис 14.12"
                11 -> res = "1 Мак 1.47"
                12 -> res = "Дан 11.31; Евр 10.11"
                15 -> res = "Дан 7.19"
                16 -> res = "Дан 9.21"
                17 -> res = "1 Пет 4.7"
                18 -> res = "Дан 10.9; Откр 1.17"
                19 -> res = "1 Кор 15.52"
                20 -> res = "Дан 8.3"
                22 -> res = "Дан 8.8; 11.4"
                23 -> res = "Дан 8.12; Втор 28.50"
                24 -> res = "Дан 8.10; 1 Мак 1.19, 23"
                25 -> res = "1 Мак 1.31"
                26 -> res = "Дан 12.9; Откр 22.10"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Агг 1.1; Дан 5.31"
                2 -> res = "1 Езд 1.1; 2 Пар 36.22; Иер 25.12; 29.10"
                4 -> res = "Исх 20.6; Втор 7.9; Неем 1.5; 9.32"
                5 -> res = "Пс 105.6; Вар 1.17; 2.12"
                6 -> res = "Иер 44.16"
                7 -> res = "Пс 144.17; Иер 9.24; Вар 1.15"
                8 -> res = "Неем 9.34; Иер 2.26; 3.25"
                9 -> res = "Пс 129.4; Лк 1.72"
                10 -> res = "2 Пар 36.15; Соф 3.2"
                11 -> res = "Втор 28.15; Плач 2.17; Вар 1.20; Мал 2.2"
                12 -> res = "Вар 2.1"
                14 -> res = "Пс 144.17"
                15 -> res = "Исх 12.41; Вар 2.11"
                16 -> res = "Вар 2.13"
                18 -> res = "Вар 2.17"
                21 -> res = "Дан 8.16"
                23 -> res = "1 Езд 6.14; Дан 10.12"
                24 -> res = "Иер 23.5; Иез 37.25"
                25 -> res = "1 Езд 6.14; Лк 7.19"
                26 -> res = "Ис 53.8; Мф 24.2; Дан 11.10"
                27 -> res = "Мф 24.15; Мк 13.14; Лк 21.20"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Дан 1.7"
                3 -> res = "Пс 103.15"
                4 -> res = "Быт 2.14"
                5 -> res = "Дан 12.6; Откр 1.13"
                6 -> res = "Откр 1.14-15; Иез 1.24"
                8 -> res = "Иов 4.14; Дан 7.28"
                9 -> res = "Дан 8.18"
                10 -> res = "Откр 1.17"
                11 -> res = "Дан 9.23"
                12 -> res = "Дан 9.23; Чис 29.7; 30.14"
                13 -> res = "Дан 12.1; Иуд 1.9; Откр 12.7"
                18 -> res = "Дан 10.5, 16"
                19 -> res = "Дан 10.11"
            }
        }
        if (glava == 11) {
            when (stih) {
                3 -> res = "Дан 5.19"
                4 -> res = "Дан 8.8"
                10 -> res = "Дан 9.26; 11.22"
                17 -> res = "Дан 2.43; 11.27"
                19 -> res = "1 Мак 6.8, 16"
                20 -> res = "Зах 9.8"
                22 -> res = "Дан 11.10"
                26 -> res = "Пс 40.10; Ин 13.18"
                30 -> res = "Чис 24.24"
                31 -> res = "Чис 28.4; 1 Мак 1.15"
                33 -> res = "Дан 12.10; Откр 11.7"
                35 -> res = "Дан 12.10; 1 Пет 1.7"
                36 -> res = "2 Фес 2.4; 1 Ин 2.18; Откр 10.7"
                37 -> res = "1 Тим 4.3; 2 Тим 3.3; 1 Кор 8.6"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Дан 10.13; Откр 12.7; Мф 24.21"
                2 -> res = "Мф 25.46; Ин 5.29"
                3 -> res = "Прем 3.7; Мф 13.43"
                4 -> res = "Дан 12.9; Откр 22.10"
                5 -> res = "Откр 10.5"
                6 -> res = "Дан 10.5"
                7 -> res = "Откр 10.5-6"
                9 -> res = "Дан 8.17, 26; Деян 1.7; 1 Пет 1.12"
                10 -> res = "Дан 11.33, 35; 1 Пет 1.7"
                11 -> res = "Дан 9.27; Мф 24.15"
                12 -> res = "Мк 13.13"
                13 -> res = "Лк 19.17; 1 Фес 4.16; Откр 20.6"
            }
        }
        if (glava == 13) {
            when (stih) {
                23 -> res = "Быт 39.9"
                28 -> res = "3 Цар 21.13"
                41 -> res = "1 Тим 5.19"
                53 -> res = "Исх 23.7"
                56 -> res = "Иез 16.3"
                62 -> res = "Притч 19.5; Втор 19.19"
            }
        }
        if (glava == 14) {
            when (stih) {
                7 -> res = "Сир 30.19"
                36 -> res = "Иез 8.3"
            }
        }
        return res
    }

    fun kniga35(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "4 Цар 14.23"
                2 -> res = "Ос 3.1; Иез 23.3"
                4 -> res = "Ос 2.22; 4 Цар 10.14; 17.18"
                5 -> res = "Нав 17.16; Суд 6.33"
                7 -> res = "Ин 20.28; Лк 1.47"
                9 -> res = "4 Цар 17.18; Ос 2.23"
                10 -> res = "Ос 2.23; Рим 9.26; Ис 62.4; Ин 10.16; 1 Пет 2.10"
                11 -> res = "Ис 11.12; Иер 3.18; Мих 2.12"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Ис 19.25; 54.8"
                2 -> res = "Иез 16.15; 23.5"
                3 -> res = "Иез 16.4; Ос 5.9; Ам 8.13"
                4 -> res = "Ос 5.7"
                5 -> res = "Иез 16.44; Иер 44.17"
                6 -> res = "Плач 3.9"
                7 -> res = "Втор 31.17; Ос 14.3"
                8 -> res = "Иез 16.16; 28.14; Ос 8.4"
                9 -> res = "Ос 9.2"
                10 -> res = "Иер 13.22; Иез 16.37; Ос 5.14"
                11 -> res = "Ис 24.8; Иер 7.34; Плач 5.15"
                12 -> res = "Иоил 1.12; Ос 5.9"
                13 -> res = "Иер 2.32"
                14 -> res = "Ис 40.2; Соф 3.9"
                15 -> res = "Нав 7.24; Ис 65.10; Исх 19.1; Мих 7.15"
                17 -> res = "Исх 23.13; Втор 12.3"
                18 -> res = "Иов 5.23; Иез 34.25"
                19 -> res = "Пс 44.10; 2 Кор 11.2; Откр 19.7"
                20 -> res = "Ис 53.11; Ин 17.3"
                22 -> res = "Иоил 3.18; Ам 9.14"
                23 -> res = "Ос 1.10"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Ос 1.2; Иер 3.1"
                3 -> res = "Иер 3.20"
                4 -> res = "Ос 9.4; Исх 28.17, 30"
                5 -> res = "Мих 7.17"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Мих 6.2; Ис 59.14; Иер 7.28"
                3 -> res = "Иер 4.25; 14.4; Соф 1.3"
                4 -> res = "Ис 30.10; Ам 5.10; Иер 15.10"
                6 -> res = "Ис 42.19-20; Зах 7.11"
                8 -> res = "Лев 6.26; Зах 11.16"
                9 -> res = "Ис 24.2"
                10 -> res = "Лев 26.26; Мих 6.14; Агг 1.6"
                11 -> res = "Ис 28.7; Мф 14.7"
                13 -> res = "Втор 12.2"
                15 -> res = "Нав 5.9; Ос 9.15; 3 Цар 12.29"
                19 -> res = "Ис 41.16; Иер 3.24"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Ис 1.10; Ос 9.8"
                3 -> res = "Иез 16.35"
                4 -> res = "Лк 20.12; Ос 4.12"
                5 -> res = "Ос 7.10"
                6 -> res = "Ос 6.1"
                7 -> res = "Ос 2.4"
                8 -> res = "Ос 4.15"
                10 -> res = "Втор 19.14; 27.17"
                13 -> res = "Иер 2.18; Ос 10.6"
                14 -> res = "Плач 3.10; Ос 13.7; Мих 5.8"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Втор 4.29; Иер 50.5"
                2 -> res = "Втор 32.39; Иез 36.36"
                3 -> res = "Ин 11.6; 1 Кор 15.4; Еф 2.6"
                4 -> res = "Ос 11.8; Мих 5.7"
                5 -> res = "Ис 11.4; Пс 36.6"
                6 -> res = "1 Цар 15.22; Сир 4.15; Мф 9.13; 12.7"
                8 -> res = "Ос 12.11"
                9 -> res = "Деян 4.1; Нав 20.7"
                10 -> res = "Иер 5.30"
                11 -> res = "Втор 30.3; Иер 29.14"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Иер 17.14; 51.9; Ос 12.1"
                2 -> res = "Иов 24.15; Рим 1.32"
                5 -> res = "Исх 32.5; Мф 14.6"
                7 -> res = "Пс 13.3"
                8 -> res = "4 Цар 17.8; Пс 105.35"
                9 -> res = "Иез 7.21"
                10 -> res = "Ос 5.5"
                11 -> res = "4 Цар 16.7; Ос 5.13; 8.9"
                12 -> res = "4 Цар 17.4"
                13 -> res = "Пс 72.27"
                14 -> res = "Ис 29.13"
                15 -> res = "Ис 42.20"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Ис 58.1; Втор 28.49; Иер 48.40"
                3 -> res = "Ос 6.7"
                4 -> res = "1 Цар 8.5; 3 Цар 12.20; Ос 2.8"
                5 -> res = "3 Цар 12.28; Ос 10.5"
                6 -> res = "Иер 10.8; Деян 19.26"
                8 -> res = "Иер 22.28"
                9 -> res = "4 Цар 16.7; Иер 2.24"
                10 -> res = "4 Цар 15.19"
                11 -> res = "Иер 11.13"
                12 -> res = "Ис 42.20"
                13 -> res = "Ис 1.11; Иер 6.20; Ам 5.21"
                14 -> res = "Втор 32.15; 4 Цар 25.9; Иер 17.27"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Иез 16.33; 20.32; Ос 2.12"
                2 -> res = "Иоил 1.12"
                3 -> res = "Втор 28.68; 4 Цар 25.26; Иер 43.6"
                4 -> res = "Ос 3.4; Втор 26.14"
                6 -> res = "Иер 43.7; Ис 19.13; 32.13"
                7 -> res = "Ис 34.8"
                8 -> res = "Иез 3.17; Иер 5.31; Ос 5.1"
                9 -> res = "Суд 19.22; 20.13; Ос 10.9"
                10 -> res = "Чис 25.3"
                11 -> res = "Ис 16.2"
                12 -> res = "Втор 28.41"
                14 -> res = "Быт 49.25"
                15 -> res = "Ос 12.11"
                17 -> res = "Ос 4.6"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Иер 11.13"
                4 -> res = "Втор 29.18"
                5 -> res = "Ос 8.5"
                6 -> res = "Ос 5.13"
                7 -> res = "Ос 9.6"
                8 -> res = "Ис 2.18-19; Лк 23.30; Откр 6.16"
                9 -> res = "Ос 9.9"
                11 -> res = "Иер 31.18"
                12, 13 -> res = "Иер 4.3"
                14 -> res = "Суд 8.12"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Мф 2.15"
                3 -> res = "Исх 13.21; Втор 1.30-31; 32.11"
                8 -> res = "Быт 19.24"
                9 -> res = "Иер 31.20; Лк 19.41; Плач 3.31"
                10 -> res = "Иер 25.30"
                11 -> res = "Ис 60.8"
                12 -> res = "Ос 8.11"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Ос 5.13; 7.11"
                2 -> res = "Ос 4.9"
                3 -> res = "Быт 25.26; 32.24"
                5 -> res = "Исх 3.15"
                8 -> res = "Откр 3.17"
                9 -> res = "Ис 43.11; Ос 13.4"
                10 -> res = "Евр 1.1"
                11 -> res = "Ос 9.15"
                12 -> res = "Быт 28.5; 29.20"
                13 -> res = "Исх 3.10; 12.37; Евр 3.16"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "3 Цар 14.10; 16.31; 4 Цар 9.7"
                2 -> res = "4 Цар 17.17; 2 Пар 28.3"
                3 -> res = "Иов 21.18; Пс 1.4"
                4 -> res = "Исх 20.2; Втор 5.6; Ос 12.9; Пс 3.9"
                5 -> res = "Втор 8.15"
                6 -> res = "Втор 8.11-14; 31.20"
                7 -> res = "Плач 3.10; Ос 5.14"
                9 -> res = "Ис 3.9; Иер 2.11"
                10 -> res = "1 Цар 8.5"
                11 -> res = "Иов 34.30; Деян 13.21"
                12 -> res = "Иов 14.17; Иер 17.1"
                13 -> res = "Быт 35.18"
                14 -> res = "Пс 15.10; 55.14; Деян 10.42; 1 Кор 15.55; Евр 2.14"
                15 -> res = "Иез 19.12; Ос 4.19"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Ос 5.9; 11.6"
                2 -> res = "Иер 3.22; Зах 1.4"
                3 -> res = "Лк 15.18; Евр 13.15"
                4 -> res = "Иер 17.5; Мих 7.5"
                6 -> res = "Пс 71.16"
                7 -> res = "Пс 51.10; Песн 4.11; Флп 4.18"
                10 -> res = "Втор 32.28; Иер 9.12; Пс 17.31"
            }
        }
        return res
    }

    fun kniga36(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                3 -> res = "Исх 10.2; Пс 77.4"
                4 -> res = "Иоил 2.25"
                6 -> res = "Иоил 2.4-5"
                7 -> res = "Дан 4.11"
                9 -> res = "Лев 2.1; Исх 29.40"
                10 -> res = "Ис 24.3; Иер 14.2"
                11 -> res = "Иер 14.4"
                12 -> res = "Ос 2.12; Ис 16.10; Иер 48.33"
                14 -> res = "Иоил 2.15"
                15 -> res = "Ис 13.6"
                16 -> res = "Втор 16.11"
                18 -> res = "Иер 14.5"
                20 -> res = "Пс 103.11; 146.9"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Чис 10.3; Ис 2.12; Иоил 1.15"
                2 -> res = "Иер 13.16; Иез 30.3; Ам 5.18"
                3 -> res = "Пс 49.3"
                4 -> res = "Откр 9.7"
                6 -> res = "Наум 2.10"
                10 -> res = "Ис 13.10; Иез 32.7; Мф 24.29; Мк 13.24; Лк 21.25"
                11 -> res = "Иер 30.7; Ам 5.18; Соф 1.15"
                12 -> res = "Иер 4.1"
                13 -> res = "Исх 34.6; Пс 85.5; Иона 4.2"
                14 -> res = "Иов 3.9"
                15 -> res = "Иоил 1.14"
                16 -> res = "Исх 19.10; Иоил 3.9"
                17 -> res = "Пс 41.11; Мих 7.10"
                19 -> res = "Пс 84.13"
                23 -> res = "Иез 34.26"
                24 -> res = "Притч 3.10"
                25 -> res = "Иоил 1.4"
                26 -> res = "Втор 8.10"
                27 -> res = "Ис 45.5"
                28 -> res = "Ис 44.3; Иез 36.25; Ин 7.39; Деян 2.17"
                29 -> res = "Деян 2.18; Рим 8.15; Гал 4.6; 1 Пет 2.9"
                32 -> res = "Рим 10.13"
            }
        }
        if (glava == 3) {
            when (stih) {
                2 -> res = "Соф 3.8; 2 Пар 20.26; Иер 25.31"
                10 -> res = "Ис 2.4"
                13 -> res = "Откр 14.15"
                15 -> res = "Иоил 2.10, 31"
                16 -> res = "Иер 25.30; Ам 1.2"
                17 -> res = "Зах 14.21"
                18 -> res = "Ам 9.13; Зах 14.8; Откр 22.1; Иез 47.1"
                21 -> res = "Втор 32.43; Откр 19.2; Пс 73.2"
            }
        }
        return res
    }

    fun kniga37(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Ис 1.1; 4 Цар 14.23; Зах 14.5"
                2 -> res = "Иер 25.30; Иоил 3.16"
                3 -> res = "2 Цар 12.31; 4 Цар 13.7; Ис 41.15"
                4 -> res = "Иер 49.27"
                5 -> res = "Иер 49.24, 26; 4 Цар 16.9"
                6 -> res = "2 Пар 21.17"
                8 -> res = "2 Пар 26.6"
                9 -> res = "Иез 27.3"
                10 -> res = "Ис 23.1; Иер 47.4; Иез 26.3"
                11 -> res = "Авд 1.10"
                13 -> res = "Быт 19.38; Иер 49.1"
                14 -> res = "Иер 49.2"
                15 -> res = "Иер 49.3"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Быт 19.37; Иер 48.1; 4 Цар 3.27"
                6 -> res = "Втор 27.19; Ам 8.6"
                7 -> res = "Ис 3.16; Рим 2.24"
                9 -> res = "Чис 21.24; Втор 2.31; Нав 9.10; 24.8; Пс 134.11"
                11 -> res = "Исх 12.51; Ам 3.1"
                12 -> res = "Ис 30.10; Ам 7.12-13"
                14 -> res = "Еккл 9.11; Ам 9.1"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Ам 2.10"
                2 -> res = "Исх 19.5; Втор 4.33-34; 14.2"
                6 -> res = "Плач 3.38"
                7 -> res = "Быт 18.17; Ос 12.10; Деян 11.28"
                11 -> res = "Лк 19.43"
                14 -> res = "3 Цар 12.33; 4 Цар 23.15"
                15 -> res = "3 Цар 22.39; Ам 6.4"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Пс 21.13; Ис 5.17; Иез 6.3"
                3 -> res = "Иез 12.12"
                4 -> res = "Ам 5.5"
                5 -> res = "Лев 7.12"
                7 -> res = "3 Цар 17.1; Иак 1.17"
                9 -> res = "Агг 2.17"
                10 -> res = "Исх 9.3; 12.29"
                11 -> res = "Быт 19.24; Ос 11.8"
                12 -> res = "Лк 15.18"
            }
        }
        if (glava == 5) {
            when (stih) {
                4 -> res = "Пс 33.11"
                5 -> res = "Ам 4.4"
                6 -> res = "Ис 55.6; Иер 17.27"
                8 -> res = "Ам 9.6"
                10 -> res = "Ис 29.21; Соф 1.12"
                11 -> res = "Соф 1.13"
                12 -> res = "Ис 59.15; Ам 8.4"
                13 -> res = "Ам 8.3"
                14 -> res = "Пс 33.15; Ис 1.16-17; Рим 12.9"
                15 -> res = "Пс 96.10"
                16 -> res = "Иер 9.17"
                18 -> res = "Ис 5.19; Иер 30.7; Иоил 2.11; Соф 1.15"
                19 -> res = "Ис 24.18; Иер 48.44"
                20 -> res = "Иоил 2.2"
                21 -> res = "Ис 1.11; Иер 6.20"
                22 -> res = "Мал 2.13"
                23 -> res = "Мф 15.8"
                24 -> res = "Ис 11.9; 56.1"
                25 -> res = "Деян 7.42"
                26 -> res = "Деян 7.43"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Иер 5.17"
                2 -> res = "Быт 10.10"
                4 -> res = "Ам 3.15; Гал 6.8"
                6 -> res = "Быт 40.23"
                8 -> res = "Иер 51.14"
                12 -> res = "Ис 5.20; Ам 5.7"
                14 -> res = "Чис 34.8"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Иоил 1.4"
                5 -> res = "Чис 11.2"
                7 -> res = "Иез 40.3"
                8 -> res = "Ис 34.11"
                9 -> res = "Ос 8.14; 4 Цар 15.10"
                10 -> res = "3 Цар 18.17; Иер 38.4; Лк 23.5"
                12 -> res = "Ам 2.12"
                14 -> res = "Ам 1.1"
                17 -> res = "4 Цар 17.24"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "Иез 7.6"
                3 -> res = "Ам 5.13"
                5 -> res = "Чис 10.10; Неем 10.31; 13.15"
                6 -> res = "Ам 2.6"
                8 -> res = "Иер 47.2"
                9 -> res = "Иер 15.9"
                10 -> res = "Тов 2.6; 1 Мак 1.39; Зах 12.10"
                11 -> res = "Ис 32.6; 1 Цар 3.1; 1 Мак 1.45"
                12 -> res = "Ис 17.12; 2 Пар 15.3"
                13 -> res = "2 Пар 36.17; Плач 2.21"
                14 -> res = "Ос 4.15"
            }
        }
        if (glava == 9) {
            when (stih) {
                2 -> res = "Пс 138.8; Иер 23.24; Авд 1.4"
                3 -> res = "3 Цар 18.19; 4 Цар 19.23; Иер 46.18"
                4 -> res = "Иер 44.11"
                5 -> res = "Пс 96.5; Наум 1.5"
                6 -> res = "Ам 5.8"
                7 -> res = "Иер 13.23; 47.4"
                8 -> res = "Притч 15.3; Пс 65.7; Иер 5.18, 29"
                9 -> res = "Деян 15.16"
                11 -> res = "Мих 4.7; Деян 15.16"
                12 -> res = "Чис 24.18; Деян 15.17"
                13 -> res = "Иоил 3.18"
                14 -> res = "Ис 62.4, 9; Иез 28.26"
                15 -> res = "Иер 32.41"
            }
        }
        return res
    }

    fun kniga38(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Иер 49.14"
                2 -> res = "Иер 49.15"
                3 -> res = "Чис 24.21; Иер 21.13"
                4 -> res = "Иер 49.16; Ам 9.2"
                5 -> res = "Иер 49.9"
                7 -> res = "Пс 40.10; Дан 11.27"
                8 -> res = "Ис 29.14; Иер 49.7; 1 Кор 1.19"
                9 -> res = "Иер 49.7"
                10 -> res = "Быт 27.41; Иез 35.2; Ам 1.11"
                12 -> res = "Мих 4.11"
                14 -> res = "Иез 21.21"
                15 -> res = "Иез 35.15"
                17 -> res = "Ис 14.2"
                20 -> res = "3 Цар 17.9"
                21 -> res = "Пс 109.6; Мих 4.7; Ин 16.8"
            }
        }
        return res
    }

    fun kniga39(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "4 Цар 14.25"
                2 -> res = "Быт 10.11; Иона 3.3"
                4 -> res = "Пс 106.25"
                5 -> res = "4 Цар 17.29"
                9 -> res = "Быт 1.9"
                15 -> res = "Мф 12.40; 14.32"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Мф 12.40; 16.4; Лк 11.29; 1 Кор 15.4"
                3 -> res = "Пс 119.1"
                4 -> res = "Пс 41.8"
                5 -> res = "Ис 38.11"
                6 -> res = "Пс 68.2-3"
                8 -> res = "Пс 17.7"
                10 -> res = "Пс 49.14; Евр 13.15"
                11 -> res = "Мф 12.40"
            }
        }
        if (glava == 3) {
            when (stih) {
                3 -> res = "Иона 1.2"
                5 -> res = "Мф 12.41; Лк 11.32"
                6 -> res = "Иез 26.16; 27.30; Исх 33.4"
                8 -> res = "Иер 18.11"
                9 -> res = "Иоил 2.14"
                10 -> res = "Иер 18.7-8; 26.19"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "Исх 34.6; Пс 85.5; Иоил 2.13; Наум 1.3"
                3 -> res = "3 Цар 19.4; Иов 3.20"
                8 -> res = "Иак 1.11; Пс 120.6; Откр 16.8"
                11 -> res = "Быт 18.26; Иез 18.23; Евр 5.13"
            }
        }
        return res
    }

    fun kniga40(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Иер 26.18"
                2 -> res = "Втор 32.1; Ис 1.2"
                3 -> res = "Ис 26.21"
                4 -> res = "Пс 96.5"
                5 -> res = "Иез 20.29"
                7 -> res = "Иез 16.31, 39; Ос 2.12"
                8 -> res = "Иов 30.29"
                10 -> res = "2 Цар 1.20; Иер 6.26"
                12 -> res = "Ис 45.7; Ам 3.6"
                13 -> res = "4 Цар 14.19; 2 Пар 32.9; Ис 36.2"
                15 -> res = "Нав 15.35"
                16 -> res = "Ис 22.12"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Ис 29.20; Пс 35.5; Мф 27.1"
                2 -> res = "Ис 5.8"
                3 -> res = "Иер 18.11; Ам 5.13"
                4 -> res = "3 Цар 9.7"
                5 -> res = "Втор 32.9"
                7 -> res = "Пс 118.72"
                10 -> res = "Иез 11.7; Лев 18.24"
                11 -> res = "Иез 13.3"
                12 -> res = "Ос 11.1; Иез 36.37-38; Ин 10.16"
                13 -> res = "Иез 37.22; Лк 24.26; Евр 2.10"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Втор 17.18"
                2 -> res = "Иез 22.25"
                4 -> res = "Пс 65.18; Ис 1.15; Иер 11.11"
                5 -> res = "Мф 7.15; Иер 6.14; Иез 13.10"
                6 -> res = "Ам 8.9"
                7 -> res = "1 Цар 9.9"
                8 -> res = "Иез 3.8"
                9 -> res = "Ис 5.20"
                10 -> res = "Иер 22.13"
                11 -> res = "Иер 22.26-28"
                12 -> res = "Иер 26.18"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Ис 2.2"
                2 -> res = "Ис 2.3"
                3 -> res = "Пс 2.6; Ин 16.8; Ис 2.4"
                4 -> res = "3 Цар 4.25; Ис 32.18; Лев 26.6"
                5 -> res = "Зах 14.9"
                6 -> res = "Втор 30.3-4"
                7 -> res = "Соф 3.19; Дан 7.14; Лк 1.33"
                9 -> res = "Зах 9.5"
                10 -> res = "4 Цар 19.3; Пс 47.7; Ис 59.20"
                12 -> res = "Ис 11.12; 55.8"
                13 -> res = "Ис 41.15"
            }
        }
        if (glava == 5) {
            when (stih) {
                2 -> res = "Мф 2.5-6; Ин 7.42"
                3 -> res = "Ис 7.14; Откр 12.2; Рим 9.5"
                5 -> res = "4 Цар 18.25; Иер 50.41"
                7 -> res = "Пс 104.12-13"
                13 -> res = "Ис 2.20; Зах 13.2"
                14 -> res = "Втор 16.21"
                15 -> res = "2 Фес 1.8"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Ис 1.2; Иер 2.4"
                3 -> res = "Иер 2.5"
                4 -> res = "Исх 12.41, 51; 14.30"
                5 -> res = "Чис 22.6; 23.7-8"
                6 -> res = "Ос 6.6; Мф 9.13"
                8 -> res = "Втор 10.12; Ос 6.6"
                10 -> res = "Мих 2.2"
                11 -> res = "Лев 19.36; Притч 11.1"
                13 -> res = "Иез 12.20"
                14 -> res = "Лев 26.26; Ос 4.10"
                15 -> res = "Втор 28.38-39; Иер 12.13; Агг 1.6; Соф 1.13"
                16 -> res = "3 Цар 16.19-20, 30"
            }
        }
        if (glava == 7) {
            when (stih) {
                2 -> res = "Ис 57.1"
                3 -> res = "Ис 1.15, 23"
                5 -> res = "Сир 6.7"
                6 -> res = "Мф 10.21, 35-36"
                8 -> res = "Пс 26.1"
                10 -> res = "Пс 78.10; Иоил 2.17"
                11 -> res = "Ам 9.11"
                12 -> res = "Ис 19.23"
                14 -> res = "Пс 44.7; Ис 10.24; Зах 2.12"
                15 -> res = "Исх 12.37"
                17 -> res = "Пс 71.9; Ис 49.23; Ос 3.5"
                18 -> res = "Исх 34.6-7; Прем 11.23-24; Ис 54.7-8; Иер 31.34; 33.8; Плач 3.22; Деян 10.43"
                19 -> res = "Ис 43.25; Зах 3.4; Иез 18.22"
                20 -> res = "Быт 22.18; Лк 1.55; Евр 6.13-14"
            }
        }
        return res
    }

    fun kniga41(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                2 -> res = "Исх 20.5; Нав 24.19"
                3 -> res = "Пс 85.5; Иов 5.18-19"
                4 -> res = "Ис 50.2"
                5 -> res = "Исх 19.18; Втор 32.22; Пс 96.5"
                6 -> res = "Откр 6.17; Быт 19.24; Втор 32.22"
                7 -> res = "Пс 1.6; 2 Тим 2.19"
                10 -> res = "Ис 9.18"
                13 -> res = "Иер 27.2"
                14 -> res = "4 Цар 19.37"
                15 -> res = "Ис 52.7; Рим 10.15"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Иер 49.9"
                7 -> res = "Ис 38.14"
                10 -> res = "Ис 13.7-8"
                11 -> res = "Иез 19.2"
                13 -> res = "Наум 3.5"
            }
        }
        if (glava == 1) {
            when (stih) {
                1 -> res = "Иез 24.9; Авв 2.12"
                4 -> res = "Иез 23.3; Откр 17.1"
                5 -> res = "Ис 47.3; Иез 16.37"
                9 -> res = "Ис 18.1"
                11 -> res = "Иер 25.27"
                12 -> res = "4 Цар 19.25-26"
                13 -> res = "Иер 50.37; 51.30"
            }
        }
        return res
    }

    fun kniga42(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                2 -> res = "Пс 12.2"
                3 -> res = "Иез 22.29"
                4 -> res = "Иов 21.7; Иер 12.1"
                5 -> res = "Деян 13.41"
                6 -> res = "Иер 50.41-42"
                8 -> res = "Иер 4.13; 5.6"
                11 -> res = "2 Пар 28.23"
                12 -> res = "Пс 37.2; Иер 10.24; 46.28"
                13 -> res = "Мф 5.8; Авв 1.4"
                15 -> res = "Мк 12.13"
                16 -> res = "Ис 10.13"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Ис 21.8"
                2 -> res = "Ис 8.1"
                3 -> res = "Евр 10.37"
                4 -> res = "Ин 3.36; Рим 1.17; Гал 3.11; Евр 10.38; 1 Ин 5.10-11"
                5 -> res = "Притч 30.15-16"
                6 -> res = "1 Тим 6.9"
                8 -> res = "Ис 33.1"
                9 -> res = "Иер 22.13"
                11 -> res = "Лк 19.40"
                12 -> res = "Иез 24.9; Наум 3.1"
                14 -> res = "Ис 11.9"
                16 -> res = "Иер 25.27"
                17 -> res = "Втор 32.24; Иез 14.15; Авв 2.8"
                18 -> res = "Иер 10.8"
                19 -> res = "Ос 4.12; Пс 113.12"
                20 -> res = "Пс 10.4"
            }
        }
        if (glava == 3) {
            when (stih) {
                3 -> res = "Втор 33.2"
                4 -> res = "Исх 24.17"
                5 -> res = "Исх 9.3"
                6 -> res = "Нав 10.13; Пс 17.8; Ис 54.10"
                7 -> res = "Чис 31.7; Суд 7.21"
                8 -> res = "Исх 14.25-26; 15.3-4"
                9 -> res = "Нав 3.16"
                10 -> res = "Пс 45.4; 76.19-20"
                11 -> res = "Нав 10.12-13"
                18 -> res = "Пс 12.6; Ис 61.10"
                19 -> res = "2 Цар 22.34; Пс 17.34"
            }
        }
        return res
    }

    fun kniga43(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "4 Цар 22.1"
                3 -> res = "Ис 24.3; Ос 4.3"
                4 -> res = "Иер 49.3; Ос 10.5"
                5 -> res = "Иер 44.17; Ос 4.15"
                7 -> res = "Пс 36.7; Иер 46.10; Ис 34.6"
                8 -> res = "4 Цар 25.7; 1 Пет 3.3"
                12 -> res = "Иер 48.11; Иез 11.3"
                13 -> res = "Втор 28.30; Ам 5.11; Мих 6.15"
                14 -> res = "Иез 30.3"
                15 -> res = "Иер 30.7; Иоил 2.11; Ам 5.18"
                18 -> res = "Притч 11.4; Иез 7.19"
            }
        }
        if (glava == 2) {
            when (stih) {
                3 -> res = "Ис 51.7"
                7 -> res = "Ис 11.14; Иер 29.14; 30.3"
                8 -> res = "Иез 25.3; Иер 49.3-4"
                9 -> res = "Иер 48.1; Втор 29.23"
                10 -> res = "Соф 2.8"
                11 -> res = "Зах 13.2; Тов 14.5-6; Ин 4.21"
                12 -> res = "Ис 18.1"
                13 -> res = "Наум 1.14; 2.2; 3.15"
                14 -> res = "Ис 13.21; 34.11"
                15 -> res = "Ис 47.8"
            }
        }
        if (glava == 3) {
            when (stih) {
                3 -> res = "Иез 22.27; Мих 3.10"
                4 -> res = "Иер 23.11; Ос 9.7; Иез 22.26"
                5 -> res = "Мал 2.6; 2 Пар 36.15; Дан 9.20-21"
                7 -> res = "Ис 8.13; 26.9-10; Зах 1.3"
                8 -> res = "Соф 1.18"
                9 -> res = "Ис 29.18; 61.1; Ос 2.14"
                10 -> res = "Ис 18.7; Рим 15.16; 1 Пет 1.1"
                11 -> res = "Рим 6.21"
                12 -> res = "Ис 6.13; 11.16; 1 Кор 1.26"
                13 -> res = "Ис 29.23; Откр 14.5; Ин 10.11"
                14 -> res = "Ис 12.6; 35.1; Зах 9.9"
                15 -> res = "Ис 40.2; Откр 19.16"
                16 -> res = "Ис 12.2; Зах 8.13"
                17 -> res = "Ис 25.4; Иез 11.16"
                19 -> res = "Мих 4.7"
                20 -> res = "Иер 29.14; Иез 34.12; Соф 2.7"
            }
        }
        return res
    }

    fun kniga44(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "1 Езд 5.1-2"
                2 -> res = "Мф 8.21"
                6 -> res = "Втор 28.38; Иер 12.13; Мих 6.15; Зах 8.10"
                8 -> res = "Агг 2.9"
                10 -> res = "Втор 28.23"
                11 -> res = "Втор 28.22"
                12 -> res = "1 Езд 5.2"
                13 -> res = "Агг 2.5"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Агг 1.1"
                2 -> res = "Зах 3.1"
                3 -> res = "1 Езд 3.12"
                4 -> res = "Агг 1.13"
                6 -> res = "Евр 12.26"
                7 -> res = "Ис 66.19; Ин 12.21; Мф 21.23"
                9 -> res = "Агг 1.8"
                11 -> res = "Втор 17.11; Мал 2.7"
                12 -> res = "Лев 10.10"
                13 -> res = "Лев 5.2; 11.24; Чис 19.11"
                16 -> res = "Втор 28.38; Мих 6.15"
                17 -> res = "Ам 4.9"
                19 -> res = "Зах 8.12-13"
                22 -> res = "Иез 38.21; Откр 19.21"
                23 -> res = "Сир 49.13"
            }
        }
        return res
    }

    fun kniga45(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Агг 1.1; 1 Езд 4.24; 5.1"
                3 -> res = "Ис 31.6; 45.22; Иер 3.12; Иез 18.30; 33.11; Ос 14.2; Иоил 2.12; Мал 3.7"
                4 -> res = "2 Пар 36.16; Зах 7.11"
                5 -> res = "1 Кор 10.5"
                8 -> res = "Откр 19.11; Зах 6.2-3"
                9 -> res = "Зах 4.1"
                12 -> res = "Иер 25.11-12"
                14 -> res = "Зах 8.2"
                16 -> res = "Иер 30.10; Зах 4.9-10"
                17 -> res = "Зах 2.12"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Иез 40.3; Откр 21.15"
                4 -> res = "Ис 60.11; Рим 8.31; Откр 21.24"
                6 -> res = "Ис 52.11; Иер 51.45; Откр 18.4"
                8 -> res = "Втор 32.10; Пс 16.8"
                10 -> res = "Ис 12.6; Иез 37.27-28"
                11 -> res = "Ис 11.10; Соф 2.11"
                12 -> res = "Зах 1.17; 3.2"
                13 -> res = "Авв 2.20; Соф 1.7"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "1 Езд 2.2; Агг 1.1; Откр 12.10"
                2 -> res = "Зах 1.17; 2.12; Иуд 1.9"
                4 -> res = "Ис 27.9"
                7 -> res = "Втор 17.12; 2 Пар 19.11"
                8 -> res = "Ис 11.1; Иер 23.5; Зах 6.12; Лк 1.76"
                9 -> res = "Мф 21.42; Откр 5.6; Дан 9.24"
                10 -> res = "Мих 4.4"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Зах 1.9"
                2 -> res = "Исх 25.31"
                3, 11 -> res = "Откр 11.4"
                6 -> res = "Ис 34.16; Лк 4.18; Ин 2.15"
                7 -> res = "1 Езд 5.2; Ис 49.11; Мк 11.9"
                9 -> res = "1 Езд 5.2; Агг 2.19"
                10 -> res = "Зах 1.16; Откр 5.6; 1 Езд 5.5"
                14 -> res = "Откр 11.4; Зах 6.5; Дан 7.10"
            }
        }
        if (glava == 5) {
            when (stih) {
                6 -> res = "Ам 8.5; Мих 6.11"
                11 -> res = "Быт 10.10"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Зах 1.8"
                5 -> res = "Евр 1.7; Иов 1.6; Дан 7.10"
                12 -> res = "Иер 23.5; Зах 3.8"
                13 -> res = "Иер 3.17; Евр 3.1; Еф 2.14"
                15 -> res = "Ис 49.1; 57.19; Еф 2.13"
            }
        }
        if (glava == 7) {
            when (stih) {
                3 -> res = "4 Цар 25.8; Зах 8.19"
                5 -> res = "Ис 58.5; Зах 8.19"
                9 -> res = "Зах 8.16"
                10 -> res = "Исх 22.22; Лев 19.33; Ис 1.23; Иер 5.28; Зах 8.19"
                11 -> res = "Ис 42.20; Зах 1.4; Евр 3.8"
                12 -> res = "Иер 5.3; Ис 48.8"
                13 -> res = "Притч 1.28; Ис 1.15; Иер 11.11; Иез 8.18"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "Зах 1.14"
                3 -> res = "Зах 1.17; Ис 11.9; Иер 31.23"
                4 -> res = "Ис 65.20"
                6 -> res = "Мф 19.26"
                7 -> res = "Ис 27.13; Иер 30.18"
                8 -> res = "Ис 51.16; Откр 21.7"
                9 -> res = "1 Езд 5.2; Ис 35.5"
                10 -> res = "Агг 1.6"
                12 -> res = "Ис 55.13; Ам 9.13; Лев 26.4"
                13 -> res = "Агг 2.20"
                15 -> res = "Ос 6.4; Ис 54.4"
                16 -> res = "Зах 7.9; Еф 4.25"
                17 -> res = "Зах 7.10"
                19 -> res = "Зах 7.5"
                21 -> res = "Ис 2.3; Мих 4.2"
                22 -> res = "Ис 51.3-4; 52.15; 66.20"
                23 -> res = "Зах 9.7; Деян 2.5"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Ис 7.8; Иер 32.19"
                2 -> res = "Ам 6.2; Иез 28.12"
                4 -> res = "Ис 23.1"
                5 -> res = "Ис 14.29; Иер 47.1; Мих 4.13"
                8 -> res = "Зах 2.5; Пс 33.8; Дан 11.20"
                9 -> res = "Ис 62.11; Соф 3.14; Мф 21.5; Ин 12.15"
                10 -> res = "Пс 71.8"
                11 -> res = "Иер 31.33; Евр 2.14"
                13 -> res = "Пс 44.6; Евр 4.12"
                14 -> res = "Пс 44.6; Ис 27.13; 60.2"
                15 -> res = "1 Кор 10.4"
                16 -> res = "Иез 34.12; Ин 10.11; Еф 2.20"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Иер 14.22"
                2 -> res = "Ис 8.19; Иер 10.8; Мф 9.36"
                5 -> res = "Ис 25.10"
                6 -> res = "Соф 3.15"
                7 -> res = "Ин 16.22"
                8 -> res = "Ис 5.26"
                9 -> res = "Втор 4.27"
                10 -> res = "Ис 11.11"
                11 -> res = "Исх 14.16"
                12 -> res = "Ис 45.25; Мих 4.5"
            }
        }
        if (glava == 11) {
            when (stih) {
                2 -> res = "4 Цар 19.23; Ис 14.8"
                3 -> res = "Иер 25.34"
                4 -> res = "Мф 15.24; Рим 8.36"
                5 -> res = "Мих 3.3"
                6 -> res = "Иер 13.14; Иез 5.11"
                8 -> res = "Иер 18.18"
                9 -> res = "Иер 15.2"
                12 -> res = "Мф 26.15"
                13 -> res = "Мф 27.5, 9-10"
                14 -> res = "Зах 11.7"
                16 -> res = "Ис 66.11; Иез 34.3; Ин 10.12"
                17 -> res = "Иер 23.1; Иез 34.3; Ин 10.12"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Пс 101.26; 103.2; Ис 42.5"
                2 -> res = "Ис 51.17, 22"
                3 -> res = "Мф 10.22; Лк 20.18"
                4 -> res = "Втор 11.12; 3 Цар 8.29; Пс 33.16"
                7 -> res = "Ам 9.11"
                8 -> res = "Ис 40.31; Лк 1.69; 2 Кор 5.20"
                10 -> res = "Иоил 2.28; Деян 2.18; Ин 19.37; Ам 8.10"
                11 -> res = "2 Пар 35.22"
                13 -> res = "Лк 3.31"
            }
        }
        if (glava == 13) {
            when (stih) {
                2 -> res = "Иез 30.13"
                3 -> res = "Втор 13.15; 18.20; Мф 10.37"
                4 -> res = "Мих 3.6-7"
                7 -> res = "Мф 26.31; Мк 14.27"
                8 -> res = "Лк 8.5"
                9 -> res = "Ис 10.20; Иез 22.22; 1 Кор 3.15"
            }
        }
        if (glava == 14) {
            when (stih) {
                2 -> res = "Зах 12.3; Ис 13.16"
                4 -> res = "Деян 1.12"
                5 -> res = "2 Пар 26.1; Ам 1.1"
                6 -> res = "Мф 24.29"
                7 -> res = "Откр 21.23, 25; 22.5; Ис 60.20"
                8 -> res = "Иез 47.1; Иоил 3.18; Откр 22.1"
                9 -> res = "Ис 52.7; Иер 23.5; 1 Кор 8.6"
                10 -> res = "Зах 8.21-22; Неем 3.6, 23; Иер 31.38"
                11 -> res = "Ис 33.20; Рим 8.15; Откр 22.3"
                12 -> res = "Ис 66.24"
                13 -> res = "Ис 3.6"
                15 -> res = "Зах 14.12"
                16 -> res = "Иез 20.40; Соф 2.11; Зах 8.22"
                17 -> res = "Ис 5.6; 60.12; Откр 11.6"
                18 -> res = "Ис 5.6"
                20 -> res = "3 Цар 7.38"
                21 -> res = "Ис 35.8; Иоил 3.17; Откр 21.27; 22.15"
            }
        }
        return res
    }

    fun kniga46(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                2 -> res = "Рим 9.13"
                3 -> res = "Ис 13.22; Иер 9.11; Иез 35.9"
                4 -> res = "Ис 9.10; Иер 45.4; 1 Мак 5.3"
                6 -> res = "Исх 20.12; Мф 15.4"
                7 -> res = "Ис 58.2"
                8 -> res = "Исх 12.5; 29.38; Лев 22.20; Втор 15.21"
                9 -> res = "2 Пар 19.7"
                10 -> res = "Ис 1.11; Иер 6.20; Ам 5.21-22"
                11 -> res = "Пс 112.3"
                14 -> res = "Пс 46.3"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Лев 26.14, 16; Втор 28.15"
                3 -> res = "Ос 2.11; Ам 5.22-23"
                4 -> res = "Чис 1.49"
                5 -> res = "Чис 25.12; Ис 66.2"
                6 -> res = "Соф 3.5; Мф 5.18; Дан 12.3"
                7 -> res = "Иез 44.23; 1 Кор 4.1; 2 Кор 5.20"
                9 -> res = "Лев 19.15"
                10 -> res = "Еф 4.6"
                11 -> res = "Неем 13.23"
                13 -> res = "Ам 5.22"
                14 -> res = "Быт 2.18; Мф 5.32; Притч 2.17"
                15 -> res = "Быт 16.3-4"
                16 -> res = "Втор 24.1; Исх 21.10"
                17 -> res = "Мал 3.14"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Мф 11.10; Мк 1.2; Лк 7.27"
                3 -> res = "Пс 65.10; Ис 1.25; Иез 22.22"
                6 -> res = "Чис 23.19"
                7 -> res = "Зах 1.3"
                10 -> res = "4 Цар 7.2"
                12 -> res = "Втор 33.29"
                13 -> res = "Иуд 1.15"
                14 -> res = "Иов 21.15"
                15 -> res = "Пс 94.9"
                16 -> res = "Пс 93.9; 138.16; Наум 1.7"
                17 -> res = "Мф 13.30"
                18 -> res = "Ис 3.10; 65.13"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Ис 1.31"
                2 -> res = "Лк 1.78"
                3 -> res = "Ис 25.10; Рим 16.20"
                4 -> res = "Исх 20.1"
                5 -> res = "Мф 17.10; Мк 9.11; Лк 1.17"
                6 -> res = "Лк 1.17"
            }
        }
        return res
    }

    fun kniga47(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                39 -> res = "Тов 2.6; Ам 8.10"
                54 -> res = "2 Мак 6.7"
            }
        }
        if (glava == 2) {
            when (stih) {
                26 -> res = "Чис 25.7-8"
                52 -> res = "Быт 15.6; 22.9; Рим 4.22; Гал 3.6"
                53 -> res = "Быт 41.10; Деян 7.10"
                54 -> res = "Чис 25.7-8, 12-13; Сир 45.28"
                55 -> res = "Чис 14.16; Нав 1.2; Сир 46.1"
                56 -> res = "Чис 14.24; Нав 14.13"
                57 -> res = "2 Цар 2.4"
                58 -> res = "4 Цар 2.11"
                59 -> res = "Дан 3.19, 26"
                60 -> res = "Дан 6.22"
            }
        }
        if (glava == 3) {
            when (stih) {
                56 -> res = "Втор 20.5"
                60 -> res = "1 Пар 19.13"
            }
        }
        if (glava == 4) {
            when (stih) {
                9 -> res = "Исх 14.9, 22"
                24 -> res = "Пс 105.1; 117.1"
                30 -> res = "1 Цар 14.13; 17.50"
                47 -> res = "Исх 20.25; Нав 8.31"
                51 -> res = "2 Мак 10.3"
                59 -> res = "2 Мак 1.18; Ин 10.22"
            }
        }
        if (glava == 5) {
            when (stih) {
                37 -> res = "2 Мак 10.24"
                46 -> res = "2 Мак 12.27"
                48 -> res = "Чис 21.22"
            }
        }
        if (glava == 6) {
            when (stih) {
                49, 53 -> res = "Лев 25.4"
            }
        }
        if (glava == 7) {
            when (stih) {
                17 -> res = "Пс 78.2-3"
                26 -> res = "2 Мак 14.12-13"
                35 -> res = "2 Мак 14.33"
                37 -> res = "2 Пар 7.12; Ис 56.7; Лк 19.46"
                41 -> res = "4 Цар 19.35; Сир 48.24; Ис 37.36; 2 Мак 8.19-20"
            }
        }
        if (glava == 9) {
            if (stih == 21) {
                res = "2 Цар 1.19"
            }
        }
        if (glava == 10) {
            if (stih == 30) {
                res = "1 Мак 11.34"
            }
        }
        if (glava == 11) {
            when (stih) {
                4 -> res = "1 Мак 10.84"
                35 -> res = "1 Мак 10.29"
            }
        }
        return res
    }

    fun kniga48(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                18 -> res = "1 Мак 4.59"
                19 -> res = "Лев 6.9, 12"
                29 -> res = "Втор 30.4; 2 Мак 2.10; 3 Езд 1.30; Неем 1.9"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "2 Мак 1.19"
                2 -> res = "Посл Иер 1.4-5"
                4 -> res = "Втор 34.1"
                8 -> res = "Исх 40.34; 3 Цар 8.22"
                10 -> res = "Лев 9.24; 2 Пар 5.14; 6.3-4; 7.1"
                11 -> res = "Лев 10.16-17"
                18 -> res = "Втор 30.4"
            }
        }
        if (glava == 6) {
            when (stih) {
                12 -> res = "3 Езд 16.20"
                13 -> res = "Евр 12.6-8"
                18 -> res = "Лев 11.7; 2 Мак 7.1"
            }
        }
        if (glava == 7) {
            if (stih == 6) {
                res = "Втор 32.43"
            }
        }
        if (glava == 8) {
            if (stih == 19) {
                res = "4 Цар 19.35; Сир 48.24; Ис 37.36; 1 Мак 7.41"
            }
        }
        if (glava == 9) {
            if (stih == 5) {
                res = "2 Пар 16.9"
            }
        }
        if (glava == 10) {
            if (stih == 24) {
                res = "1 Мак 5.37"
            }
        }
        if (glava == 12) {
            when (stih) {
                15 -> res = "Нав 6.19"
                27 -> res = "1 Мак 5.46"
                40 -> res = "Втор 7.26"
            }
        }
        if (glava == 14) {
            if (stih == 33) {
                res = "1 Мак 7.35"
            }
        }
        if (glava == 15) {
            if (stih == 22) {
                res = "2 Мак 8.19"
            }
        }
        return res
    }

    fun kniga49(glava: Int, stih: Int): String {
        if (glava == 2) {
            when (stih) {
                2 -> res = "4 Цар 19.15-16; 2 Мак 1.24; Пс 19.8"
                4 -> res = "Быт 6.4; 7.21"
                5 -> res = "Быт 19.24"
                6 -> res = "Исх 1.13-14; 7; 8; 9; 10"
                7 -> res = "Исх 14.28; 15.1"
                8 -> res = "2 Пар 7.16"
                9 -> res = "3 Цар 9.3"
                16 -> res = "1 Цар 16.7; 1 Пет 3.12"
            }
        }
        if (glava == 4) {
            if (stih == 13) {
                res = "Пс 113.13"
            }
        }
        if (glava == 6) {
            when (stih) {
                3 -> res = "Исх 14.28"
                4 -> res = "4 Цар 19.35, 37"
                5 -> res = "Дан 3.49-50"
                6 -> res = "Дан 6.16, 22; Иона 2.1, 11"
                14 -> res = "Лев 26.44; Втор 30.3"
            }
        }
        return res
    }

    fun kniga50(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                11 -> res = "Чис 21.24; Нав 9.10"
                13 -> res = "Исх 3.10; 14.22"
                15 -> res = "Исх 16.13; Пс 104.40"
                18 -> res = "Чис 14.3"
                19 -> res = "Исх 16.14; Прем 16.3"
                20 -> res = "Чис 20.10-11"
                23 -> res = "Исх 15.25"
                30 -> res = "Втор 30.4; 32.11-12; Мф 23.37"
                31 -> res = "Ис 1.14; 66.3"
            }
        }
        if (glava == 2) {
            when (stih) {
                8 -> res = "Быт 9.24"
                23 -> res = "Тов 2.7"
                42 -> res = "Откр 7.9"
            }
        }
        if (glava == 3) {
            when (stih) {
                5 -> res = "Быт 1.27"
                8 -> res = "Быт 6.5"
                9 -> res = "Быт 7.12"
                11 -> res = "Быт 8.1"
                13 -> res = "Быт 12.3"
                16 -> res = "Быт 28.14; Рим 9.3"
                17 -> res = "Исх 19.2; Втор 4.11"
                23 -> res = "1 Цар 16.1; 2 Цар 5.3"
            }
        }
        if (glava == 4) {
            if (stih == 13) {
                res = "Суд 9.8; 2 Пар 25.18"
            }
        }
        if (glava == 7) {
            when (stih) {
                21 -> res = "Втор 8.1"
                38 -> res = "3 Цар 8.23, 30; 2 Пар 6.14"
                39 -> res = "3 Цар 17.21-22"
                58 -> res = "Откр 2.7"
            }
        }
        if (glava == 8) {
            when (stih) {
                35 -> res = "3 Цар 8.46; 2 Пар 6.36"
                58 -> res = "Пс 52.2"
            }
        }
        if (glava == 14) {
            when (stih) {
                4 -> res = "Втор 5.6"
                30 -> res = "Втор 4.6"
            }
        }
        return res
    }

    fun kniga51(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Лк 3.23"
                2 -> res = "Быт 21.2; 25.26; 29.35"
                3 -> res = "Быт 38.30; 46.12; Руфь 4.18; 1 Пар 2.5"
                5 -> res = "Руфь 4.21; 1 Пар 2.11"
                6 -> res = "1 Цар 17.12; 2 Цар 12.24"
                7 -> res = "3 Цар 11.43; 14.31; 15.8; 1 Пар 3.10"
                10 -> res = "4 Цар 20.21; 1 Пар 3.13"
                11 -> res = "4 Цар 23.34; 24.6; 1 Пар 3.16; 2 Пар 36.4"
                12 -> res = "1 Пар 3.17; 2 Пар 36.8; 1 Езд 3.2; 5.2"
                18 -> res = "Лк 1.27"
                21 -> res = "Лк 1.31; Деян 4.12; 1 Ин 2.2; Рим 3.24"
                23 -> res = "Ис 7.14"
                25 -> res = "Лк 2.21"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Лк 2.6"
                2 -> res = "Чис 24.17; Ис 60.3"
                6 -> res = "Мих 5.2; Ин 7.42"
                11 -> res = "Ис 60.6"
                15 -> res = "Ос 11.1"
                18 -> res = "Иер 31.15"
                23 -> res = "Суд 13.5; Ис 11.1-2"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Мк 1.4; Лк 3.3; Ин 1.28; Деян 13.24"
                3 -> res = "Ис 40.3; Мк 1.3; Лк 3.4; Ин 1.23"
                4 -> res = "Мк 1.6"
                7 -> res = "Мф 23.33; Лк 3.7"
                9 -> res = "Ин 8.39; Деян 13.26"
                10 -> res = "Мф 7.19"
                11 -> res = "Мк 1.8; Лк 3.16; Ин 1.26; Деян 1.5; 2.2-4"
                12 -> res = "Лк 3.17"
                13 -> res = "Мк 1.9; Лк 3.21"
                16 -> res = "Мк 1.10; Лк 3.21; Ин 1.32"
                17 -> res = "Мк 1.11; Лк 3.22; Ин 5.37; 2 Пет 1.17; Кол 1.13"
            }
        }
        if (glava == 4) {
            when (stih) {
                4 -> res = "Втор 8.3; Лк 4.4"
                6 -> res = "Пс 90.11-12; Лк 4.10"
                7 -> res = "Втор 6.16; Лк 4.12"
                10 -> res = "Втор 6.13; 10.20; Лк 4.8"
                12 -> res = "Мк 1.14; Лк 4.14; Ин 4.43"
                16 -> res = "Ис 9.1-2"
                17 -> res = "Мк 1.15"
                18 -> res = "Мк 1.16"
                24 -> res = "Мк 6.55"
                25 -> res = "Лк 6.17"
            }
        }
        if (glava == 5) {
            when (stih) {
                3 -> res = "Лк 6.20"
                4 -> res = "Ис 61.2-3; Лк 6.21"
                5 -> res = "Пс 36.11"
                8 -> res = "Пс 23.4"
                9 -> res = "Евр 12.14"
                10 -> res = "1 Пет 3.14"
                11 -> res = "Лк 6.22; 1 Пет 4.14"
                12 -> res = "Мф 21.35"
                13 -> res = "Мк 9.50; Лк 14.34"
                14 -> res = "Флп 2.15"
                15 -> res = "Мк 4.21; Лк 8.16; 11.33"
                16 -> res = "1 Пет 2.12; Флп 2.15"
                18 -> res = "Лк 16.17"
                21 -> res = "Исх 20.13; Втор 5.17; Мф 19.18; Мк 10.19; Лк 18.20"
                25 -> res = "Лк 12.58"
                27 -> res = "Исх 20.14; Втор 5.18"
                29 -> res = "Втор 13.6-8; Мф 18.8-9; Мк 9.43, 47"
                31 -> res = "Втор 24.1; Мф 19.7; Мк 10.4, 11; Лк 16.18; 1 Кор 7.10"
                33 -> res = "Лев 19.12; Втор 23.21; Исх 20.7"
                37 -> res = "Иак 5.12"
                38 -> res = "Исх 21.24; Лев 24.20; Втор 19.21"
                39 -> res = "Лк 6.29; Иак 3.13; Рим 12.17; 1 Кор 6.7; 1 Фес 5.15"
                42 -> res = "Втор 15.7; Лк 6.34"
                43 -> res = "Лев 19.18; Мф 22.39; Мк 12.31; Иак 2.8; Рим 13.9"
                44 -> res = "Лк 6.27; 23.34; Деян 7.60; 1 Кор 4.12"
                45 -> res = "Лк 6.35"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Рим 12.8"
                9 -> res = "Лк 11.2"
                14 -> res = "Сир 28.2; Мк 11.25"
                20 -> res = "Лк 12.21, 33; 1 Тим 6.19"
                22 -> res = "Лк 11.34"
                24 -> res = "Лк 16.13"
                25 -> res = "Пс 54.23; Лк 12.22; 1 Пет 5.7"
                33 -> res = "Мк 10.30; Лк 12.31; 1 Тим 4.8"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Лк 6.37; Рим 2.1; 1 Кор 4.5"
                2 -> res = "Мк 4.24; Лк 6.38"
                3 -> res = "Лк 6.41"
                7 -> res = "Мф 21.22; Мк 11.24; Лк 11.9; Ин 14.13; Иак 1.6"
                9 -> res = "Лк 11.11"
                12 -> res = "Тов 4.15; Лк 6.31"
                13 -> res = "Лк 13.24"
                15 -> res = "Иер 23.16; Мф 24.4; 1 Ин 4.1"
                18 -> res = "Лк 6.43"
                19 -> res = "Мф 3.10; Ин 15.6"
                21 -> res = "Лк 6.46; Ин 6.40; Иак 1.22; Рим 2.13"
                23 -> res = "Пс 6.9; Лк 13.25, 27"
                24 -> res = "Лк 6.47-48"
                28 -> res = "Мф 22.33; Мк 1.22; Лк 4.32"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "Мк 1.40; Лк 5.12"
                4 -> res = "Лев 14.3-4; Мк 1.44; Лк 5.14"
                5 -> res = "Лк 7.2"
                12 -> res = "Мф 22.13"
                14 -> res = "Мк 1.29-30; Лк 4.38"
                16 -> res = "Мк 1.32; Лк 4.40"
                17 -> res = "Ис 53.4; 1 Пет 2.24"
                19 -> res = "Лк 9.57"
                22 -> res = "Лк 9.60"
                23 -> res = "Мк 4.35-36; Лк 8.22"
                28 -> res = "Мк 5.1-2; Лк 8.27"
                29 -> res = "Мк 1.24"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Мк 2.1"
                2 -> res = "Мк 2.3; Лк 5.18"
                5 -> res = "Мк 2.9; Лк 5.23"
                9 -> res = "Мк 2.14; Лк 5.27"
                13 -> res = "Ос 6.6; Мф 12.7; Мк 2.17; Лк 5.32"
                14 -> res = "Мк 2.18; Лк 5.33"
                16 -> res = "Мк 2.21; Лк 5.36"
                18 -> res = "Мк 5.22; Лк 8.41"
                20 -> res = "Мк 5.25"
                27 -> res = "Мф 20.30"
                32 -> res = "Лк 11.14"
                34 -> res = "Мф 12.24; Мк 3.22; Лк 11.15"
                35 -> res = "Мк 6.6; Лк 13.22"
                36 -> res = "Ис 53.6; Мк 6.34"
                37 -> res = "Лк 10.2; Ин 4.35"
                38 -> res = "2 Фес 3.1"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Мк 3.14; Лк 9.1"
                6 -> res = "Мф 15.24"
                7 -> res = "Лк 9.2"
                9 -> res = "Мк 6.8; Лк 9.3"
                10 -> res = "Лк 10.7; 1 Тим 5.18"
                12 -> res = "Лк 10.5"
                14 -> res = "Мк 6.11; Лк 9.5; Деян 13.51"
                16 -> res = "Лк 10.3; Рим 16.19; 2 Кор 1.12"
                19 -> res = "Мк 13.11; Лк 12.11"
                24 -> res = "Лк 6.40; Ин 13.16; 15.20"
                25 -> res = "Мф 9.34"
                26 -> res = "Мк 4.22; Лк 8.17; 12.2"
                28 -> res = "Лк 12.4"
                29 -> res = "Лк 12.6"
                32 -> res = "Мк 8.38; Лк 9.26; 12.8"
                33 -> res = "2 Тим 2.12"
                34 -> res = "Лк 12.51"
                36 -> res = "Мих 7.6"
                37 -> res = "Лк 14.26"
                38 -> res = "Мф 16.24; Мк 8.34"
                39 -> res = "Мк 8.35; Лк 9.24; Ин 12.25"
                40 -> res = "Лк 10.16; Ин 13.20"
                42 -> res = "Мк 9.41"
            }
        }
        if (glava == 11) {
            when (stih) {
                2 -> res = "Лк 7.18-19"
                3 -> res = "Втор 18.15"
                5 -> res = "Ис 29.18; 35.5"
                10 -> res = "Мал 3.1; Мк 1.2; Лк 7.27"
                12 -> res = "Лк 16.16"
                14 -> res = "Мал 4.5"
                16 -> res = "Лк 7.31"
                19 -> res = "Лк 7.34-35"
                21 -> res = "Лк 10.13"
                25 -> res = "Пс 8.3; Лк 10.21; 1 Кор 1.27; 2 Кор 11.3"
                27 -> res = "Мф 16.17; Ин 3.35; 6.46"
                29 -> res = "Иер 6.16"
                30 -> res = "1 Ин 5.3"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Втор 23.25; Мк 2.23; Лк 6.1"
                4 -> res = "Исх 29.32; 1 Цар 21.6; Мк 2.26; Лк 6.4"
                5 -> res = "Лев 8.31; 24.9"
                7 -> res = "Ос 6.6; Мф 9.13"
                9 -> res = "Мк 3.1; Лк 6.6"
                21 -> res = "Ис 42.1-4"
                22 -> res = "Лк 11.14"
                24 -> res = "Мф 9.34; Мк 3.22; Лк 11.15"
                25 -> res = "Мк 3.24; Лк 11.17"
                31 -> res = "Мк 3.28; Лк 12.10; 1 Ин 5.16"
                34 -> res = "Лк 6.45"
                37 -> res = "Лк 19.22"
                38 -> res = "Мф 16.1; 1 Кор 1.22"
                39 -> res = "Лк 11.29"
                40 -> res = "Иона 2.1"
                41 -> res = "Иона 3.5; Лк 11.32"
                42 -> res = "3 Цар 10.1; 2 Пар 9.1; Лк 11.31"
                43 -> res = "Лк 11.24"
                45 -> res = "2 Пет 2.20; Евр 6.4"
                46 -> res = "Мк 3.31; Лк 8.19"
                50 -> res = "Ин 15.14"
            }
        }
        if (glava == 13) {
            when (stih) {
                3 -> res = "Мк 4.2; Лк 8.4"
                12 -> res = "Мф 25.29; Мк 4.25; Лк 8.18; 19.26"
                14 -> res = "Мк 4.12; Лк 8.10; Ин 12.40; Деян 28.26; Рим 11.8"
                15 -> res = "Ис 6.9-10"
                16 -> res = "Лк 10.23"
                17 -> res = "1 Пет 1.10"
                18 -> res = "Мк 4.15; Лк 8.11"
                31 -> res = "Мк 4.30; Лк 13.18"
                33 -> res = "Лк 13.20"
                34 -> res = "Мк 4.33"
                35 -> res = "Пс 77.2; 48.4"
                39 -> res = "Иоил 3.13; Откр 14.15"
                43 -> res = "Прем 3.7; Дан 12.3"
                54 -> res = "Мк 6.1; Лк 4.16"
                55 -> res = "Ин 6.42"
                57 -> res = "Мк 6.4; Лк 4.24; Ин 4.44"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Мк 6.14; Лк 9.7"
                3 -> res = "Мк 6.17; Лк 3.19"
                13 -> res = "Мк 6.32; Лк 9.10"
                17 -> res = "Мк 6.38; Лк 9.13; Ин 6.9"
                23 -> res = "Мк 6.46; Ин 6.15"
                34 -> res = "Мк 6.53"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Мк 7.1"
                4 -> res = "Исх 20.12; 21.17; Лев 20.9; Втор 5.16; Притч 20.20; Сир 3.7; Мк 7.10; Еф 6.2"
                8 -> res = "Мк 7.6"
                9 -> res = "Ис 29.13"
                10 -> res = "Мк 7.14"
                13 -> res = "Ин 15.2"
                14 -> res = "Ис 42.19; Иер 5.31; Лк 6.39"
                18 -> res = "Иак 3.6"
                19 -> res = "Быт 6.5; 8.21; Мк 7.21"
                21 -> res = "Мк 7.24"
                24 -> res = "Ис 58.6; Иер 50.6; Иез 34.5-6; Мф 10.6"
                30 -> res = "Ис 35.5-6"
                32 -> res = "Мк 8.1"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Мф 12.38; Мк 8.11; 1 Кор 1.22"
                2 -> res = "Лк 12.54"
                4 -> res = "Иона 2.1; Мф 12.39"
                5 -> res = "Мк 8.14"
                6 -> res = "Мк 8.15; Лк 12.1"
                13 -> res = "Дан 7.13-14; Мк 8.27; Лк 9.18"
                16 -> res = "Мф 14.33; Мк 8.29; Лк 9.20; Ин 6.69"
                17 -> res = "Мф 11.25, 27"
                18 -> res = "Лк 22.31-32; 1 Пет 2.4; 1 Кор 3.11"
                19 -> res = "Мф 18.18; Ин 20.23"
                20 -> res = "Мк 8.30"
                23 -> res = "Рим 8.7"
                24 -> res = "Мф 10.38; Мк 8.34; Лк 14.27"
                27 -> res = "Пс 61.13; Зах 14.5; Мф 25.31; Рим 2.6; Откр 19.14"
                28 -> res = "Мк 9.1; Лк 9.27"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Мк 9.2; Лк 9.28"
                5 -> res = "Втор 18.15; Мф 3.17; Лк 3.22"
                10 -> res = "Мф 11.14; Мк 9.11"
                14 -> res = "Мк 9.17; Лк 9.38"
                20 -> res = "Мф 21.21; Мк 9.23; 11.23; Лк 17.6"
                21 -> res = "Мк 9.29"
                22 -> res = "Лк 9.22; 24.7"
            }
        }
        if (glava == 18) {
            when (stih) {
                2 -> res = "Мк 9.36"
                4 -> res = "Мк 10.14; 1 Кор 14.20"
                6 -> res = "Мк 9.42; Лк 17.1"
                7 -> res = "1 Кор 11.19"
                8 -> res = "Мк 9.43"
                9 -> res = "Втор 13.6-8; Мф 5.29"
                10 -> res = "Быт 19.16; Пс 33.8; Евр 1.14"
                11 -> res = "Мф 10.6; Лк 9.56"
                12 -> res = "Лк 15.4"
                15 -> res = "Лев 19.17; Лк 17.3; Иак 5.19-20"
                16 -> res = "Втор 17.6; 19.15; Ин 8.17; 2 Кор 13.1; Евр 10.28"
                18 -> res = "Мф 16.19; Ин 20.23"
                21 -> res = "Лк 17.4"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "Мк 10.1"
                4 -> res = "Быт 1.27; Мк 10.6"
                5 -> res = "Быт 2.24; Мк 10.7-8; 1 Кор 6.16; Еф 5.31"
                7 -> res = "Втор 24.1 и сл; Мф 5.31"
                9 -> res = "Мф 5.32; Мк 10.11; Лк 16.18"
                12 -> res = "Ис 56.3; 1 Кор 7.7"
                13 -> res = "Мк 10.13; Лк 18.15"
                14 -> res = "Мф 18.3"
                16 -> res = "Мк 10.17; Лк 18.18"
                17 -> res = "Иак 1.17"
                19 -> res = "Исх 20.12-16; Лев 19.18; Втор 5.16-20"
                26 -> res = "Иов 42.2"
                27 -> res = "Мк 10.28; Лк 18.28"
                28 -> res = "Лк 22.30"
                30 -> res = "Мк 10.31; Лк 13.30"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "Мф 21.33"
                16 -> res = "Мф 19.30; 22.14"
                18 -> res = "Мк 10.33; Лк 18.31"
                19 -> res = "Мк 10.34; Ин 18.31-32"
                20 -> res = "Мк 10.35"
                22 -> res = "Мф 26.39, 42"
                24 -> res = "Мк 10.41; Лк 22.24"
                28 -> res = "Мф 26.28; Ин 11.51; Флп 2.7-8"
                29 -> res = "Мк 10.46; Лк 18.35"
                30 -> res = "Мф 9.27"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "Мк 11.1; Лк 19.29"
                5 -> res = "Ис 62.11; Зах 9.9; Ин 12.15"
                7 -> res = "Мк 11.7"
                8 -> res = "Ин 12.13"
                9 -> res = "Пс 117.26; Мк 11.10; Лк 19.38"
                12 -> res = "Мк 11.15; Лк 19.45; Ин 2.14"
                13 -> res = "Ис 56.7; Иер 7.11; Мк 11.17; Лк 19.46"
                16 -> res = "Пс 8.3"
                19 -> res = "Мк 11.13"
                21 -> res = "Мф 17.20; Лк 17.6; Иак 1.6"
                22 -> res = "Мф 7.7; Мк 11.24; Ин 14.13"
                23 -> res = "Мф 7.29; Мк 11.28; Лк 20.1-2"
                26 -> res = "Мф 14.5; Мк 6.20"
                31 -> res = "Лк 7.29"
                32 -> res = "Лк 3.12"
                33 -> res = "Пс 79.9; Песн 8.11-12; Ис 5.1; Иер 2.21; Мк 12.1; Лк 20.9"
                35 -> res = "Мф 5.12; 23.34, 37"
                38 -> res = "Мф 26.4; 27.1"
                39 -> res = "Евр 13.12"
                42 -> res = "Пс 117.22-23; Ис 28.16; Мк 12.10; Лк 20.17; Деян 4.11"
                44 -> res = "Ис 8.14; Дан 2.44-45; 1 Пет 2.7; Рим 9.32"
            }
        }
        if (glava == 22) {
            when (stih) {
                2 -> res = "Притч 9.1-2; Лк 14.16; Откр 19.7"
                7 -> res = "Лк 19.27"
                14 -> res = "Мф 20.16"
                15 -> res = "Мк 12.13; Лк 20.20"
                21 -> res = "Мк 12.17; Рим 13.7"
                23 -> res = "Мк 12.18; Лк 20.27; Деян 23.8"
                24 -> res = "Втор 25.5; Мк 12.19; Лк 20.28"
                30 -> res = "1 Кор 15.44"
                32 -> res = "Исх 3.6; Мк 12.26; Лк 20.37"
                35 -> res = "Мк 12.28; Лк 10.25"
                37 -> res = "Втор 6.5; Мих 6.8; Мк 12.30; Лк 10.27"
                39 -> res = "Лев 19.18; Мф 5.43; Мк 12.31"
                42 -> res = "Мк 12.35; Лк 20.41"
                44 -> res = "Пс 109.1; Лк 20.42"
            }
        }
        if (glava == 23) {
            when (stih) {
                4 -> res = "Лк 11.46; Деян 15.10"
                5 -> res = "Чис 15.38; Втор 22.12"
                6 -> res = "Мк 12.39; Лк 11.43; 20.46"
                8 -> res = "Иак 3.1; 1 Кор 3.4"
                9 -> res = "Мал 1.6"
                12 -> res = "Лк 14.11"
                13 -> res = "Иез 22.26; Лк 11.52"
                14 -> res = "Мк 12.40; Лк 20.47"
                19 -> res = "Исх 29.37"
                21 -> res = "2 Пар 6.2; Пс 25.8"
                23 -> res = "Ос 6.6; Мих 6.8; Мф 12.7; Лк 11.42"
                27 -> res = "Лк 11.44; Деян 23.3"
                33 -> res = "Мф 3.7"
                34 -> res = "2 Пар 36.15-16; Лк 11.49"
                35 -> res = "Быт 4.8; 2 Пар 24.21-22; Лк 11.51; 1 Ин 3.12"
                37 -> res = "Втор 32.11-12; Лк 13.34"
                38 -> res = "Лк 13.35"
                39 -> res = "Пс 117.26; Мф 21.9"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "Мк 13.1; Лк 21.5"
                2 -> res = "Мк 13.2; Лк 19.44; 21.6"
                4 -> res = "Мк 13.5; Лк 21.8; Еф 5.6; 2 Фес 2.3"
                9 -> res = "Мф 10.17; Мк 13.9; Лк 21.12; Ин 15.20"
                15 -> res = "Дан 9.27; Мк 13.14; Лк 21.20"
                23 -> res = "Мк 13.21; Лк 17.23"
                28 -> res = "Лк 17.37"
                29 -> res = "Ис 13.10; Иез 32.7; Иоил 2.31; Мк 13.24; Лк 21.25"
                30 -> res = "Зах 12.10; Мк 14.62; Откр 1.7"
                31 -> res = "1 Кор 15.52; 1 Фес 4.16"
                34 -> res = "Мк 13.30-31"
                35 -> res = "Ис 51.6; 2 Пет 3.10"
                37 -> res = "Быт 7.7; Лк 17.26; 1 Пет 3.20"
                42 -> res = "Мф 25.13; Мк 13.33"
                43 -> res = "Лк 12.39; 1 Фес 5.2; Откр 16.15"
                45 -> res = "Лк 12.42; 1 Кор 4.2"
                46 -> res = "Откр 16.15"
            }
        }
        if (glava == 25) {
            when (stih) {
                10 -> res = "Лк 13.25"
                11 -> res = "Мф 7.21"
                12 -> res = "Пс 5.5; Авв 1.13"
                13 -> res = "Мк 13.33; 1 Кор 16.13"
                14 -> res = "Лк 19.12"
                15 -> res = "Рим 12.6; 1 Кор 12.7, 11"
                21 -> res = "Ис 61.7"
                29 -> res = "Мф 13.12; Мк 4.25; Лк 8.18; 19.26"
                30 -> res = "Мф 24.51"
                31 -> res = "Мф 13.49; 16.27; Деян 1.11"
                34 -> res = "Мф 20.23"
                35 -> res = "Ис 58.7; Иез 18.7; 2 Тим 1.18"
                40 -> res = "Притч 14.31; 19.17; Мф 10.42"
                41 -> res = "Пс 6.9; Лк 13.27"
                46 -> res = "Дан 12.2; Ин 5.29"
            }
        }
        if (glava == 26) {
            when (stih) {
                2 -> res = "Мк 14.1; Лк 22.1; Ин 13.1"
                3 -> res = "Пс 2.2; Ин 11.47"
                4 -> res = "Пс 40.8"
                6 -> res = "Мк 14.3; Ин 11.2; 12.3"
                11 -> res = "Втор 15.11"
                14 -> res = "Мк 14.10; Лк 22.4"
                15 -> res = "Зах 11.13"
                17 -> res = "Исх 12.6, 15; Мк 14.12; Лк 22.7"
                20 -> res = "Лк 22.14"
                21 -> res = "Пс 40.10; Мк 14.18; Ин 13.21"
                24 -> res = "Пс 21.3; Ис 53.3; Дан 9.26"
                26 -> res = "Мк 14.22; Лк 22.19; 1 Кор 11.24"
                28 -> res = "Мф 20.28"
                31 -> res = "Зах 13.7; Мк 14.27; Ин 16.32"
                32 -> res = "Мф 28.16; Мк 14.28"
                34 -> res = "Мк 14.30; Лк 22.34; Ин 13.38"
                36 -> res = "Мк 14.32; Лк 22.39"
                37 -> res = "Пс 114.3; Ин 12.27"
                39 -> res = "Мф 20.22; Ин 5.30; Флп 2.8; Евр 5.7-8"
                47 -> res = "Мк 14.43; Лк 22.47; Ин 18.3"
                52 -> res = "Быт 9.6; Откр 13.10"
                53 -> res = "Дан 7.10"
                54 -> res = "Пс 21.2; Ис 53.2; Дан 9.26"
                57 -> res = "Мк 14.53; Лк 22.54"
                59 -> res = "Пс 26.12; 34.11; Мк 14.55"
                61 -> res = "Мф 27.40; Мк 14.58; Ин 2.19"
                63 -> res = "Ис 53.7; Деян 8.33"
                64 -> res = "Пс 109.1; Дан 7.13; Мф 16.27; Ин 6.62; Деян 1.11; Рим 14.11; 1 Фес 4.16; Откр 1.7"
                67 -> res = "Ис 50.6; 53.3"
                70 -> res = "Мк 14.68"
                74 -> res = "Мк 14.72"
            }
        }
        if (glava == 27) {
            when (stih) {
                1 -> res = "Пс 2.2"
                2 -> res = "Мк 15.1; Лк 23.1"
                5 -> res = "Деян 1.18"
                8 -> res = "Деян 1.19"
                9 -> res = "Иер 32.9; Зах 11.12"
                11 -> res = "Мк 15.2; Лк 23.3; Ин 18.37; 1 Тим 6.13"
                12 -> res = "Мф 26.63"
                17 -> res = "Мф 21.11"
                20 -> res = "Мк 15.11; Лк 23.18; Ин 18.40; Деян 3.14"
                26 -> res = "Мк 15.15; Ин 19.1"
                33 -> res = "Мк 15.22; Лк 23.33; Ин 19.17; Евр 13.12"
                34 -> res = "Пс 68.22"
                35 -> res = "Пс 21.19"
                38 -> res = "Ис 53.12"
                39 -> res = "Пс 21.8; 108.25"
                40 -> res = "Мф 26.61; Мк 14.58"
                43 -> res = "Пс 21.9, 18; Прем 2.18"
                45 -> res = "Ам 8.9"
                46 -> res = "Пс 21.2; Мк 15.34"
                48 -> res = "Пс 68.22; Ин 19.29"
                51 -> res = "Исх 26.31; 2 Пар 3.14; Евр 10.20"
                57 -> res = "Мк 15.42-43; Лк 23.50; Ин 19.38"
            }
        }
        if (glava == 28) {
            when (stih) {
                1 -> res = "Мк 16.1; Лк 24.1; Ин 20.1"
                5 -> res = "Мк 16.6"
                6 -> res = "Мф 12.40; 16.21; 17.23"
                7 -> res = "Мф 26.32; Мк 14.28; Ин 21.1; Деян 1.3; 10.41; 1 Кор 15.5"
                9 -> res = "Мк 16.9; Ин 20.14"
                10 -> res = "Ин 20.17; Евр 2.11"
                18 -> res = "Мф 11.27; Лк 1.32; Ин 3.35; 13.3; 17.2; 1 Пет 3.22; Рим 14.9; Еф 1.10; Флп 2.9; Кол 1.16; Евр 2.8; Откр 19.16"
            }
        }
        return res
    }

    fun kniga52(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                2 -> res = "Мал 3.1; Мф 11.10; Лк 7.27"
                3 -> res = "Ис 40.3; Мф 3.3; Лк 3.4; Ин 1.23"
                4 -> res = "Мф 3.1; Лк 3.3; Ин 1.31; Деян 13.24"
                6 -> res = "Лев 11.22; Мф 3.4"
                7 -> res = "Лк 3.16; Ин 1.27"
                8 -> res = "Деян 1.5; 2.4; 1 Кор 12.13"
                9 -> res = "Мф 3.13; Лк 3.21"
                10 -> res = "Мф 3.16; Лк 3.21; Ин 1.32"
                12 -> res = "Мф 4.1; Лк 4.1"
                14 -> res = "Мф 4.12; Лк 4.14; Ин 4.43"
                15 -> res = "Мф 4.17"
                16 -> res = "Мф 4.18"
                21 -> res = "Мф 4.13; Лк 4.31"
                22 -> res = "Мф 7.28; Лк 4.32"
                23 -> res = "Лк 4.33"
                24 -> res = "Дан 9.24; Мф 8.29; Иак 2.19"
                29 -> res = "Мф 8.14; Лк 4.38"
                32 -> res = "Мф 8.16; Лк 4.40"
                34 -> res = "Мк 3.12; Лк 4.41; Деян 16.17; 19.15"
                38 -> res = "Лк 4.43"
                40 -> res = "Мф 8.2; Лк 5.12"
                44 -> res = "Лев 13.2; Мф 8.4; Лк 5.14"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Мф 9.1"
                3 -> res = "Мф 9.2; Лк 5.18"
                5 -> res = "Ис 43.25"
                8 -> res = "Ин 2.24; 6.64"
                9 -> res = "Мф 9.5; Лк 5.23"
                14 -> res = "Мф 9.9; Лк 5.27"
                17 -> res = "Мф 9.13; Лк 5.32; 1 Тим 1.15"
                18 -> res = "Мф 9.14; Лк 5.33"
                21 -> res = "Мф 9.16; Лк 5.36"
                23 -> res = "Втор 23.25; Мф 12.1; Лк 6.1"
                26 -> res = "Исх 29.33; Лев 24.9; 1 Цар 21.6; Мф 12.4; Лк 6.4"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Мф 12.9; Лк 6.6"
                6 -> res = "Ин 10.39"
                7 -> res = "Мф 4.25"
                11 -> res = "Мф 16.16"
                14 -> res = "Мф 10.1; Лк 9.1"
                16 -> res = "Мф 16.18"
                21 -> res = "Ин 10.20"
                22 -> res = "Мф 9.34; Лк 11.15"
                24 -> res = "Мф 12.25; Лк 11.17"
                28 -> res = "Мф 12.31; Лк 12.10; 1 Ин 5.16; Евр 10.26"
                31 -> res = "Мф 12.46; Лк 8.19"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Мф 13.1; Лк 8.4"
                11 -> res = "Мф 11.25; 16.17; 1 Кор 2.10"
                12 -> res = "Ис 6.9-10; Мф 13.14; Лк 8.10; Ин 12.40"
                14 -> res = "Мф 13.18; Лк 8.11"
                16 -> res = "Ис 42.20; Иез 33.31; Ин 5.35"
                19 -> res = "Лк 12.15; 1 Тим 6.9"
                21 -> res = "Мф 5.15; Лк 8.16"
                22 -> res = "Мф 10.26; Лк 8.17; 12.2"
                24 -> res = "Мф 7.2; Лк 6.38"
                25 -> res = "Мф 13.12; 25.29; Лк 8.18; 19.26"
                30 -> res = "Мф 13.31; Лк 13.18"
                33 -> res = "Мф 13.34"
                35 -> res = "Мф 8.23; Лк 8.22"
                39 -> res = "Иов 26.12; Пс 88.10"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Мф 8.28; Лк 8.26"
                25 -> res = "Мф 9.20"
                30 -> res = "Лк 8.45"
                35 -> res = "Лк 8.49"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Мф 13.54; Лк 4.16"
                2 -> res = "Мф 7.28; Мк 1.27"
                3 -> res = "Лк 4.22; Ин 6.42"
                4 -> res = "Иер 12.6; Мф 13.57; Лк 4.24; Ин 4.44"
                6 -> res = "Мф 9.35"
                7 -> res = "Мф 10.1; Лк 9.1"
                11 -> res = "Мф 10.14; Лк 9.5; Деян 13.51; 18.6"
                13 -> res = "Иак 5.14"
                14 -> res = "Мф 14.1; Лк 9.7"
                17 -> res = "Лк 3.19"
                18 -> res = "Лев 18.16; 20.21"
                20 -> res = "Мф 21.26"
                30 -> res = "Лк 9.10"
                32 -> res = "Мф 14.13; Лк 9.10"
                34 -> res = "Мф 9.36"
                38 -> res = "Мф 14.17; Лк 9.13; Ин 6.9"
                46 -> res = "Мф 14.23"
                47 -> res = "Ин 6.16"
                52 -> res = "Мк 8.18"
                53 -> res = "Мф 14.34"
                55 -> res = "Мф 4.24"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Мф 15.1"
                6 -> res = "Мф 15.8"
                7 -> res = "Ис 29.13; Тит 1.14"
                10 -> res = "Исх 20.12; 21.17; Сир 3.7; Мф 15.4"
                15 -> res = "Мф 15.11; Рим 14.17; Тит 1.15"
                21 -> res = "Быт 8.21; Притч 6.14; Иер 17.9; Мф 15.19"
                24 -> res = "Мф 15.21"
                31 -> res = "Мф 15.29"
                37 -> res = "Ис 35.6"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Мф 15.32"
                10 -> res = "Мф 15.39"
                11 -> res = "Мф 16.1"
                15 -> res = "Мф 16.6; Лк 12.1"
                18 -> res = "Мк 6.38; Ин 6.9"
                27 -> res = "Мф 16.13; Лк 9.18"
                29 -> res = "Ин 6.69"
                31 -> res = "Мк 9.31; 10.33; Лк 9.22"
                34 -> res = "Мф 10.38; 16.24; Лк 9.23; 14.27"
                37 -> res = "Пс 48.9"
                38 -> res = "Мф 10.33; Лк 9.26; 1 Ин 2.23; Рим 1.16; 2 Тим 2.12"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Мф 16.28; Лк 9.27"
                2 -> res = "Мф 17.1"
                11 -> res = "Мф 17.10"
                12 -> res = "Пс 21.7; Ис 53.3; Дан 7.13; 9.26"
                13 -> res = "Мал 4.5; Мф 17.12"
                17 -> res = "Мф 17.14; Лк 9.38"
                23 -> res = "Мф 17.20; 21.22"
                31 -> res = "Мф 17.22; Лк 9.22; 24.7"
                36 -> res = "Мф 18.5; Лк 9.48"
                38 -> res = "Лк 9.49"
                39 -> res = "1 Кор 12.3"
                41 -> res = "Мф 10.42"
                42 -> res = "Втор 13.6-10; Мф 18.6; Лк 17.1"
                43 -> res = "Мф 5.29; 18.8"
                44, 49 -> res = "Ис 66.24"
                50 -> res = "Мф 5.13; Рим 14.19; Кол 4.6"
            }
        }
        if (glava == 10) {
            when (stih) {
                2 -> res = "Мф 19.3"
                4 -> res = "Втор 24.1; Мф 5.31; Лк 16.18"
                6 -> res = "Быт 1.27; Мф 19.4"
                7 -> res = "1 Кор 6.16"
                8 -> res = "Быт 2.24"
                9 -> res = "1 Кор 7.10"
                13 -> res = "Мф 19.13; Лк 18.15"
                14 -> res = "Мф 18.4; 1 Пет 2.2; 1 Кор 14.20"
                15 -> res = "Мф 11.25"
                16 -> res = "Мф 19.15"
                17 -> res = "Мф 19.16; Лк 18.18"
                19 -> res = "Исх 20.12-17; Втор 5.17; Мф 5.21; Лк 18.20"
                21 -> res = "Мф 6.19"
                23 -> res = "Иов 31.24; Иак 2.5; 1 Тим 6.17"
                27 -> res = "Иов 42.2"
                28 -> res = "Мф 19.27; Лк 18.28"
                31 -> res = "Мф 19.30; Лк 13.30"
                33 -> res = "Мф 20.18; Лк 18.31"
                35 -> res = "Мф 20.20"
                41 -> res = "Мф 20.24; Лк 22.24"
                44 -> res = "Мк 9.35"
                45 -> res = "Ин 13.15; 1 Пет 5.3; Флп 2.7"
                46 -> res = "Мф 20.29"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Мф 21.1; Лк 19.29"
                7 -> res = "Мф 21.7; Лк 19.35"
                8 -> res = "Ин 12.13"
                9 -> res = "Пс 117.26"
                15 -> res = "Мф 21.12; Лк 19.45; Ин 2.14"
                17 -> res = "Ис 56.7; Иер 7.11"
                24 -> res = "Мф 7.7; Лк 11.9; Ин 14.13"
                25 -> res = "Сир 28.2; Мф 6.14; Еф 4.32; Кол 3.13"
                27 -> res = "Мф 21.23; Лк 20.1"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Пс 79.9; Песн 8.12; Ис 5.1; Мф 21.33"
                3 -> res = "Мф 5.12; 23.34"
                7 -> res = "Мф 26.3-4"
                8 -> res = "Евр 13.12"
                10 -> res = "Мф 21.42"
                11 -> res = "Пс 117.22-23"
                13 -> res = "Мф 22.15; Лк 20.20"
                17 -> res = "Мф 22.21"
                18 -> res = "Лк 20.27"
                19 -> res = "Втор 25.5; Мф 22.24; Лк 20.28"
                26 -> res = "Исх 3.6; Мф 22.32; Лк 20.37"
                28 -> res = "Мф 22.35; Лк 10.25"
                29 -> res = "Мф 22.37; Лк 10.27"
                30 -> res = "Втор 6.4-5"
                31 -> res = "Лев 19.18; Мф 5.43; Иак 2.8; Рим 13.9; Гал 5.14"
                35 -> res = "Мф 22.41; Лк 20.41"
                36 -> res = "Пс 109.1"
                39 -> res = "Мф 23.6; Лк 11.43"
                40 -> res = "Иез 22.25; Лк 20.47"
                41 -> res = "Лк 21.1"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Мф 24.1; Лк 21.5"
                2 -> res = "Лк 19.44; 21.6"
                5 -> res = "Мф 24.4; Лк 21.8; Еф 5.6; 2 Фес 2.3"
                9 -> res = "Ин 15.20"
                11 -> res = "Мф 10.19; Лк 12.11"
                14 -> res = "Дан 9.27; Мф 24.15; Лк 21.20"
                21 -> res = "Мф 24.23; Лк 17.23"
                24 -> res = "Ис 13.10; Иез 32.7; Иоил 2.31; Мф 24.29; Лк 21.25"
                26 -> res = "Мф 24.30; Откр 1.7"
                30 -> res = "Мф 24.34"
                33 -> res = "Мф 24.42; 25.13"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Мф 26.2; Лк 22.1"
                3 -> res = "Мф 26.7; Ин 11.2; 12.3"
                10 -> res = "Мф 26.14; Лк 22.4"
                12 -> res = "Мф 26.17; Лк 22.7"
                18 -> res = "Пс 40.10; Мф 26.20; Лк 22.14; Ин 13.21"
                22 -> res = "Мф 26.26; Лк 22.19; 1 Кор 11.24"
                27 -> res = "Зах 13.7; Мф 26.31; Ин 16.32"
                28 -> res = "Мк 16.7"
                30 -> res = "Мф 26.34; Лк 22.34; Ин 13.38"
                32 -> res = "Мф 26.36; Лк 22.39"
                36 -> res = "Мф 26.39; Флп 2.8; Евр 5.7-8"
                38 -> res = "Лк 22.40"
                43 -> res = "Мф 26.47; Лк 22.47; Ин 18.3"
                49 -> res = "Иов 19.13; Пс 21.7; 68.9; 87.9; Ис 53.12"
                53 -> res = "Мф 26.57"
                55 -> res = "Пс 26.12; 34.11; Мф 26.59"
                58 -> res = "Мк 15.29"
                61 -> res = "Ис 53.7; Деян 8.32; Евр 1.5"
                62 -> res = "Мф 26.64; 2 Фес 1.10"
                66 -> res = "Мф 26.69; Лк 22.56; Ин 18.25"
                72 -> res = "Мф 26.75; Мк 14.30"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Мф 27.2; Лк 22.66"
                2 -> res = "Мф 27.11; Лк 23.3; Ин 18.33; 1 Тим 6.13"
                11 -> res = "Мф 27.20; Лк 23.18; Ин 18.40; Деян 3.14"
                15 -> res = "Мф 27.26; Ин 19.1"
                21 -> res = "Мф 27.32; Лк 23.26"
                22 -> res = "Мф 27.33; Лк 23.33; Ин 19.17; Евр 13.12"
                23 -> res = "Пс 68.22"
                24 -> res = "Пс 21.19; Ин 19.24"
                26 -> res = "Мф 27.37"
                28 -> res = "Ис 53.12"
                29 -> res = "Пс 68.21; Мф 26.61; 27.40; Мк 14.58; Лк 22.37; Ин 2.19"
                34 -> res = "Пс 21.2; Мф 27.46"
                36 -> res = "Пс 68.22; Мф 27.48"
                42 -> res = "Мф 27.57"
                43 -> res = "Лк 23.50; Ин 19.38"
                47 -> res = "Мф 27.61"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Мф 28.1; Лк 24.1; Ин 20.1"
                5 -> res = "Ин 20.12"
                7 -> res = "Мф 26.32; Мк 14.28"
                9 -> res = "Мф 28.9; Лк 8.2; Ин 20.14"
                12 -> res = "Лк 24.13"
                14 -> res = "Лк 24.36; Ин 20.19; 1 Кор 15.5, 7"
                15 -> res = "Ис 2.3; 52.10; Мф 28.19; Ин 15.16"
                16 -> res = "Ин 12.48"
                17 -> res = "Деян 2.4; 1 Кор 12.10"
                18 -> res = "Лк 10.19; Деян 28.8; Иак 5.14"
                19 -> res = "Пс 109.1; Лк 24.51; Деян 1.9"
                20 -> res = "Деян 14.3; 1 Кор 3.6; 15.10; Евр 2.4"
            }
        }
        return res
    }

    fun kniga53(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                2 -> res = "1 Ин 1.1; Евр 2.3"
                5 -> res = "1 Пар 24.10; Неем 12.17"
                9 -> res = "Исх 30.7; Лев 16.17; Евр 9.6"
                14 -> res = "Лк 1.58; Ин 5.35"
                17 -> res = "Ис 40.3; Мал 4.6; Мк 1.3; 9.12; Ин 1.23"
                27 -> res = "Мф 1.18"
                31 -> res = "Ис 7.14; Мф 1.21"
                32 -> res = "2 Цар 7.12; Пс 131.11; Ис 9.7"
                33 -> res = "1 Пар 22.10; Пс 44.7; 88.37; Ис 9.7; Иер 23.5; Дан 2.44; 7.14; Мих 4.7"
                35 -> res = "Дан 9.24"
                46 -> res = "Ис 61.10; Авв 3.18"
                50 -> res = "Пс 102.17"
                51 -> res = "Пс 32.10; 76.15; Ис 52.10"
                52 -> res = "Иов 5.11; Ис 66.2"
                53 -> res = "1 Цар 2.5; Пс 33.11; Мф 5.6"
                54 -> res = "Пс 97.3; Ис 41.8"
                55 -> res = "Быт 17.19; 22.18; Пс 131.11"
                68 -> res = "Мф 1.21"
                69 -> res = "Пс 131.17; Иез 29.21"
                70 -> res = "Пс 71.4; Иер 23.6; 30.8-10"
                72 -> res = "Быт 22.16; 26.3; Лев 26.42; Иер 31.33"
                73 -> res = "Евр 6.13"
                74 -> res = "Рим 8.15; Евр 2.15"
                75 -> res = "1 Пет 1.15; Еф 4.24"
                76 -> res = "Лк 1.17"
                78 -> res = "Иер 23.5; Зах 3.8"
            }
        }
        if (glava == 2) {
            when (stih) {
                4 -> res = "1 Цар 16.1, 4; Ин 7.42"
                7 -> res = "Мф 2.1"
                14 -> res = "Ис 2.4; 44.23; 49.13; 57.19; Мих 4.3; Лк 19.38; Рим 5.1"
                21 -> res = "Быт 17.12; Лев 12.3; Мф 1.21"
                23 -> res = "Исх 13.2, 12; 22.29; 34.19; Чис 8.16"
                24 -> res = "Лев 12.6, 8"
                25 -> res = "Лк 24.21"
                30 -> res = "Быт 49.18; 1 Цар 2.1; Пс 97.3; Ис 52.10"
                32 -> res = "Ис 9.2; 42.6; 60.3; Деян 13.47"
                34 -> res = "Ис 8.14; Мф 21.44; 1 Пет 2.7; Рим 9.32"
                35 -> res = "Ин 19.25"
                37 -> res = "1 Тим 5.5"
                40 -> res = "Лк 2.52"
                41 -> res = "Исх 23.17; 34.23"
                47 -> res = "Мф 7.28; Мк 1.22; Лк 4.32; Ин 7.15"
                49 -> res = "Мал 3.1"
                50 -> res = "Лк 9.45"
                52 -> res = "Лк 2.40"
            }
        }
        if (glava == 3) {
            when (stih) {
                3 -> res = "Мф 3.1; Мк 1.4"
                4 -> res = "Мф 3.3; Мк 1.3; Ин 1.23"
                6 -> res = "Ис 40.3-5"
                7 -> res = "Мф 3.7"
                8 -> res = "Мф 3.9; 8.11; Ин 8.39"
                9 -> res = "Мф 3.10; 7.19; Ин 15.6"
                11 -> res = "Иак 2.15; 1 Ин 3.17; 2 Кор 8.14"
                12 -> res = "Мф 21.32"
                16 -> res = "Мф 3.11; Мк 1.7; Ин 1.15; Деян 1.5"
                17 -> res = "Мф 3.12"
                19 -> res = "Мф 14.3; Мк 6.17"
                21 -> res = "Мф 3.16; Мк 1.10; Ин 1.32"
                23 -> res = "Мф 13.55; Мк 6.3; Лк 4.22; Ин 6.42"
                34 -> res = "Быт 11.24-26"
                35 -> res = "Быт 11.20-22"
                36 -> res = "Быт 5.28-29; 6.10; 11.10"
                37 -> res = "Быт 5.12"
                38 -> res = "Быт 5.3"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Мф 4.1; Мк 1.12"
                4 -> res = "Втор 8.3; Мф 4.4"
                8 -> res = "Втор 10.20; Мф 4.10"
                10 -> res = "Мф 4.6"
                11 -> res = "Пс 90.11-12"
                12 -> res = "Втор 6.16; Мф 4.7"
                14 -> res = "Мф 4.12; Мк 1.14; Ин 4.43"
                16 -> res = "Мф 13.54; Мк 6.1"
                19 -> res = "Ис 61.1-2"
                24 -> res = "Мф 13.57; Мк 6.4; Ин 4.44"
                25 -> res = "3 Цар 17.10; Иак 5.17"
                27 -> res = "4 Цар 5.14"
                31 -> res = "Мф 4.13; Мк 1.21"
                32 -> res = "Мф 7.28; Мк 1.22; Лк 2.4"
                33 -> res = "Мк 1.23"
                38 -> res = "Мф 8.14; Мк 1.29"
                40 -> res = "Мф 8.16; Мк 1.32"
                41 -> res = "Мк 1.34; 3.12"
                43 -> res = "Мк 1.38"
            }
        }
        if (glava == 5) {
            when (stih) {
                12 -> res = "Мф 8.2; Мк 1.40"
                14 -> res = "Лев 14.3-4; Мф 8.4; Мк 1.44"
                18 -> res = "Мф 9.2; Мк 2.3"
                27 -> res = "Мф 9.9; Мк 2.14"
                32 -> res = "Мф 9.13; Мк 2.17"
                36 -> res = "Мф 9.16; Мк 2.21"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Втор 23.25; Мф 12.1; Мк 2.23"
                3 -> res = "1 Цар 21.6; Мф 12.4; Мк 2.26"
                4 -> res = "Исх 29.32; Лев 8.31; 24.9; Мф 12.4; Мк 2.26"
                6 -> res = "Мф 12.9; Мк 3.1"
                13 -> res = "Мф 10.1; Мк 3.13"
                17 -> res = "Мф 4.25"
                19 -> res = "Мк 5.30"
                20 -> res = "Мф 5.3"
                21 -> res = "Ис 55.1; 61.2; 65.13"
                22 -> res = "Мф 5.11"
                23 -> res = "2 Пар 36.16; Неем 9.26; Ис 35.10"
                25 -> res = "Притч 14.13; Ис 65.13"
                26 -> res = "Ис 30.10; Ин 7.7"
                27 -> res = "Исх 23.4; Притч 25.21; Мф 5.44"
                29 -> res = "Мф 5.39; Рим 12.17; 1 Кор 6.7"
                31 -> res = "Тов 4.15; Мф 7.12"
                35 -> res = "Втор 15.8; Мф 5.45"
                36 -> res = "Мф 5.48"
                37 -> res = "Мф 7.2; Рим 2.1; 1 Кор 4.5"
                38 -> res = "Притч 19.17; Мф 7.2; Мк 4.24"
                39 -> res = "Ис 42.19; Мф 15.14"
                40 -> res = "Мф 10.24; Ин 13.16; 15.20"
                41 -> res = "Мф 7.3"
                42 -> res = "Притч 18.18"
                43 -> res = "Мф 7.18; 12.33"
                44 -> res = "Мф 7.16"
                45 -> res = "Мф 12.34-35"
                46 -> res = "Мал 1.6; Мф 7.21; Иак 1.22; Рим 2.13"
                48 -> res = "Мф 7.24"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Мф 8.5"
                16 -> res = "Лк 1.68; Ин 6.14"
                18 -> res = "Мф 11.2"
                19 -> res = "Быт 49.10; Ис 35.4; Дан 9.24; Ин 6.14"
                22 -> res = "Пс 145.8; Ис 29.18; 35.5; 42.7; 61.1; Мф 11.5; Лк 4.18"
                23 -> res = "Ис 8.14; Мф 11.6; 1 Пет 2.8"
                27 -> res = "Мал 3.1; Мф 11.10; Мк 1.2"
                28 -> res = "Мф 11.11"
                29 -> res = "Мф 21.31"
                30 -> res = "Деян 20.27"
                31 -> res = "Мф 11.16"
                37 -> res = "Мф 26.7; Мк 14.3; Ин 11.2; 12.3"
                39 -> res = "Лк 15.2"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "Мк 15.40; 16.9"
                4 -> res = "Мф 13.2-3; Мк 4.1-2"
                10 -> res = "Ис 6.9-10; Мф 13.14; Мк 4.12; Ин 12.40"
                12 -> res = "Мф 13.19; Мк 4.15"
                13 -> res = "Иез 33.31"
                14 -> res = "Мф 13.22; Мк 4.18; 10.23; Лк 18.23; 1 Тим 6.9"
                16 -> res = "Мф 5.15; Мк 4.21; Лк 11.33"
                17 -> res = "Иов 12.22; Мф 10.26; Лк 12.2"
                18 -> res = "Мф 13.12; 25.29; Мк 4.25"
                19 -> res = "Мф 12.46; Мк 3.31"
                22 -> res = "Мф 8.23; Мк 4.35"
                25 -> res = "Иов 26.12; Пс 88.10"
                26 -> res = "Мф 8.28; Мк 5.1"
                41 -> res = "Мф 9.18; Мк 5.22"
                45 -> res = "Мк 5.30"
                49 -> res = "Мк 5.35"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Мф 10.1; Мк 3.13; 6.7"
                5 -> res = "Мф 10.14; Мк 6.11; Деян 13.51"
                7 -> res = "Мф 14.1; Мк 6.14"
                9 -> res = "Лк 23.8"
                10 -> res = "Мф 14.13; Мк 6.32"
                13 -> res = "Мф 14.17; Мк 6.38; Ин 6.9"
                18 -> res = "Мф 16.13; Мк 8.27"
                20 -> res = "Ин 6.69"
                22 -> res = "Мф 17.22"
                23 -> res = "Мф 10.38; 16.24; Мк 8.34; Лк 14.27"
                25 -> res = "Мф 16.26; Мк 8.36"
                26 -> res = "Мф 10.33; Мк 8.38; Лк 12.9; 2 Тим 2.12"
                28 -> res = "Мф 17.1; Мк 9.2"
                31 -> res = "Лк 22.37"
                32 -> res = "2 Пет 1.16"
                35 -> res = "Втор 18.15; Мф 3.17; 17.5"
                38 -> res = "Мф 17.14; Мк 9.17"
                44 -> res = "Мф 17.22; Мк 9.31"
                45 -> res = "Лк 2.50"
                46 -> res = "Мф 18.1; Мк 9.33"
                48 -> res = "Мф 10.40; 18.5; Мк 9.37; 1 Фес 4.8"
                49 -> res = "Мк 9.38"
                50 -> res = "Флп 1.18"
                51 -> res = "Мк 16.19; Деян 1.2"
                53 -> res = "Ин 4.9"
                54 -> res = "4 Цар 1.10, 12"
                56 -> res = "Мф 18.11; Ин 3.17"
                57 -> res = "Мф 8.19"
                60 -> res = "Мф 8.22"
            }
        }
        if (glava == 10) {
            when (stih) {
                2 -> res = "Мф 9.37; Ин 4.35"
                3 -> res = "Мф 10.16"
                4 -> res = "4 Цар 4.29; Мф 10.10"
                5 -> res = "Мф 10.12; Мк 6.10"
                7 -> res = "Втор 24.14; Мф 10.10; 1 Тим 5.18"
                11 -> res = "Мф 10.14; Деян 13.51"
                12 -> res = "Мф 11.24"
                13 -> res = "Ис 23.1; Иез 3.6; 26.2; Мф 11.21"
                16 -> res = "Чис 16.11; Мф 10.40; Лк 9.48; Ин 13.20"
                19 -> res = "Пс 90.13; 1 Ин 2.13"
                20 -> res = "Ис 4.3; Дан 12.1; Флп 4.3"
                21 -> res = "Ис 32.4; Мф 11.25; 1 Кор 1.21; 2 Кор 4.3"
                23 -> res = "Мф 13.16"
                24 -> res = "1 Пет 1.10"
                25 -> res = "Мф 22.35; Мк 12.28"
                27 -> res = "Лев 19.18; Втор 6.5; Мф 22.37; Мк 12.2"
                28 -> res = "Лев 18.5"
                31 -> res = "Деян 10.28"
                38 -> res = "Ин 11.1; 12.2"
            }
        }
        if (glava == 11) {
            when (stih) {
                2 -> res = "Мф 6.9"
                3 -> res = "Притч 30.8"
                4 -> res = "1 Пет 5.8; 2 Пет 2.9; 1 Кор 10.13"
                9 -> res = "Мф 7.7; 21.22; Мк 11.24; Ин 14.13; Иак 1.6"
                11 -> res = "Мф 7.9"
                13 -> res = "Евр 12.9"
                14 -> res = "Мф 9.32; 12.22"
                15 -> res = "Мф 9.34; 12.24; Мк 3.22"
                16 -> res = "1 Кор 1.22"
                17 -> res = "Мф 12.25; Мк 3.24"
                20 -> res = "Исх 8.19; Дан 2.44"
                24 -> res = "Мф 12.43"
                26 -> res = "2 Пет 2.20; Евр 6.4; 10.26"
                27 -> res = "Лк 1.48"
                29 -> res = "Иона 2.1; Мф 12.39"
                31 -> res = "3 Цар 10.1, 4; 2 Пар 9.1; Мф 12.42"
                32 -> res = "Иона 3.5; Мф 12.41"
                33 -> res = "Мф 5.15; Мк 4.21"
                34 -> res = "Мф 6.22"
                38 -> res = "Мк 7.3"
                39 -> res = "Мф 23.25"
                41 -> res = "Ис 58.7; Дан 4.24"
                42 -> res = "Мф 23.23"
                43 -> res = "Мф 23.6-7; Мк 12.38-39; Лк 20.46"
                46 -> res = "Мф 23.4; Деян 15.10"
                49 -> res = "2 Пар 36.15; Неем 9.26; Мф 23.34"
                51 -> res = "Быт 4.8; 2 Пар 24.21; Мф 23.35"
                52 -> res = "Мф 23.13"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Мф 16.6; Мк 8.15"
                2 -> res = "Мф 10.26; Мк 4.22; Лк 8.17"
                4 -> res = "Ис 8.12; 51.7; Иер 1.8; Мф 10.28"
                6 -> res = "Мф 10.29"
                7 -> res = "Лк 21.18"
                8 -> res = "Мф 10.32"
                9 -> res = "Мк 8.38; Лк 9.26; 2 Тим 2.12"
                10 -> res = "Мф 12.31; Мк 3.28; 1 Ин 5.16"
                11 -> res = "Мф 10.19; Мк 13.11"
                15 -> res = "Мк 4.19; 1 Тим 6.9"
                19 -> res = "Сир 11.17; 1 Кор 15.32"
                20 -> res = "Иов 20.22; Пс 38.7; Иер 17.11"
                21 -> res = "Мф 6.20; 1 Тим 6.19"
                22 -> res = "Пс 54.23; Мф 6.25; 1 Пет 5.7"
                24 -> res = "Пс 103.27-28"
                31 -> res = "Мф 6.33; Мк 10.30"
                33 -> res = "Мф 6.2"
                35 -> res = "1 Пет 1.13; Еф 3.16"
                39 -> res = "Мф 24.43; 2 Пет 3.10; 1 Фес 5.2; Откр 16.15"
                42 -> res = "Мф 24.45"
                47 -> res = "Ин 15.22"
                50 -> res = "Мф 20.22"
                51 -> res = "Мф 10.34"
                53 -> res = "Мих 7.6"
                54 -> res = "Мф 16.2"
                58 -> res = "Мф 5.25"
            }
        }
        if (glava == 13) {
            when (stih) {
                6 -> res = "Ис 5.2"
                7 -> res = "Мф 21.19"
                14 -> res = "Исх 20.9"
                18 -> res = "Мф 13.31; Мк 4.30"
                20 -> res = "Мф 13.33"
                22 -> res = "Мф 9.35; Мк 6.6"
                24 -> res = "Мф 7.13"
                25 -> res = "Мф 7.23; 25.10; Лк 6.46"
                27 -> res = "Пс 6.9; Мф 25.41; 1 Кор 8.3; 2 Тим 2.19"
                29 -> res = "Быт 28.14; Ис 2.3; 49.6; 60.3; Мал 1.11"
                30 -> res = "Мф 19.30; Мк 10.31; Деян 10.45; 28.28"
                34 -> res = "Мф 23.37"
            }
        }
        if (glava == 14) {
            when (stih) {
                8 -> res = "Притч 25.6"
                11 -> res = "Мф 23.12; Лк 18.14"
                12 -> res = "Тов 4.7; Притч 3.27-2"
                16 -> res = "Притч 9.1-2; Мф 22.2; Откр 19.9"
                21 -> res = "Мф 5.3; 1 Кор 1.27-28"
                24 -> res = "Мф 22.8"
                26 -> res = "Мф 10.37"
                27 -> res = "Мф 10.38; 16.24; Мк 8.34; Лк 9.23; 2 Тим 3.12"
                34 -> res = "Мф 5.13; Мк 9.50"
            }
        }
        if (glava == 15) {
            when (stih) {
                4 -> res = "Мф 18.12"
                24 -> res = "Еф 2.1; 5.14; Кол 2.13; Откр 3.1"
            }
        }
        if (glava == 16) {
            when (stih) {
                9 -> res = "Мф 6.19; 19.21"
                10 -> res = "Мф 25.21"
                13 -> res = "Мф 6.24"
                14 -> res = "1 Тим 6.10"
                15 -> res = "1 Цар 16.7; Иер 11.20"
                16 -> res = "Мф 11.12"
                17 -> res = "Ис 40.8"
                18 -> res = "Втор 24.1; Мф 19.9"
                25 -> res = "Иов 21.7, 13"
                29 -> res = "Ин 5.39, 45"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Мф 18.6; Мк 9.42"
                3 -> res = "Лев 19.17; Мф 18.15; Иак 5.19"
                6 -> res = "Мф 17.20; 21.21; Мк 11.23"
                10 -> res = "Иов 22.3; 35.7; 1 Кор 9.16"
                11 -> res = "Ин 4.4"
                12 -> res = "Лев 13.46"
                14 -> res = "Лев 14.2; Мф 8.4; Мк 1.44; Лк 5.14"
                23 -> res = "Мф 24.23; Мк 13.21"
                25 -> res = "Мф 16.21; 17.22; 20.18; Мк 8.31"
                26 -> res = "Быт 7.7; Мф 24.37; 1 Пет 3.20"
                28 -> res = "Быт 19.14, 24"
                32 -> res = "Быт 19.26; Прем 10.7"
                33 -> res = "Мф 10.39; Мк 8.35; Лк 9.24; Ин 12.25"
                35 -> res = "Мф 24.41"
                37 -> res = "Мф 24.28"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "Рим 12.12; Еф 6.18; 1 Фес 5.17"
                7 -> res = "Пс 9.19; Лк 11.9; Откр 6.10"
                9 -> res = "Лк 16.15"
                11 -> res = "Ис 58.3; Откр 3.17"
                14 -> res = "Иов 22.29; Притч 29.23; Мф 23.12; Лк 14.11"
                15 -> res = "Мф 19.13; Мк 10.13"
                16 -> res = "Мф 18.3; 19.14; 1 Пет 2.2; 1 Кор 14.20"
                18 -> res = "Мф 19.16; Мк 10.17"
                20 -> res = "Исх 20.12-16; Втор 5.17"
                22 -> res = "1 Тим 6.18-19"
                24 -> res = "Притч 11.28; Мф 19.23; Мк 10.23; 1 Тим 6.9-10"
                28 -> res = "Мф 19.27; Мк 10.28"
                31 -> res = "Пс 21.7; Мф 20.18; Мк 10.33"
                32 -> res = "Ис 53.7"
                35 -> res = "Мф 20.29; Мк 10.46"
            }
        }
        if (glava == 19) {
            when (stih) {
                8 -> res = "Исх 22.1"
                10 -> res = "Мф 18.11"
                12 -> res = "Мф 25.14"
                17 -> res = "Лк 16.10"
                22 -> res = "Иов 15.6; Мф 12.37"
                26 -> res = "Мф 13.12; 25.29; Мк 4.25; Лк 8.18"
                27 -> res = "Мф 22.7"
                29 -> res = "Мф 21.1; Мк 11.1"
                35 -> res = "Мф 21.7; Мк 11.7; Ин 12.14"
                38 -> res = "Пс 117.26; Лк 2.14; Еф 2.14"
                40 -> res = "Авв 2.11"
                43 -> res = "Ис 29.3; Иер 6.6; Иез 21.22; Мф 22.7; Лк 21.6"
                45 -> res = "Мф 21.12; Мк 11.15; Ин 2.15"
                46 -> res = "Ис 56.7; Иер 7.11; 3 Цар 8.29"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "Мф 21.23; Мк 11.27"
                6 -> res = "Мф 14.5"
                9 -> res = "Ис 5.1; Иер 2.21; Мф 21.33; Мк 12.1"
                14 -> res = "Евр 1.2"
                15 -> res = "Евр 13.12"
                17 -> res = "Пс 117.22; Ис 28.16; Мф 21.42; Мк 12.10; Деян 4.11; 1 Пет 2.6; Рим 9.33"
                20 -> res = "Мф 22.15; Мк 12.13"
                25 -> res = "Мф 17.27; 22.21; Рим 13."
                27 -> res = "Мф 22.23; Мк 12.18; Деян 23.8"
                28 -> res = "Втор 25.5"
                37 -> res = "Исх 3.6, 16; Мф 22.32; Мк 12.26"
                40 -> res = "Мф 22.42; Мк 12.35"
                42 -> res = "Мф 22.44"
                43 -> res = "Пс 109.1"
                46 -> res = "Мф 23.6; Мк 12.38-39; Лк 11.43"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "Мк 12.41"
                3 -> res = "2 Кор 8.12"
                5 -> res = "Мф 24.1; Мк 13.1"
                6 -> res = "3 Цар 9.7; Лк 19.44"
                8 -> res = "Мф 24.4; Мк 13.5; 1 Ин 4.1; Еф 5.6; 2 Фес 2.3"
                10 -> res = "Ис 19.2"
                12 -> res = "Мф 10.17; 24.9; Мк 13.9; Ин 15.20"
                14 -> res = "Лк 12.11"
                15 -> res = "Исх 4.12; Деян 6.10"
                16 -> res = "Мих 7.6"
                19 -> res = "Мф 10.22"
                20 -> res = "Дан 9.27; Мф 24.15; Мк 13.14"
                22 -> res = "Зах 14.1"
                25 -> res = "Ис 13.10; Иез 32.7; Иоил 2.31; 3.15; Ам 5.20; 8.9; Соф 1.15; Мф 24.29; Мк 13.24"
                27 -> res = "Дан 7.10; Мк 13.26"
                28 -> res = "Рим 8.23"
                33 -> res = "Пс 101.27; Ис 51.6; Мф 24.35"
                34 -> res = "1 Пет 4.7; Рим 13.13; 1 Фес 5.6"
                35 -> res = "Ис 24.17"
                36 -> res = "Мф 24.42; 25.13; Мк 13.33"
                37 -> res = "Ин 8.2"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "Мф 26.2; Мк 14.1-2"
                3 -> res = "Мф 26.14"
                7 -> res = "Втор 16.1; Мф 26.17; Мк 14.12"
                14 -> res = "Мф 26.20; Мк 14.18; Ин 13.12"
                16 -> res = "Деян 10.41"
                19 -> res = "Мф 26.26; Мк 14.22; 1 Кор 11.24"
                21 -> res = "Пс 40.10; Мф 26.22-23"
                22 -> res = "Деян 2.23; 4.28"
                27 -> res = "Флп 2.7"
                30 -> res = "Мф 19.28; 1 Кор 6.2; Откр 3.21; 20.4"
                31 -> res = "1 Пет 5.8"
                32 -> res = "Мф 16.18; Ин 17.15"
                34 -> res = "Мф 26.34; Мк 14.30; Ин 13.38"
                35 -> res = "Мф 10.9-10; Мк 6.8; Лк 9.3; 10.4"
                37 -> res = "Ис 53.12; Мк 15.28"
                39 -> res = "Мф 26.36; Мк 14.32; Ин 18.1"
                40 -> res = "Мф 26.41; Мк 14.38"
                47 -> res = "Мф 26.47; Мк 14.43; Ин 18.3"
                54 -> res = "Мф 26.57; Мк 14.53; Ин 18.24"
                61 -> res = "Мф 26.34; Мк 14.30, 72; Ин 13.38"
                63 -> res = "Мф 26.67; Мк 14.65"
                66 -> res = "Пс 2.2; Мф 27.2; Мк 15.1; Ин 18.28"
                69 -> res = "Пс 109.1; Дан 7.13; Мф 26.64; Мк 14.62; Ин 6.62"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "Мф 27.2; Мк 15.1; Ин 18.28"
                2 -> res = "Мф 22.21"
                3 -> res = "Мф 27.11; Мк 15.2; Ин 18.33; 1 Тим 6.13; Откр 1.5"
                8 -> res = "Лк 9.9"
                11 -> res = "Ис 53.3"
                14 -> res = "Мф 27.23; Мк 15.14; Ин 18.38; 19.4"
                18 -> res = "Мф 27.20; Мк 15.11; Ин 18.40; Деян 3.14"
                30 -> res = "Ис 2.19; Ос 10.8; Откр 6.16; 9.6"
                33 -> res = "Мф 27.33; Мк 15.22; Ин 19.17"
                34 -> res = "Пс 21.19; Мф 5.44; 27.35; Мк 15.24; Ин 19.23"
                42 -> res = "Мф 16.28"
                44 -> res = "Ам 8.9"
                46 -> res = "Пс 30.6"
                50 -> res = "Мф 27.57; Мк 15.43; Ин 19.38"
                56 -> res = "Исх 20.10"
            }
        }
        if (glava == 24) {
            when (stih) {
                1 -> res = "Мф 28.1; Мк 16.1; Ин 20.1"
                6 -> res = "Мф 17.22"
                7 -> res = "Мк 9.31; Лк 9.22"
                12 -> res = "Ин 20.6"
                13 -> res = "Мк 16.12"
                19 -> res = "Мф 21.11; Лк 7.16; Ин 3.2; 6.14; Деян 2.22"
                21 -> res = "Лк 2.25; Деян 26.6"
                25 -> res = "Быт 3.15; 22.18; 49.10-11; Чис 21.9; Пс 21.7; 68.10; 21.27; Ис 50.6; 53.3"
                26 -> res = "Пс 15.8-10; Ис 40.10; Иер 23.5; 33.15; Иез 34.23; 37.24; Дан 9.24; Мих 7.20"
                36 -> res = "Мк 16.14; Ин 20.19; Деян 13.31; 1 Кор 15.5"
                44 -> res = "Мф 16.21"
                45 -> res = "Ин 5.39"
                46 -> res = "Ис 53.4; Лк 24.27"
                49 -> res = "Ин 14.16; 15.26; Деян 1.4, 8"
                51 -> res = "Мк 16.19; Деян 1.9"
            }
        }
        return res
    }

    fun kniga54(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Притч 8.22; 1 Ин 1.1-2"
                3 -> res = "Быт 1.3; Пс 32.6"
                5 -> res = "Ин 3.19"
                6 -> res = "Мф 3.1"
                9 -> res = "Ис 60.1"
                11 -> res = "Мф 15.24"
                12 -> res = "Рим 8.15; Гал 3.26"
                13 -> res = "Ин 3.5"
                14 -> res = "Мф 1.16; 17.2; Ин 17.24; 2 Кор 3.9; Евр 2.11"
                15 -> res = "Мф 3.11"
                16 -> res = "Еф 1.6; Кол 1.19"
                17 -> res = "Исх 20.1; Рим 3.24"
                18 -> res = "Исх 33.20; 1 Ин 4.12; 1 Тим 6.16"
                19 -> res = "Ин 5.33"
                20 -> res = "Ин 3.28; Деян 13.25"
                23 -> res = "Ис 40.3; Мф 3.3; Мк 1.3; Лк 3.4"
                29 -> res = "Исх 12.3; Ис 53.7"
                31 -> res = "Мк 1.4"
                32 -> res = "Мф 3.16; Мк 1.10; Лк 3.22; Ин 6.27"
                42 -> res = "Мф 16.18"
                45 -> res = "Быт 49.10; Втор 18.15; Пс 39.8; Ис 4.2; 7.14; 9.6; 40.11; 45.8; 53.1; Иер 23.5; 33.14; Иез 34.23; 37.24; Дан 9.24; Мих 5.2; Зах 9.9"
                51 -> res = "Быт 28.12"
            }
        }
        if (glava == 2) {
            when (stih) {
                13 -> res = "Втор 16.1"
                14 -> res = "Мф 21.12; Мк 11.15; Лк 19.45"
                17 -> res = "Пс 68.10"
                19 -> res = "Мф 26.61; 27.40; Мк 14.58; 15.29"
                22 -> res = "Пс 15.8; Ис 55.3; Мф 17.23; Деян 2.25; 13.34"
                24 -> res = "Мф 9.4; Мк 2.8"
                25 -> res = "Пс 7.10; Иер 11.20; Ин 6.64"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Ин 7.50; 19.39"
                3 -> res = "Иак 1.18; 1 Пет 1.23; 2 Кор 5.17; Гал 6.15; Тит 3.5"
                6 -> res = "Рим 8.5"
                8 -> res = "Кол 3.3"
                13 -> res = "Притч 30.4; Ин 6.62"
                14 -> res = "Чис 21.9; Ин 12.32"
                16 -> res = "Ис 9.6; Мк 16.16; Ин 6.40; 1 Ин 4.9-10"
                19 -> res = "Ин 1.5; 8.12"
                26 -> res = "Ин 1.27"
                27 -> res = "Ин 6.65"
                28 -> res = "Ин 1.20; Деян 13.25"
                29 -> res = "Мф 22.2; Еф 5.25, 27"
                31 -> res = "Ин 8.23; Рим 9.5; Еф 1.21"
                32 -> res = "Ин 8.26"
                33 -> res = "1 Ин 5.10; Рим 3.4"
                34 -> res = "Ин 1.16; Еф 4.7"
                35 -> res = "Дан 7.14; Мф 28.18"
                36 -> res = "Авв 2.4"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Ин 3.26"
                5 -> res = "Быт 33.19; 48.22; Нав 24.32"
                9 -> res = "4 Цар 17.24; Лк 9.53"
                10 -> res = "Ис 12.3; 44.3; Зах 14.8"
                20 -> res = "Втор 12.6; 16.6; 3 Цар 9.3"
                22 -> res = "Быт 12.3; 4 Цар 17.29; Ис 2.3; Рим 9.5"
                24 -> res = "2 Кор 3.17; Флп 3.3"
                35 -> res = "Мф 9.37; Лк 10.2"
                43 -> res = "Мф 4.12; Мк 1.14"
                44 -> res = "Мф 13.57; Мк 6.4; Лк 4.24"
                46 -> res = "Ин 2.11"
            }
        }
        if (glava == 5) {
            when (stih) {
                10 -> res = "Иер 17.22"
                17 -> res = "Ин 9.4; 14.10"
                18 -> res = "Ин 7.30"
                22 -> res = "Мф 28.18; Деян 17.31; 1 Пет 4.5"
                23 -> res = "1 Ин 2.23"
                27 -> res = "Дан 7.14"
                28 -> res = "Ис 26.19; Дан 12.2; 1 Кор 15.52"
                29 -> res = "Мф 25.46; Откр 14.11"
                30 -> res = "Мф 26.39"
                32 -> res = "Мф 3.17"
                33 -> res = "Ин 1.19"
                36 -> res = "Ин 10.25"
                37 -> res = "Втор 4.12; Мф 3.17"
                39 -> res = "Втор 18.15; Ис 9.6; 53.1"
                40 -> res = "Ин 1.11; 3.19"
                44 -> res = "Ин 12.43"
                46 -> res = "Быт 3.15; 12.3; 18.18; 49.10; Втор 18.15"
            }
        }
        if (glava == 6) {
            when (stih) {
                4 -> res = "Исх 12.18"
                5 -> res = "Мф 14.16; Мк 6.35-36; Лк 9.12"
                13 -> res = "Мк 8.19"
                14 -> res = "Втор 18.15; Мф 11.3"
                17 -> res = "Мф 14.22; Мк 6.47"
                27 -> res = "Мф 3.17; Ин 1.32; 10.36"
                29 -> res = "Ин 17.3; 1 Ин 3.23"
                31 -> res = "Пс 77.24; Исх 16.14-15; Чис 11.7; Прем 16.20; 1 Кор 10.3"
                35 -> res = "Ин 4.14; 7.37"
                38 -> res = "Мф 26.39; Ин 8.29"
                39 -> res = "Ин 10.28"
                42 -> res = "Мф 13.55"
                45 -> res = "Ис 54.13; Иер 31.34"
                46 -> res = "Мф 11.27"
                49 -> res = "Ин 6.31"
                53 -> res = "Мф 26.26"
                62 -> res = "Мф 26.64; Ин 3.13; Еф 4.8"
                63 -> res = "Рим 8.2; 2 Кор 3.6"
                64 -> res = "Мк 2.8; Ин 2.24"
                65 -> res = "Ин 3.27"
                69 -> res = "Мф 16.16; Мк 8.29; Лк 9.20"
                70 -> res = "Лк 6.13"
            }
        }
        if (glava == 7) {
            when (stih) {
                2 -> res = "Лев 23.34"
                7 -> res = "Ин 3.19"
                12, 43 -> res = "Ин 9.16"
                13 -> res = "Ин 12.42"
                16 -> res = "Ин 8.28; 12.49; 14.24"
                17 -> res = "Ин 8.47"
                19 -> res = "Исх 20.1; Ин 5.18"
                22 -> res = "Быт 17.10; Лев 12.3"
                24 -> res = "Втор 1.17; 16.19"
                27 -> res = "Мф 13.55"
                28 -> res = "Ин 8.42"
                30 -> res = "Ин 8.20"
                31 -> res = "Ин 8.30"
                34 -> res = "Ин 13.33"
                37 -> res = "Лев 23.36; Ин 4.14; Откр 22.17"
                38 -> res = "Ис 12.3; Иоил 3.18"
                39 -> res = "Ис 44.3; Иоил 2.28; Зах 12.10; Деян 2.17, 33"
                40 -> res = "Мф 26.5"
                42 -> res = "Мих 5.2; Мф 2.6; Лк 2.4"
                50 -> res = "Ин 3.1"
                51 -> res = "Втор 1.17; 17.8"
            }
        }
        if (glava == 8) {
            when (stih) {
                5 -> res = "Лев 20.10; Втор 22.22"
                12 -> res = "Ин 1.5; 9.5; 1 Ин 1.5"
                17 -> res = "Втор 19.15; 17.6; Мф 18.16; 2 Кор 13.1; Евр 10.28"
                18 -> res = "Ис 42.1; Ин 5.32"
                21 -> res = "Ин 13.33"
                23 -> res = "Ин 3.31; Кол 3.1"
                28 -> res = "Ин 7.16; 12.32"
                32 -> res = "Ис 42.7; 61.1; Рим 6.14"
                34 -> res = "2 Пет 2.19; Рим 6.16"
                35 -> res = "Быт 21.10"
                39 -> res = "Рим 4.16"
                44 -> res = "1 Ин 3.8"
                47 -> res = "Ин 10.27; 1 Ин 4.6"
                54 -> res = "Ин 16.14; Деян 3.13"
                56 -> res = "Быт 15.6; 22.16"
            }
        }
        if (glava == 9) {
            when (stih) {
                4 -> res = "Ин 4.34; 12.35"
                5 -> res = "Ис 42.6; Ин 1.5; 8.12"
                6 -> res = "Ин 11.37"
                7 -> res = "Неем 3.15"
                16 -> res = "Ин 7.43"
                17 -> res = "Лк 7.16; Ин 4.19"
                22 -> res = "Ин 12.42"
                29 -> res = "Исх 3.6"
                31 -> res = "Притч 15.29; Ис 1.15; Мих 3.4"
                32 -> res = "Ис 42.7"
                39 -> res = "Мф 11.25; 2 Кор 3.14"
                41 -> res = "Ин 15.22"
            }
        }
        if (glava == 10) {
            when (stih) {
                8 -> res = "Иер 23.1; 50.6; Иез 34.2"
                9 -> res = "Пс 22.2"
                11 -> res = "Пс 22.1; Ис 40.11; Иез 34.13; 37.24; 1 Пет 2.25; 5.4"
                14 -> res = "Иез 34.11; 2 Тим 2.19"
                16 -> res = "Иез 37.22"
                17 -> res = "Ис 53.11"
                18 -> res = "Ин 2.19; 14.31"
                20 -> res = "Мк 3.21; Ин 7.20"
                22 -> res = "1 Мак 4.59"
                25 -> res = "Ин 5.36"
                26 -> res = "Ин 8.19; 1 Ин 4.6"
                29 -> res = "Втор 33.3"
                31 -> res = "Ин 5.18"
                34 -> res = "Пс 81.6"
                36 -> res = "Ин 6.27"
                38 -> res = "Ин 14.10; 17.21"
                40 -> res = "Ин 1.28"
                41 -> res = "Ин 5.33"
            }
        }
        if (glava == 11) {
            when (stih) {
                2 -> res = "Мф 26.7; Мк 14.3; Ин 12.3"
                4 -> res = "Ин 9.3"
                8 -> res = "Ин 10.31"
                9 -> res = "Ин 9.4"
                10 -> res = "Ин 12.35"
                24 -> res = "Иов 19.25-26; Ис 26.19; Иез 37.4; Дан 12.2"
                26 -> res = "Ин 6.54"
                27 -> res = "Мф 16.16"
                37 -> res = "Ин 9.6"
                47 -> res = "Мф 26.3; Мк 14.1"
                50 -> res = "Ин 18.14"
                52 -> res = "Ин 10.16; Еф 2.13"
                53 -> res = "Мф 21.38"
                55 -> res = "2 Пар 30.17"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Мф 26.6; Мк 14.3; Ин 11.2"
                2 -> res = "Лк 10.40"
                6 -> res = "Ин 13.29"
                8 -> res = "Втор 15.11"
                13 -> res = "Мф 21.8; Мк 11.8; Лк 19.36"
                15 -> res = "Зах 9.9; Ис 62.11; Мф 21.5"
                25 -> res = "Мф 10.39; Мк 8.35; Лк 9.24; 14.27"
                26 -> res = "Ин 17.24"
                27 -> res = "Мф 26.38; Евр 5.7"
                31 -> res = "Ин 14.30; 16.11"
                32 -> res = "Ин 3.14"
                34 -> res = "2 Цар 7.13; Пс 88.37; Ис 9.7; Иез 37.25; Дан 2.44; 7.14; Мих 5.2; Лк 1.33"
                38 -> res = "Ис 53.1; Рим 10.16"
                40 -> res = "Ис 6.9-10; Мф 13.14; Мк 4.12; Лк 8.10; Деян 28.26; Рим 11.8"
                43 -> res = "Ин 5.44"
                46 -> res = "Ин 3.19"
                47 -> res = "Ин 3.17"
                48 -> res = "Мк 16.16"
                49 -> res = "Ин 14.10"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Мф 26.2; Мк 14.1"
                3 -> res = "Мф 11.27; 28.18"
                4 -> res = "Лк 17.8; 22.27"
                10 -> res = "Ин 15.3"
                13 -> res = "1 Кор 8.6; 12.3; Флп 2.11"
                16 -> res = "Мф 10.24; Лк 6.40; Ин 15.20"
                18 -> res = "Пс 40.10; Деян 1.16"
                19 -> res = "Ин 14.29"
                20 -> res = "Мф 10.40; Лк 10.16"
                21 -> res = "Мф 26.21; Мк 14.18; Лк 22.21"
                23 -> res = "Ин 21.20"
                31 -> res = "Ин 12.23"
                33 -> res = "Ин 7.34; 8.21"
                34 -> res = "Ин 15.12; 1 Ин 3.11; 1 Фес 4.9"
                38 -> res = "Мф 26.34; Мк 14.30; Лк 22.34"
            }
        }
        if (glava == 14) {
            when (stih) {
                3 -> res = "Ин 17.24; 1 Фес 4.17"
                6 -> res = "Ис 35.8; Ин 1.14, 17; 6.33, 40; 8.32; 10.28; 11.25; 1 Ин 5.20; Еф 1.13"
                13 -> res = "Мф 7.7; Мк 11.24; Лк 11.9; Ин 15.7; 16.23; Иак 1.6"
                17 -> res = "Ин 16.13; 1 Кор 2.14"
                19 -> res = "Ин 11.25; 1 Фес 4.14"
                23 -> res = "Зах 2.10; 1 Кор 3.16; Откр 3.20"
                24 -> res = "Ин 12.49"
                26 -> res = "Ин 15.26"
                27 -> res = "Флп 4.7"
                30 -> res = "Ин 12.31; 16.11"
                31 -> res = "Ин 10.18; Евр 10.7"
            }
        }
        if (glava == 15) {
            when (stih) {
                2 -> res = "Мф 15.13; Гал 5.22"
                3 -> res = "Ин 13.10; 1 Ин 2.7"
                5 -> res = "Деян 4.12"
                6 -> res = "Иез 15.4; Мф 3.10; 7.19"
                7 -> res = "Ин 14.13; 16.23; 1 Ин 3.22"
                12 -> res = "Ин 13.34; 1 Ин 3.11; 4.21; Еф 5.2; 1 Фес 4.9"
                15 -> res = "Еф 1.9; 3.5"
                16 -> res = "Мк 16.15"
                18 -> res = "1 Ин 3.13"
                20 -> res = "Мф 10.24; 24.9; Мк 13.9; Лк 21.12; Ин 13.16"
                21 -> res = "Ин 16.3"
                25 -> res = "Пс 68.5; 34.19"
                26 -> res = "Лк 24.49; Ин 14.26"
                27 -> res = "Деян 1.8; 2.32; 1 Пет 5.1"
            }
        }
        if (glava == 16) {
            when (stih) {
                3 -> res = "Ин 15.21"
                4 -> res = "Мф 9.15; Ин 14.29"
                5 -> res = "Ин 7.33"
                7 -> res = "Ин 15.26"
                11 -> res = "Ин 12.31; 14.30; Кол 2.15"
                13 -> res = "Мф 10.19"
                15 -> res = "Ин 17.10"
                22 -> res = "Лк 24.41, 52; Ин 20.20; 1 Пет 1.8"
                23 -> res = "Мф 7.7; Мк 11.24; Лк 11.9; Ин 14.13; 15.7; Иак 1.6"
                26 -> res = "Рим 8.34"
                27 -> res = "Ин 17.25"
                32 -> res = "Мф 26.31; Мк 14.27"
                33 -> res = "1 Ин 4.4; 5.4; 1 Кор 15.57"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Ин 12.23"
                2 -> res = "Дан 7.14; Мф 28.18; Евр 2.5-8"
                3 -> res = "Ин 6.29; 1 Ин 3.23"
                5 -> res = "Откр 5.12"
                6 -> res = "Ин 18.9"
                8 -> res = "Ин 16.27"
                10 -> res = "Ин 16.15"
                11 -> res = "Ин 10.30; Еф 4.3"
                12 -> res = "Пс 108.8; Ин 18.9"
                14 -> res = "Ин 8.23"
                17 -> res = "Пс 118.142; Ин 14.6"
                18 -> res = "Ис 61.1"
                19 -> res = "Евр 9.14"
                21 -> res = "Ин 17.11"
                24 -> res = "Ин 12.26"
                26 -> res = "Ин 15.15"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "Мф 26.36"
                3 -> res = "Мф 26.47; Мк 14.43; Лк 22.47; Деян 1.16"
                9 -> res = "Ин 17.6, 12"
                10 -> res = "Мф 26.51"
                13, 24 -> res = "Мф 26.57; Мк 14.53; Лк 22.54"
                14 -> res = "Ин 11.50"
                17 -> res = "Мф 26.69; Мк 14.66; Лк 22.56"
                28 -> res = "Мф 27.2; Мк 15.1; Лк 22.6"
                32 -> res = "Мф 20.19"
                33 -> res = "Мф 27.11; Мк 15.2; Лк 23.3"
                36 -> res = "Дан 2.44"
                37 -> res = "1 Тим 6.13"
                39 -> res = "Мф 27.15; Мк 15.6; Лк 23.17"
                40 -> res = "Деян 3.14"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "Мф 27.26; Мк 15.15"
                4 -> res = "Ин 18.38; Деян 3.13"
                6 -> res = "Мф 27.23; Мк 15.14; Лк 23.4; Деян 13.28"
                7 -> res = "Втор 18.20"
                9 -> res = "Ис 53.7; Ин 18.33"
                11 -> res = "Лк 22.53"
                17 -> res = "Мф 27.33; Мк 15.22; Лк 23.33; Евр 13.12"
                23 -> res = "Мф 27.35; Мк 15.24; Лк 23.34"
                24 -> res = "Пс 21.19"
                25 -> res = "Лк 2.35"
                28 -> res = "Пс 68.22; Мф 27.48"
                31 -> res = "Втор 21.23"
                36 -> res = "Исх 12.46; Чис 9.12"
                37 -> res = "Зах 12.10; Откр 1.7"
                38 -> res = "Мф 27.57; Мк 15.43; Лк 23.50"
                39 -> res = "Ин 3.2; 7.50"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "Мф 28.1; Мк 16.1; Лк 24.1"
                6 -> res = "Лк 24.12"
                9 -> res = "Пс 15.10; Ис 53.11; Иона 2.1"
                11 -> res = "Мф 28.1; Мк 16.5"
                14 -> res = "Мф 28.9; Мк 16.9"
                17 -> res = "Пс 21.23; Мф 28.10; Рим 8.29; Евр 2.11"
                19 -> res = "Мк 16.14; Лк 24.36; Деян 13.31; 1 Кор 15.5, 7"
                20 -> res = "Ин 16.22"
                21 -> res = "Ин 17.18"
                23 -> res = "Мф 16.19; 18.18"
                25 -> res = "Ин 19.34"
                29 -> res = "1 Пет 1.8; 2 Кор 5.7"
                30 -> res = "Ин 21.25"
                31 -> res = "Ин 3.15; Рим 15.4"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "Мф 28.7"
                4 -> res = "Лк 24.16"
                13 -> res = "Деян 10.41"
                16 -> res = "Деян 20.28; 1 Пет 5.2"
                18 -> res = "2 Пет 1.14"
                20 -> res = "Ин 13.23"
                24 -> res = "Ин 19.35"
                25 -> res = "Ин 20.30"
            }
        }
        return res
    }

    fun kniga55(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Лк 1.3"
                2 -> res = "Мк 16.15; Ин 20.21"
                3 -> res = "Мф 28.7; Мк 16.14"
                4 -> res = "Лк 24.49; Ин 14.26"
                5 -> res = "Мф 3.11; Мк 1.8"
                6 -> res = "Дан 7.18, 27; Ам 9.11"
                8 -> res = "Лк 24.49; Деян 2.32"
                9 -> res = "Мк 16.19; Лк 24.51"
                11 -> res = "Дан 7.13; Мф 25.31; 26.64; 1 Фес 1.10; Откр 1.7"
                13 -> res = "Мф 10.2"
                16 -> res = "Пс 40.10; Ин 13.18; 18.3"
                18 -> res = "Мф 27.5"
                20 -> res = "Пс 68.26; 108.8"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Лев 23.16; Втор 16.9"
                2 -> res = "Мф 3.11; Деян 1.5; 11.15; 19.6"
                4 -> res = "Мк 16.17; 1 Кор 12.10, 28"
                17 -> res = "Ис 44.3; Зах 12.10; Ин 7.39; Деян 11.28; 16.9; 21.9"
                21 -> res = "Иоил 2.28-32; Рим 10.13"
                24 -> res = "Ин 10.18; Деян 3.15; 4.10"
                28 -> res = "Пс 15.8-11"
                29 -> res = "3 Цар 2.10; Деян 13.36"
                30 -> res = "2 Цар 7.12; Пс 131.11; 2 Цар 7.19; 23.2; Лк 1.69"
                31 -> res = "Пс 15.10; Деян 13.37"
                32 -> res = "Ин 15.27; Деян 3.15"
                33 -> res = "Ин 14.16"
                34 -> res = "Мф 22.44"
                35 -> res = "Пс 109.1"
                36 -> res = "Мф 28.18"
                39 -> res = "Иер 31.34; Деян 3.25"
                44 -> res = "Деян 4.32"
                46 -> res = "Лк 24.53; Деян 20.11"
                47 -> res = "Деян 5.14; 11.21"
            }
        }
        if (glava == 3) {
            when (stih) {
                8 -> res = "Ис 35.6"
                11 -> res = "3 Цар 6.3"
                13 -> res = "Деян 5.31; Флп 2.9"
                14 -> res = "Мф 27.20; Мк 15.11; Лк 23.18; Ин 18.40"
                15 -> res = "Деян 2.24, 32; 5.32; 13.30; 17.31"
                17 -> res = "Лк 23.34; Ин 16.3; Деян 13.27"
                18 -> res = "Лк 24.27; Деян 26.22"
                20 -> res = "Ис 49.10"
                21 -> res = "Ос 2.23; 3.5; Ин 10.16"
                22 -> res = "Мф 17.5; Деян 7.37"
                23 -> res = "Втор 18.15, 18-19"
                25 -> res = "Быт 12.3; Деян 2.39; Рим 9.4; Гал 3.8"
                26 -> res = "Мф 10.6; Деян 13.46"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "Деян 23.6"
                6 -> res = "Лк 3.2"
                8 -> res = "Лк 12.12"
                11 -> res = "Пс 117.22; Ис 28.16; Мф 21.42; Мк 12.10; Лк 20.17; 1 Пет 2.6; Рим 9.33"
                12 -> res = "Деян 10.43; Кол 1.14, 20; 1 Фес 5.9; 1 Тим 2.5-6"
                18 -> res = "Деян 5.40"
                19 -> res = "Деян 5.29"
                26 -> res = "Пс 2.1-2"
                27 -> res = "Ис 61.1; Мф 26.3-4; Лк 1.35; 4.18; Ин 10.36"
                28 -> res = "Мф 26.24"
                29 -> res = "Деян 13.46"
                31 -> res = "Деян 16.26"
                32 -> res = "Деян 2.44"
            }
        }
        if (glava == 5) {
            when (stih) {
                3 -> res = "Чис 30.3; Еккл 5.3"
                12 -> res = "Деян 2.43; Рим 5.19"
                14 -> res = "Деян 2.47; 11.21"
                20 -> res = "Ин 6.68"
                28 -> res = "Мф 27.25; Деян 2.22; 3.13; 4.18"
                29 -> res = "Деян 4.19"
                30 -> res = "Деян 3.15"
                31 -> res = "Деян 2.33; 4.12; 1 Ин 2.1-2"
                32 -> res = "Ин 15.26-27; Деян 3.15"
                36 -> res = "Деян 21.38"
                37 -> res = "Лк 2.2"
                38 -> res = "Мф 15.13"
                39 -> res = "Лк 21.15"
                41 -> res = "Мф 5.10; Иак 1.2; 1 Пет 4.13; 2 Кор 6.10; 12.10; Евр 10.34"
            }
        }
        if (glava == 6) {
            when (stih) {
                5 -> res = "Деян 21.8"
                6 -> res = "Деян 13.3; 1 Тим 4.14"
                10 -> res = "Лк 21.15"
                14 -> res = "Дан 9.26-27"
            }
        }
        if (glava == 7) {
            when (stih) {
                3 -> res = "Быт 12.1; Неем 9.7"
                6 -> res = "Быт 15.13; Исх 12.40; Гал 3.17"
                8 -> res = "Быт 17.10; 21.4; 25.26; 29.31; 35.22"
                9 -> res = "Быт 37.28; Пс 104.17"
                10 -> res = "Быт 41.38, 41"
                12 -> res = "Быт 42.1"
                13 -> res = "Быт 45.4"
                14 -> res = "Быт 46.27"
                15 -> res = "Быт 46.5; 49.33"
                16 -> res = "Быт 23.16; 50.13; Нав 24.32"
                17 -> res = "Исх 1.7; Пс 104.24"
                20 -> res = "Исх 2.2; Евр 11.23"
                21 -> res = "Исх 2.5, 10"
                24 -> res = "Исх 2.12"
                26 -> res = "Исх 2.13"
                30 -> res = "Исх 3.2"
                35 -> res = "Исх 3.10"
                36 -> res = "Исх 7; Исх 8; Исх 9; Исх 10; Исх 11; Исх 14"
                37 -> res = "Втор 18.15; Деян 3.22"
                38 -> res = "Исх 19.3; Гал 3.19"
                40 -> res = "Исх 32.1"
                42 -> res = "Втор 4.19; Иер 19.13"
                43 -> res = "Ам 5.25-27"
                44 -> res = "Исх 25.40; Евр 8.5"
                45 -> res = "Нав 3.14"
                46 -> res = "2 Цар 7.2; Пс 131.5"
                47 -> res = "3 Цар 6.1"
                48 -> res = "3 Цар 8.27; Деян 17.24"
                50 -> res = "Ис 66.1-2"
                51 -> res = "Втор 9.13; Иер 6.10; Иез 44.9"
                52 -> res = "Мф 23.34; 1 Фес 2.15"
                53 -> res = "Втор 33.2; Гал 3.19"
                55 -> res = "Деян 6.5, 10"
                58 -> res = "Деян 22.20"
                59 -> res = "Пс 30.6; Лк 23.46"
                60 -> res = "Мф 5.44; Лк 23.34; 1 Кор 4.12"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Деян 11.19"
                3 -> res = "Деян 9.1; 22.4; 26.10; 1 Кор 15.9; Гал 1.13"
                7 -> res = "Мк 16.17"
                12 -> res = "Деян 6.5"
                17 -> res = "Деян 6.6"
                20 -> res = "Мф 10.8"
                23 -> res = "Втор 29.18"
                27 -> res = "3 Цар 8.41"
                33 -> res = "Ис 53.7-8"
                37 -> res = "Мк 16.16"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Деян 8.3; 22.4; Гал 1.13; 1 Тим 1.13"
                3 -> res = "Деян 22.6; 26.13; 1 Кор 15.8"
                11 -> res = "Деян 22.3"
                13 -> res = "Деян 8.3"
                15 -> res = "Рим 15.19; Еф 3.8; 1 Тим 2.7"
                21 -> res = "Деян 8.3; Гал 1.13, 23"
                24 -> res = "2 Кор 11.32"
            }
        }
        if (glava == 10) {
            when (stih) {
                6 -> res = "Деян 9.43"
                12 -> res = "Лев 11.23; 20.25"
                15 -> res = "Мф 15.11; Рим 14.14; 1 Тим 4.4; Тит 1.15"
                20 -> res = "Деян 15.7"
                23 -> res = "Деян 11.12"
                26 -> res = "Деян 14.15; Откр 19.10; 22.9"
                28 -> res = "Мф 9.11; Ин 4.9"
                34 -> res = "Втор 10.17; 2 Пар 19.7; Иов 34.19; 1 Пет 1.17; Рим 2.11; Еф 6.9"
                36 -> res = "Еф 2.17; Флп 2.11"
                37 -> res = "Лк 4.14"
                38 -> res = "Пс 44.8; Лк 4.18"
                39 -> res = "Деян 5.32; 13.31"
                40 -> res = "Деян 2.24"
                41 -> res = "Мф 28.7; Лк 24.30; Деян 13.31"
                43 -> res = "Ис 53.5; Иер 31.34; Дан 9.24; Мих 7.18; Зах 13.1; Деян 15.9"
                46 -> res = "Мк 16.17"
                47 -> res = "Деян 15.8"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Деян 10.44"
                12 -> res = "Деян 10.20; 15.7"
                15 -> res = "Деян 2.2"
                16 -> res = "Мф 3.11; Мк 1.8; Деян 1.5; 19.4"
                19 -> res = "Деян 8.1"
                21 -> res = "Деян 5.14"
                23 -> res = "Деян 14.22"
                25 -> res = "Деян 9.30"
                27 -> res = "Деян 13.1; 15.32"
                28 -> res = "Деян 21.10"
                29 -> res = "Деян 24.17"
                30 -> res = "Рим 15.25; 2 Кор 8.4; 9.8"
            }
        }
        if (glava == 12) {
            when (stih) {
                2 -> res = "Мф 20.23"
                8 -> res = "Мк 6.9"
                15 -> res = "Быт 48.16; Мф 18.10"
                20 -> res = "3 Цар 5.1, 9"
                24 -> res = "Ис 55.11; Деян 6.7; Кол 1.6"
                25 -> res = "Деян 11.30; 13.5"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Деян 11.27"
                2 -> res = "Деян 9.15; Рим 1.1; Гал 1.15; 1 Тим 2.7"
                3 -> res = "Деян 6.6"
                5 -> res = "Деян 12.25"
                8 -> res = "Деян 8.9; 2 Тим 3.8"
                10 -> res = "Мф 13.38; Ин 8.44; 1 Ин 3.8"
                13 -> res = "Деян 15.38"
                17 -> res = "Исх 1.1; 13.16"
                18 -> res = "Исх 16.35"
                19 -> res = "Нав 3.10"
                20 -> res = "Суд 2.16"
                21 -> res = "1 Цар 8.5; 9.16"
                22 -> res = "1 Цар 13.14; Пс 88.21"
                23 -> res = "2 Цар 7.12; Пс 131.11; Ис 11.1"
                24 -> res = "Мф 3.1"
                25 -> res = "Ин 1.20; 3.28"
                26 -> res = "Мф 10.6"
                27 -> res = "Лк 24.27; 1 Кор 2.8"
                28 -> res = "Мф 27.20; Лк 23.23; Деян 3.14"
                30 -> res = "Мф 28.6; Мк 16.6"
                31 -> res = "Ин 20.19"
                32 -> res = "Быт 22.18; 2 Цар 7.12; Ис 4.2; Дан 9.24"
                33 -> res = "Пс 2.7; Евр 1.5"
                34 -> res = "Ис 55.3"
                35 -> res = "Пс 15.10; Деян 2.31"
                36 -> res = "3 Цар 2.10; Деян 2.29"
                37 -> res = "Деян 2.31"
                38 -> res = "Ис 53.12; Иер 31.34; Лк 24.47"
                39 -> res = "Рим 3.20"
                41 -> res = "Авв 1.5"
                43 -> res = "Деян 11.23"
                46 -> res = "Втор 32.21; Деян 3.26; 4.29; 18.6"
                47 -> res = "Ис 49.6; 42.6; Лк 2.32"
                50 -> res = "2 Тим 3.11"
                51 -> res = "Мф 10.14; Мк 6.11; Лк 9.5"
            }
        }
        if (glava == 14) {
            when (stih) {
                3 -> res = "Мк 16.20"
                6 -> res = "Мф 10.23"
                10 -> res = "Ис 35.6"
                15 -> res = "Быт 1.1; Пс 145.6; Сир 18.1; Ам 2.4; Деян 10.26; Откр 14.7"
                17 -> res = "Пс 64.10; Мф 5.45; Рим 1.19-20"
                19 -> res = "2 Кор 11.25"
                22 -> res = "Пс 33.20; Мф 7.14; Лк 13.24; 2 Тим 3.12; Откр 14.12"
                26 -> res = "Деян 16.2"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Гал 2.3-4; 5.2; Флп 3.3"
                7 -> res = "Деян 10.20; 11.12"
                8 -> res = "Пс 7.10; Деян 11.15"
                9 -> res = "Деян 10.43; 1 Кор 1.2"
                10 -> res = "Мф 23.4; Лк 11.46; Гал 5.1"
                11 -> res = "Гал 3.22; Еф 2.8; 2 Тим 1.9; Тит 3.4-5"
                17 -> res = "Ам 9.11-12"
                20 -> res = "Быт 9.4; Исх 34.15; Деян 21.25; Рим 1.27; 1 Кор 6.15"
                32, 41 -> res = "Деян 14.22"
                37 -> res = "Деян 12.12; Кол 4.10"
                38 -> res = "Деян 13.13"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Рим 16.21; Флп 2.19; 1 Фес 1.1"
                3 -> res = "1 Кор 9.20"
                4 -> res = "Деян 15.28"
                18 -> res = "Мф 10.1; Мк 1.34; 16.17"
                22 -> res = "2 Кор 11.25; 1 Фес 2.2"
                26 -> res = "Деян 4.31"
                31 -> res = "Мк 16.16"
                37 -> res = "Деян 22.25"
            }
        }
        if (glava == 17) {
            when (stih) {
                3 -> res = "Пс 21.7; Ис 50.6; 53.3; Дан 9.24; Мф 16.21; Мк 8.31; Лк 9.22"
                6 -> res = "Деян 16.20"
                11 -> res = "Ис 8.20; 34.16; Ин 5.39; 1 Пет 1.10; 1 Тим 4.16"
                16 -> res = "2 Пет 2.8"
                24 -> res = "Быт 1.1; Пс 8.2; 32.6; Деян 7.48"
                25 -> res = "Иов 12.10; Пс 20.5; 26.1; 35.7; 49.9; Ис 42.5"
                29 -> res = "Ис 40.18"
                30 -> res = "Рим 13.12; Еф 1.9; 3.5; Кол 1.26"
                31 -> res = "Деян 2.24; 3.15; 4.10; 13.30; Рим 6.4; 14.9"
            }
        }
        if (glava == 18) {
            when (stih) {
                2 -> res = "Рим 16.3; 2 Тим 4.19"
                3 -> res = "Деян 20.34; 1 Кор 4.12; 1 Фес 2.9; 2 Фес 3.8"
                5 -> res = "Деян 17.14"
                6 -> res = "Иез 3.19; Мф 10.14; Деян 13.46, 51; 20.26"
                8 -> res = "1 Кор 1.14"
                9 -> res = "Ис 62.1; Деян 23.11"
                10 -> res = "Иер 1.19; Мф 28.20"
                15 -> res = "Деян 23.29"
                17 -> res = "1 Кор 1.1"
                18 -> res = "Чис 6.18; Деян 21.24"
                21 -> res = "Иак 4.15; 1 Кор 4.19"
                24 -> res = "1 Кор 1.12; 16.12"
                25 -> res = "Деян 19.3; Рим 12.11"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "Деян 18.21"
                2 -> res = "Ин 7.39"
                4 -> res = "Мф 3.11; Мк 1.8; Лк 3.16; Ин 1.26; Деян 1.5"
                6 -> res = "Деян 8.17"
                10 -> res = "2 Тим 1.15"
                11 -> res = "Мк 16.20; Ин 14.12"
                15 -> res = "Мк 1.24, 34"
                18 -> res = "Мф 3.6"
                20 -> res = "Ис 55.11; Деян 6.7; 12.24"
                21 -> res = "Деян 28.14; Рим 1.11"
                26 -> res = "Исх 20.3; Лев 19.4; Втор 5.8; Пс 96.7; Ис 40.18; Иер 10.3; Авв 2.18"
                29 -> res = "Деян 16.19; 20.4; Кол 4.10"
                33 -> res = "1 Тим 1.20; 2 Тим 4.14"
            }
        }
        if (glava == 20) {
            when (stih) {
                4 -> res = "Деян 19.29; 27.2"
                7 -> res = "Деян 2.46; 1 Кор 10.16"
                18 -> res = "Деян 19.9"
                21 -> res = "Лк 24.47"
                23 -> res = "Деян 9.16; 21.11; 1 Фес 3.3"
                24 -> res = "Деян 21.13; Рим 8.35; Гал 1.1; Кол 1.24; Тит 1.3"
                26 -> res = "Иез 33.9; Деян 18.6"
                27 -> res = "Лк 7.30; Еф 1.11"
                28 -> res = "Ис 53.12; Ин 21.15; 1 Пет 5.2; Рим 3.25"
                29 -> res = "Мф 7.15; 2 Пет 2.1"
                31 -> res = "Мф 25.13; Евр 13.17"
                32 -> res = "Еф 1.18"
                33 -> res = "1 Цар 12.3"
                34 -> res = "Деян 18.3; 1 Кор 4.12; 1 Фес 2.9; 2 Фес 3.8"
                35 -> res = "Лк 6.38; 18.22"
            }
        }
        if (glava == 21) {
            when (stih) {
                4, 33 -> res = "Деян 20.23"
                5 -> res = "Деян 20.36"
                8 -> res = "Деян 6.5"
                9 -> res = "Деян 2.17-18"
                10 -> res = "Деян 11.28"
                11 -> res = "Деян 20.23; 24.27; 26.29; Еф 6.20; Флп 1.13; 2 Тим 2.9; Евр 10.34"
                13 -> res = "Деян 20.24"
                14 -> res = "Мф 6.10"
                20 -> res = "Деян 22.3; Рим 10.2"
                24 -> res = "Чис 6.18; Деян 18.18"
                25 -> res = "Деян 15.20"
                28 -> res = "Деян 24.6"
                30 -> res = "Деян 26.21"
                38 -> res = "Деян 5.36"
                39 -> res = "Деян 22.3"
            }
        }
        if (glava == 22) {
            when (stih) {
                3 -> res = "Деян 5.34; 21.20, 39; Гал 1.14"
                4 -> res = "Деян 8.3; 9.1; 26.10"
                6 -> res = "Деян 9.3; 26.13"
                14 -> res = "Деян 18.9; 1 Ин 2.1; Гал 1.12"
                18 -> res = "Деян 9.15; 1 Кор 9.1; 15.8"
                20 -> res = "Деян 7.58"
                21 -> res = "Деян 9.15; Гал 1.16; 1 Тим 2.7; 2 Тим 1.11"
            }
        }
        if (glava == 23) {
            when (stih) {
                1 -> res = "Деян 24.16; 1 Кор 4.4; 2 Кор 1.12; 4.2; Евр 13.18"
                3 -> res = "Лев 19.35; Втор 17.10; Мф 23.27"
                5 -> res = "Исх 22.28"
                6 -> res = "Деян 24.21; Флп 3.5"
                8 -> res = "Мф 22.23; Мк 12.18; Лк 20.27"
                9 -> res = "Деян 25.25"
                11 -> res = "Деян 18.9; 19.21"
                27 -> res = "Деян 21.32"
                28 -> res = "Деян 22.30"
                29 -> res = "Деян 25.19"
                35 -> res = "Деян 24.1; 25.16"
            }
        }
        if (glava == 24) {
            when (stih) {
                5 -> res = "Деян 28.22"
                6 -> res = "Деян 21.28"
                15 -> res = "Дан 12.2; Ин 5.28"
                16 -> res = "Деян 23.1"
                17 -> res = "Деян 11.29; Рим 15.25"
                18 -> res = "Деян 21.26-27"
                21 -> res = "Деян 23.6"
                23 -> res = "Деян 27.3"
                27 -> res = "Деян 21.11; 25.9"
            }
        }
        if (glava == 25) {
            when (stih) {
                8 -> res = "Деян 24.12; 28.17"
                11 -> res = "Деян 28.18"
                15 -> res = "Деян 24.1"
                19 -> res = "Деян 18.15"
                24 -> res = "Деян 22.22; 24.5"
                25 -> res = "Деян 23.9"
            }
        }
        if (glava == 26) {
            when (stih) {
                5 -> res = "Деян 22.3; 23.6"
                6 -> res = "Быт 3.15; 22.18; Втор 18.15; 2 Цар 7.12; Пс 131.11; Ис 4.2; 7.14; Иер 23.5; 33.15; Иез 34.23; 37.24; Дан 9.24; Мих 5.2"
                10 -> res = "Деян 8.3; 9.1; 22.4; 1 Кор 15.9; Гал 1.13; 1 Тим 1.13"
                13 -> res = "Деян 22.6"
                18 -> res = "Ис 42.7; 60.1; Лк 2.32; Ин 1.9; 1 Пет 2.9; Еф 5.8"
                20 -> res = "Иер 18.8; Иез 33.14; Деян 9.20"
                21 -> res = "Деян 21.30"
                23 -> res = "Чис 21.9; Ис 53.2; Дан 9.26; Зах 12.10; Лк 24.27"
                24 -> res = "1 Кор 1.23; 2.14"
                26 -> res = "Ин 18.20"
                29 -> res = "Деян 24.27"
            }
        }
        if (glava == 27) {
            when (stih) {
                2 -> res = "Деян 20.4; 2 Кор 11.23; Кол 4.10"
                3 -> res = "Деян 24.23"
                24 -> res = "Быт 39.5"
                26 -> res = "Деян 28.1"
                34 -> res = "Мф 10.30"
                41 -> res = "2 Кор 11.25"
            }
        }
        if (glava == 28) {
            when (stih) {
                3 -> res = "Мк 16.18"
                14 -> res = "Деян 19.21"
                17, 18 -> res = "Деян 25.8"
                20 -> res = "Лк 2.38"
                22 -> res = "Лк 2.34; Деян 24.5; Евр 12.3"
                26 -> res = "Иер 5.21; Иез 12.2; Мф 13.14; Мк 4.12; Лк 8.10; Ин 12.40; Рим 11.8"
                27 -> res = "Ис 6.9-10"
                28 -> res = "Лк 24.47; Деян 13.46"
            }
        }
        return res
    }

    fun kniga56(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                2 -> res = "Деян 5.41; 1 Кор 10.13"
                3 -> res = "1 Пет 1.7; Рим 5.3"
                5 -> res = "3 Цар 3.12; Притч 2.6; Дан 2.21"
                6 -> res = "Мф 7.7; Мк 11.24; Лк 11.9; Ин 14.13; 16.23"
                10 -> res = "Иов 14.2; Пс 89.6; 102.15; Сир 14.18; Ис 40.6; 1 Пет 1.24"
                12 -> res = "Иов 5.17; Притч 3.11; 2 Тим 4.8; Евр 12.5"
                13 -> res = "Лк 11.4"
                15 -> res = "Рим 6.21, 23"
                17 -> res = "Чис 23.19; Ис 46.10; Мал 3.6; Ин 3.27"
                18 -> res = "Ин 1.13; 1 Пет 1.23; Евр 12.23"
                19 -> res = "Притч 17.27; Еккл 5.1; 7.9; Сир 5.13"
                21 -> res = "Рим 1.16; Еф 4.22"
                22 -> res = "Мф 7.21; Лк 11.28; Рим 2.13"
                25 -> res = "Ин 13.17; 2 Кор 3.18"
                26 -> res = "Пс 33.14; 38.2; 1 Пет 3.10"
                27 -> res = "Ис 1.16-17; Иак 2.17"
            }
        }
        if (glava == 2) {
            when (stih) {
                1, 9 -> res = "Лев 19.15"
                5 -> res = "Исх 20.6; Мф 5.3"
                8 -> res = "Лев 19.18; Мф 5.43"
                10 -> res = "Мф 5.19"
                11 -> res = "Исх 20.13; Мф 19.18"
                13 -> res = "Притч 21.13; Мф 6.15"
                14 -> res = "Мф 7.26"
                15 -> res = "Лк 3.11; 1 Ин 3.17"
                19 -> res = "Мк 1.24; 12.29; Деян 19.15"
                21 -> res = "Быт 22.9; Евр 11.17"
                23 -> res = "Быт 15.6; 2 Пар 20.7; Ис 41.8; Рим 4.3; Гал 3.6"
                25 -> res = "Нав 2.1; Евр 11.31"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Мф 23.8"
                2 -> res = "3 Цар 8.46; Сир 14.1; 19.17"
                6 -> res = "Притч 16.27; Мф 15.18"
                8 -> res = "Пс 139.3"
                9 -> res = "Быт 1.27"
                12 -> res = "Лк 6.44"
                13 -> res = "Мф 5.16; 2 Тим 2.24"
                16 -> res = "1 Кор 3.3"
                17 -> res = "Мф 5.7-8; 2 Кор 6.6; Гал 5.22; 1 Тим 1.5"
                18 -> res = "Ис 32.17"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Рим 7.23; Гал 5.17"
                3 -> res = "Притч 1.28; Ис 1.15; 1 Ин 3.22"
                4 -> res = "Ин 15.19; Рим 8.7"
                5 -> res = "Быт 6.5; 8.21; Гал 5.17"
                6 -> res = "Притч 3.34; Лк 14.11; 1 Пет 5.5"
                8 -> res = "2 Пар 15.2; Ис 1.15-16"
                9 -> res = "Мф 5.4"
                10 -> res = "1 Пет 5.6"
                11 -> res = "Мф 7.1"
                12 -> res = "Рим 14.4"
                13 -> res = "Лк 12.18"
                14 -> res = "Иов 7.7; Притч 27.1"
                15 -> res = "Деян 18.21; 1 Кор 4.19; 16.7"
                17 -> res = "Лк 12.47"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Лк 6.24; 1 Тим 6.9, 17, 19"
                3 -> res = "Мф 6.19"
                4 -> res = "Втор 24.14"
                5 -> res = "Иов 21.13; Лк 6.25"
                8 -> res = "Лк 21.9; Евр 10.36"
                10 -> res = "Мф 5.12"
                11 -> res = "Иов 1.21"
                12 -> res = "Мф 5.34, 37"
                13 -> res = "Еф 5.19; 6.18"
                14 -> res = "Мк 6.13"
                15 -> res = "Мф 9.2"
                16 -> res = "Пс 144.19"
                17 -> res = "3 Цар 17.1; Лк 4.25"
                18 -> res = "3 Цар 18.42, 45"
                19 -> res = "Лев 19.17; Мф 18.15; Лк 17.3"
            }
        }
        return res
    }

    fun kniga57(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "1 Пет 2.9"
                2 -> res = "Еф 1.4, 7; Евр 12.24"
                3 -> res = "Рим 6.4; Еф 1.3"
                4 -> res = "2 Тим 4.8"
                5 -> res = "Ин 10.28"
                6 -> res = "Мф 5.12; 2 Кор 4.17"
                7 -> res = "Иов 23.10; Притч 17.3; Зах 13.9"
                8 -> res = "Ин 20.29; 2 Кор 5.7"
                9 -> res = "Рим 6.23"
                10 -> res = "Быт 49.10; Дан 2.44; 9.24; Мф 13.17; 2 Пет 1.21"
                11 -> res = "Пс 21.7; Ис 53.3"
                12 -> res = "Еф 3.10; 1 Тим 3.16"
                13 -> res = "Лк 12.35"
                14 -> res = "Деян 17.30"
                15 -> res = "Лк 1.75"
                16 -> res = "Лев 19.2; 11.44"
                17 -> res = "Втор 10.17"
                19 -> res = "1 Ин 1.7; 1 Кор 6.20; Еф 1.7; Евр 9.14; Откр 1.5"
                22 -> res = "1 Пет 2.17"
                23 -> res = "Иак 1.18"
                25 -> res = "Ис 40.6-8"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Кол 3.8; Евр 12.1"
                2 -> res = "Мф 18.3; Мк 10.14"
                3 -> res = "Пс 33.9"
                4 -> res = "Мф 16.18; 21.42"
                5 -> res = "Мал 1.11; Откр 1.6"
                6 -> res = "Ис 28.16; Рим 9.33"
                7 -> res = "Пс 117.22; Ис 8.14; Мф 21.42"
                9 -> res = "Исх 19.6; Ис 61.6; Деян 26.18"
                10 -> res = "Ос 2.23; 1.10; Рим 9.25"
                11 -> res = "Пс 38.13; Рим 13.13; Гал 5.16"
                12 -> res = "Мф 5.16"
                13 -> res = "Рим 13.1; Тит 3.1"
                16 -> res = "Гал 5.13"
                17 -> res = "1 Пет 1.22; Рим 12.10"
                19 -> res = "Мф 5.10"
                20 -> res = "1 Пет 3.14; 4.14"
                21 -> res = "Мф 16.24; Флп 2.5"
                22 -> res = "Ис 53.9; 1 Ин 3.5"
                23 -> res = "Ис 50.6; 53.7"
                24 -> res = "Мф 8.17; Рим 6.2"
                25 -> res = "Ис 53.4-6; Иез 34.5, 23; Ин 10.11"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Еф 5.22; Кол 3.18"
                3 -> res = "1 Тим 2.9"
                4 -> res = "Пс 44.14; Рим 7.22; 2 Кор 4.16"
                6 -> res = "Быт 18.12"
                7 -> res = "1 Кор 7.3; Гал 3.28"
                8 -> res = "Рим 15.5"
                9 -> res = "Притч 17.13; 20.22; Мф 5.39; Рим 12.14, 17"
                10 -> res = "Пс 33.13"
                11 -> res = "Ис 1.16"
                14 -> res = "Ис 8.12; Мф 5.10"
                15 -> res = "Кол 4.6"
                16 -> res = "1 Пет 2.12"
                17 -> res = "1 Пет 4.15"
                18 -> res = "Рим 5.6; Евр 9.28"
                19 -> res = "Кол 2.15"
                20 -> res = "Быт 7.7; Мф 24.37; Лк 17.26"
                21 -> res = "Рим 6.4; Еф 5.26"
                22 -> res = "Мф 28.18; Еф 1.20"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "1 Пет 2.21"
                2 -> res = "2 Кор 5.15; Гал 2.20"
                3 -> res = "Еф 4.17"
                4 -> res = "1 Пет 2.12"
                5 -> res = "2 Тим 4.1"
                7 -> res = "Лк 21.34; Иак 5.8"
                8 -> res = "Притч 10.12"
                9 -> res = "Рим 12.13; Флп 2.14; Евр 13.2"
                10 -> res = "Рим 12.6"
                11 -> res = "Мф 5.16"
                12 -> res = "1 Пет 1.7"
                13 -> res = "2 Кор 4.10; Флп 3.10"
                14 -> res = "Мф 5.11"
                15 -> res = "1 Пет 2.19; 3.17"
                17 -> res = "Иер 25.29; Иез 9.6; Лк 23.31"
                18 -> res = "Притч 11.31"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Деян 1.8; Рим 8.17"
                2 -> res = "Деян 20.28"
                3 -> res = "Мк 10.44"
                4 -> res = "1 Пет 2.25; 1 Кор 9.25"
                5 -> res = "Иак 4.6; Еф 5.21; Флп 2.3"
                6 -> res = "Иак 4.10"
                7 -> res = "Пс 54.23; Прем 12.13; Мф 6.32; Лк 12.30"
                8 -> res = "Иов 1.7; 2.2; Лк 22.31"
                9 -> res = "Деян 14.22"
                10 -> res = "2 Кор 4.17"
                14 -> res = "Рим 16.16; 1 Кор 16.20; 2 Кор 13.12"
            }
        }
        return res
    }

    fun kniga58(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                3 -> res = "Рим 8.30"
                7 -> res = "1 Ин 3.16"
                8 -> res = "Тит 3.14"
                9 -> res = "1 Ин 2.9"
                14 -> res = "Ин 21.18"
                16 -> res = "Лк 9.32; Ин 1.14; 1 Кор 2.13"
                17 -> res = "Мф 17.5; Мк 9.7"
                21 -> res = "1 Пет 1.10"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Втор 13.1; Мф 24.11; 1 Тим 4.1"
                2 -> res = "2 Тим 4.3"
                3 -> res = "Рим 16.18"
                4 -> res = "Иов 4.18; 1 Ин 3.8; Иуд 1.6"
                5 -> res = "Быт 7.7"
                6 -> res = "Быт 19.24"
                7 -> res = "Быт 19.5, 9"
                8 -> res = "Иез 9.4"
                9 -> res = "Пс 90.15; 1 Кор 10.13"
                10 -> res = "Иуд 1.8"
                11 -> res = "Иуд 1.9"
                13 -> res = "Рим 16.18; Флп 3.19"
                14 -> res = "1 Тим 6.10"
                15 -> res = "Иуд 1.11"
                16 -> res = "Чис 22.23-24"
                17 -> res = "Иуд 1.12"
                19 -> res = "Ин 8.34; Рим 6.16"
                20 -> res = "Мф 12.45; Лк 11.26"
                21 -> res = "Ин 15.22"
                22 -> res = "Притч 26.11"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "2 Пет 1.13"
                3 -> res = "Иуд 1.18; 1 Тим 4.1; 2 Тим 3.1"
                4 -> res = "Ис 5.19; Иез 12.22; 1 Кор 15.12"
                5 -> res = "Быт 1.1; Пс 23.2; Евр 11.3"
                6 -> res = "Быт 7.23"
                7 -> res = "Пс 101.27; Ис 51.6; Мф 13.40"
                8 -> res = "Пс 89.5"
                9 -> res = "Иез 18.32; 33.11; 1 Тим 2.4"
                10 -> res = "Мф 24.35, 43; 1 Фес 5.2"
                12 -> res = "Пс 49.3; Мих 1.4"
                13 -> res = "Ис 65.17; 66.22; Рим 8.19; Откр 21.1"
                14 -> res = "1 Кор 1.8"
                15 -> res = "Рим 2.4"
                16 -> res = "1 Кор 15.24; 1 Фес 4.15"
                18 -> res = "Откр 22.5"
            }
        }
        return res
    }

    fun kniga59(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Лк 1.2; 24.39; Ин 1.1, 14"
                2 -> res = "Ин 1.1, 4"
                3 -> res = "Ин 15.10; 1 Кор 1.9"
                5 -> res = "Ин 8.12"
                6 -> res = "2 Кор 6.14; Еф 5.11"
                7 -> res = "1 Пет 1.19; Евр 9.14; Откр 1.5"
                8 -> res = "3 Цар 8.46; Притч 20.9; Еккл 7.20"
                9 -> res = "2 Цар 12.13; Пс 31.5; Притч 28.13"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Рим 8.34; 1 Тим 2.5"
                2 -> res = "Деян 5.31; 1 Ин 1.9; 4.10; Евр 2.10"
                6 -> res = "Ин 13.15"
                7 -> res = "Ин 13.34"
                8 -> res = "Ин 1.9; Рим 13.12"
                9 -> res = "1 Кор 13.2"
                11 -> res = "Ин 12.35"
                12 -> res = "Деян 4.12; 10.43"
                13 -> res = "Лк 10.18-19"
                14 -> res = "Еф 6.10"
                15 -> res = "Мф 6.24"
                17 -> res = "Ис 40.6, 8; 1 Кор 7.31"
                18 -> res = "Лк 21.8"
                19 -> res = "Деян 20.30"
                20 -> res = "Мф 11.25; 2 Кор 1.21"
                23 -> res = "Мк 8.38; Ин 8.19"
                27 -> res = "Ин 14.26; 1 Ин 2.20"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Ин 1.12"
                2 -> res = "Мф 5.8; 1 Кор 13.12"
                3 -> res = "2 Кор 7.1"
                4 -> res = "1 Ин 5.17"
                5 -> res = "Ис 53.4, 9; 1 Пет 2.22"
                7 -> res = "Иез 18.9"
                8 -> res = "Ин 8.44"
                9 -> res = "1 Пет 1.23; 1 Ин 5.18"
                11 -> res = "Ин 13.34; 15.12; 1 Ин 4.21"
                12 -> res = "Быт 4.8; Мф 23.35; Евр 11.4"
                13 -> res = "Ин 15.18"
                14 -> res = "Лев 19.17; Еф 2.5"
                16 -> res = "Ин 15.13; Рим 5.8; Еф 5.2"
                17 -> res = "Втор 15.8; Лк 3.11; Иак 2.15"
                19 -> res = "Ин 18.37"
                21 -> res = "1 Ин 2.28; Евр 10.22"
                22 -> res = "Мф 21.22; Ин 15.7; 1 Ин 5.14"
                23 -> res = "Ин 6.29; 13.34; 17.3"
                24 -> res = "Ин 14.23"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Мф 7.15; Откр 2.2"
                3 -> res = "1 Ин 2.22; 1 Кор 12.3"
                4 -> res = "2 Пар 32.7"
                5 -> res = "Ин 15.19"
                6 -> res = "Ин 8.47"
                9 -> res = "Ис 9.6; Ин 3.16; 2 Кор 5.19"
                10 -> res = "1 Ин 2.2; Рим 5.8"
                11 -> res = "Мф 18.33; Ин 15.12"
                12 -> res = "Исх 33.20; Ин 1.18; 1 Тим 6.16"
                13, 16 -> res = "1 Ин 3.24"
                15 -> res = "1 Ин 5.5; Рим 10.9"
                20 -> res = "1 Ин 2.4; 3.17"
                21 -> res = "Мф 22.37, 39; Ин 13.34; 1 Ин 3.11"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "1 Ин 4.15"
                3 -> res = "Мф 11.30"
                4 -> res = "Ин 16.33; 1 Кор 15.57"
                5 -> res = "1 Ин 4.4"
                6 -> res = "Ин 19.34"
                7 -> res = "Мф 3.16-17; 28.19"
                8 -> res = "Ин 1.33"
                9 -> res = "Мф 3.17; Ин 8.18"
                10 -> res = "Ин 3.33"
                12 -> res = "Ин 3.36"
                13 -> res = "Ин 20.31"
                14 -> res = "Иер 29.12-13; 1 Ин 3.21-22"
                16 -> res = "Чис 15.30; 1 Цар 2.25; Иер 7.16; 15.1; Мф 12.31; Лк 12.10"
                17 -> res = "1 Ин 3.4"
                18 -> res = "1 Ин 3.9"
            }
        }
        return res
    }

    fun kniga61(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                4 -> res = "1 Кор 4.15"
                8 -> res = "Мф 10.40"
                11 -> res = "1 Ин 2.29"
            }
        }
        return res
    }

    fun kniga60(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                2 -> res = "Ин 14.17"
                5 -> res = "Ин 13.34; 1 Ин 3.11"
                6 -> res = "Ин 14.15; 1 Ин 2.5"
                7 -> res = "1 Ин 4.1"
                10 -> res = "Рим 16.17; 1 Кор 5.11; Тит 3.10"
                12 -> res = "1 Ин 1.4"
            }
        }
        return res
    }

    fun kniga62(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Лк 6.16; Ин 14.22; 17.11"
                3 -> res = "Флп 1.27"
                4 -> res = "Мк 16.16; Ин 3.18"
                5 -> res = "Исх 12.37; 14.13; Чис 14.29"
                6 -> res = "Иов 4.18; Ин 8.44; 2 Пет 2.4"
                7 -> res = "Быт 19.24; Лк 17.29; 2 Пет 2.6"
                9 -> res = "Втор 34.6; Зах 3.2"
                10 -> res = "2 Пет 2.12"
                11 -> res = "Быт 4.8; Чис 22.16-19; 16.31; 2 Пет 2.15"
                12 -> res = "Притч 25.14; 2 Пет 2.17"
                14 -> res = "Дан 7.10; Мф 25.31; Откр 1.7"
                15 -> res = "Мф 12.36"
                16 -> res = "Пс 16.10; 1 Тим 6.5"
                18 -> res = "2 Пет 3.3; 1 Тим 4.1"
                19 -> res = "1 Кор 2.14; Евр 10.25"
                20 -> res = "Кол 2.7"
                23 -> res = "Ам 4.11; Еф 4.22"
            }
        }
        return res
    }

    fun kniga63(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Деян 9.15"
                2 -> res = "Ис 52.7; Наум 1.15; Лк 1.70; Ин 1.45"
                3 -> res = "Мф 1.1; Лк 2.4"
                4 -> res = "2 Цар 7.12"
                5 -> res = "Деян 2.22; 2 Кор 10.5"
                7 -> res = "1 Кор 1.2; Еф 1.1"
                9 -> res = "Ин 4.23; Деян 24.14"
                11 -> res = "Рим 15.29; 1 Фес 3.10"
                14 -> res = "Деян 9.15; 1 Кор 9.16"
                16 -> res = "Мк 8.38; 1 Кор 1.24; 15.2; 2 Тим 1.8"
                17 -> res = "Авв 2.4; Рим 3.21"
                20 -> res = "Пс 18.2"
                21 -> res = "Втор 28.29; Иов 5.14; Ис 59.10; Еф 4.18"
                23 -> res = "Исх 32.4; Прем 12.24; Иер 2.27"
                26 -> res = "Лев 18.23; 20.16"
                28 -> res = "Пс 80.13; Иер 7.15; Ос 9.10; 2 Фес 2.11"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "2 Цар 12.5; Мф 7.1; Лк 6.37; 1 Кор 4.5"
                4 -> res = "Ис 30.18; Иер 3.12; 2 Пет 3.15"
                5 -> res = "Иак 5.3"
                6 -> res = "Притч 24.12; Мф 16.27"
                7 -> res = "Мф 25.46"
                8 -> res = "Иер 23.19; Евр 10.27"
                11 -> res = "Втор 10.17; 2 Пар 19.7"
                12 -> res = "Лк 12.47"
                13 -> res = "Мф 7.21; Иак 1.22"
                16 -> res = "Еккл 12.14; Мф 25.31; Ин 5.22; Деян 10.42; 1 Кор 4.5"
                17 -> res = "Мих 3.11"
                19 -> res = "Ис 42.19; Мф 15.14"
                21 -> res = "Пс 49.16, 21"
                24 -> res = "Ис 52.5; Иез 36.20"
                25 -> res = "Лев 26.41; Иер 4.4; 1 Кор 7.19; Гал 6.15"
                26 -> res = "Деян 10.35"
                27 -> res = "Мф 12.41"
                28 -> res = "Рим 9.6, 8"
                29 -> res = "Втор 30.6; Рим 4.12; Кол 2.11"
            }
        }
        if (glava == 3) {
            when (stih) {
                2 -> res = "Втор 4.8; Пс 147.8; Рим 9.4"
                3 -> res = "Чис 23.19; 2 Тим 2.13"
                4 -> res = "Пс 50.6; 115.2; Ин 3.33"
                6 -> res = "Быт 18.25; Иов 8.3"
                8 -> res = "Рим 6.15"
                9 -> res = "Гал 3.22"
                10 -> res = "Пс 52.4"
                11 -> res = "Быт 8.21"
                12 -> res = "Пс 13.1-3"
                13 -> res = "Пс 5.10; 139.4"
                14 -> res = "Пс 9.28"
                17 -> res = "Притч 1.16; Ис 59.7-8"
                18 -> res = "Пс 35.2"
                19 -> res = "Пс 106.42; 142.2; Иез 16.63"
                20 -> res = "Рим 7.7; Гал 2.16"
                21 -> res = "Быт 15.6; Ис 28.16; Авв 2.4"
                22 -> res = "Гал 3.28"
                23 -> res = "Рим 3.10; 5.12"
                24 -> res = "Ис 55.1; Рим 8.32"
                25 -> res = "Деян 13.38; 2 Кор 5.19"
                29 -> res = "Быт 17.5"
                30 -> res = "Рим 4.11"
                31 -> res = "Гал 3.24"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "Еф 2.8"
                3 -> res = "Быт 15.6; Иак 2.23; Гал 3.6"
                4 -> res = "Рим 11.6"
                8 -> res = "Пс 31.1-2"
                11 -> res = "Быт 17.11"
                13 -> res = "Быт 15.6; 17.5"
                15 -> res = "Рим 3.20; 5.13; 7.8; 1 Кор 15.56; Гал 3.10"
                17 -> res = "Быт 17.5; Сир 44.19; Евр 11.12"
                18 -> res = "Быт 15.5"
                21 -> res = "Пс 113.11; Лк 1.37"
                23 -> res = "Рим 15.4"
                25 -> res = "Ис 53.5; 1 Пет 1.21; Рим 5.6; 1 Кор 15.22"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Лк 2.14; Еф 2.16; Кол 1.20"
                2 -> res = "Ин 14.6; Еф 2.18; Евр 10.19"
                3 -> res = "Иак 1.2; 2 Кор 12.10"
                5 -> res = "Пс 21.6; Рим 8.16; 2 Кор 1.22"
                6 -> res = "1 Пет 3.18; Евр 9.15"
                8 -> res = "Ин 15.13; 1 Ин 3.16"
                9 -> res = "Рим 3.25; 1 Фес 1.10"
                10 -> res = "2 Кор 5.18; Кол 1.22"
                12 -> res = "Быт 2.17; Рим 6.23; 1 Кор 15.21"
                13 -> res = "Рим 4.15"
                14 -> res = "1 Кор 15.21, 45, 55"
                15 -> res = "Ин 1.16; Еф 1.6"
                17 -> res = "2 Тим 2.12; Откр 1.6; 22.5"
                19 -> res = "Ис 53.11; Флп 2.8"
                20 -> res = "Рим 7.8; Гал 3.19"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "1 Пет 2.24; Гал 6.14"
                3 -> res = "Гал 3.27"
                4 -> res = "Кол 2.12; Гал 6.15; Еф 4.23"
                5 -> res = "Рим 8.11; 1 Кор 6.14"
                6 -> res = "Гал 5.24"
                7 -> res = "1 Пет 4.1"
                8 -> res = "Кол 3.5, 9-10; 2 Тим 2.11"
                9 -> res = "1 Кор 15.54; Евр 9.28"
                10 -> res = "Лк 20.38"
                11 -> res = "Гал 2.19"
                13 -> res = "Рим 12.1; Гал 2.20"
                14 -> res = "Рим 5.20"
                15 -> res = "Гал 2.17"
                16 -> res = "Мф 6.24; Ин 8.34; 2 Пет 2.19"
                18 -> res = "Ин 8.32; Гал 5.1"
                21 -> res = "Рим 1.26, 31; 7.5"
                23 -> res = "Рим 2.7; 5.12"
            }
        }
        if (glava == 7) {
            when (stih) {
                2 -> res = "Чис 5.12; Мф 5.32"
                4 -> res = "Рим 6.14; 8.2; 2 Кор 11.2; Гал 5.22"
                5 -> res = "Иак 1.15"
                6 -> res = "Рим 6.2"
                7 -> res = "Исх 20.17"
                8 -> res = "Рим 4.15"
                10 -> res = "Лев 18.5; Иез 20.11"
                11 -> res = "Евр 3.13"
                12 -> res = "Пс 18.8; 1 Тим 1.8"
                14 -> res = "Ис 50.1"
                15 -> res = "Гал 5.17"
                18 -> res = "Быт 8.21"
                22 -> res = "Пс 1.2; Еф 3.16"
                23 -> res = "Иак 4.1; Гал 5.17"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Рим 5.1"
                2 -> res = "Ин 6.63; 8.36; 1 Кор 15.45; 2 Кор 3.7"
                3 -> res = "2 Кор 5.21; Гал 3.13; Евр 7.18"
                5 -> res = "Ин 3.6; 1 Кор 2.14"
                6 -> res = "Рим 6.21"
                7 -> res = "Иак 4.4"
                8 -> res = "Евр 11.6"
                9 -> res = "1 Кор 3.16"
                11 -> res = "Рим 6.4"
                12 -> res = "Рим 6.7"
                13 -> res = "Гал 5.19"
                14 -> res = "Гал 5.18"
                15 -> res = "1 Ин 4.18; 1 Кор 2.12; Евр 2.15"
                16 -> res = "Еф 4.30"
                17 -> res = "Гал 4.7"
                18 -> res = "1 Пет 4.13"
                19 -> res = "2 Пет 3.13"
                23 -> res = "Лк 21.28; 1 Ин 3.2; 2 Кор 5.4; Еф 4.30"
                24 -> res = "Евр 11.1"
                27 -> res = "1 Цар 16.7; Ин 14.17"
                28 -> res = "Еф 1.4"
                29 -> res = "2 Кор 3.18; Кол 1.18"
                30 -> res = "Рим 5.9; 9.24"
                31 -> res = "Пс 55.12"
                32 -> res = "Ин 3.16"
                33 -> res = "Ис 50.9; Откр 12.10"
                34 -> res = "1 Ин 2.1"
                35 -> res = "1 Ин 2.28; 2 Кор 12.10"
                36 -> res = "Пс 43.23"
                37 -> res = "1 Ин 5.5; 1 Кор 15.57; Откр 12.11"
                38 -> res = "Еф 6.12"
            }
        }
        if (glava == 9) {
            when (stih) {
                3 -> res = "Исх 32.32"
                4 -> res = "Исх 4.22; 20.1; 1 Цар 4.21"
                5 -> res = "Мф 1.1; Лк 3.23"
                6 -> res = "Чис 23.19; Рим 3.3"
                7 -> res = "Быт 21.12; Евр 11.18"
                8 -> res = "Гал 4.28"
                9 -> res = "Быт 18.10"
                10 -> res = "Быт 25.21"
                12 -> res = "Быт 25.23"
                13 -> res = "Мал 1.2-3"
                14 -> res = "Втор 32.4"
                15 -> res = "Исх 33.19"
                17 -> res = "Исх 9.16; 14.4"
                19 -> res = "Ис 46.10; Иер 49.19"
                20 -> res = "Ис 29.16; 45.9"
                21 -> res = "Иер 18.4, 6; 2 Тим 2.20"
                22 -> res = "Рим 2.4"
                23 -> res = "Рим 8.28"
                24 -> res = "Рим 3.29"
                25 -> res = "Ос 2.23; 1 Пет 2.10"
                26 -> res = "Ос 1.10"
                28 -> res = "Ис 10.22-23"
                29 -> res = "Ис 1.9; Быт 19.24"
                30 -> res = "Рим 10.20"
                31 -> res = "Рим 11.7"
                33 -> res = "Ис 8.14; 28.16; Пс 117.22; Мф 21.44; Мк 12.10; Лк 2.34; 20.17"
            }
        }
        if (glava == 10) {
            when (stih) {
                3 -> res = "Флп 3.9"
                4 -> res = "Гал 3.24"
                5 -> res = "Лев 18.5; Иез 20.11; Гал 3.12"
                6 -> res = "Втор 30.12"
                8 -> res = "Втор 30.14"
                9 -> res = "Мф 10.32"
                11 -> res = "Ис 28.16"
                12 -> res = "Деян 10.34; Рим 3.29"
                13 -> res = "Иоил 2.32; Деян 2.21"
                15 -> res = "Ис 52.7; Наум 1.15"
                16 -> res = "Ис 53.1; Ин 12.38"
                18 -> res = "Пс 18.5; Мф 24.14; 28.19"
                19 -> res = "Втор 32.21; Рим 11.11"
                20 -> res = "Ис 65.1"
                21 -> res = "Ис 65.2"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "1 Цар 12.22; 2 Кор 11.22; Флп 3.5"
                3 -> res = "3 Цар 19.14"
                4 -> res = "3 Цар 19.18"
                6 -> res = "Втор 9.4; Рим 4.5; Гал 5.4"
                8 -> res = "Втор 29.4; Ис 29.10; 6.9; Мф 13.14; Мк 4.12; Лк 8.10; Ин 12.40"
                10 -> res = "Пс 68.23-24"
                11 -> res = "Деян 13.47; Рим 10.19"
                14 -> res = "1 Кор 9.22"
                15 -> res = "2 Кор 5.19"
                17 -> res = "Иер 11.16; Еф 2.12"
                18 -> res = "Ис 66.2; Рим 12.16"
                22 -> res = "Ин 15.2"
                25 -> res = "Лк 21.24"
                27 -> res = "Ис 27.9; 59.20-21; Иер 31.31-33; Евр 8.10"
                29 -> res = "Чис 23.19"
                30 -> res = "Тит 3.5"
                32 -> res = "Рим 3.9; Гал 3.22"
                33 -> res = "Иов 9.10; 36.23"
                34 -> res = "Ис 40.13; Прем 9.13; Иер 23.18; 1 Кор 2.16"
                35 -> res = "Иов 35.7"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "1 Кор 3.17"
                2 -> res = "Еф 1.18; 5.10, 17"
                3 -> res = "Еф 4.7"
                4 -> res = "1 Кор 12.12"
                6 -> res = "Мф 25.15; 1 Пет 4.10; 1 Кор 12.4"
                8 -> res = "Мф 6.2"
                9 -> res = "Пс 96.10; Ам 5.15"
                10 -> res = "1 Пет 2.17; Еф 4.2"
                12 -> res = "Лк 18.1"
                13 -> res = "1 Кор 16.1; Евр 13.2"
                14 -> res = "Мф 5.44"
                15 -> res = "1 Кор 12.26"
                16 -> res = "Притч 3.7; Ис 5.21; Ин 17.11"
                17 -> res = "Притч 20.22; 2 Кор 8.21"
                18 -> res = "Евр 12.14"
                19 -> res = "Втор 32.35; Мф 5.39; Лк 6.28; 1 Кор 6.7"
                20 -> res = "Притч 25.21-22"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Прем 6.3; Дан 2.21; 1 Пет 2.13; Тит 3.1"
                3 -> res = "1 Пет 2.14; 3.13"
                7 -> res = "Мф 22.21; Мк 12.17; Лк 20.25"
                8 -> res = "Кол 3.14; 1 Тим 1.5"
                9 -> res = "Лев 19.18; Исх 20.14; Втор 5.18; Мф 22.39; Мк 12.31; Лк 10.27; Иак 2.8; Гал 5.14"
                11 -> res = "Еф 5.14"
                12 -> res = "Деян 17.30; 2 Кор 4.6; Еф 5.11"
                13 -> res = "Лк 21.34"
                14 -> res = "1 Пет 2.11; Гал 5.16"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Рим 15.1; 1 Кор 8.12"
                2 -> res = "1 Кор 10.25"
                4 -> res = "Иак 4.12"
                6 -> res = "1 Кор 10.31; 1 Тим 4.4"
                7 -> res = "1 Пет 4.2; 2 Кор 5.15; 1 Фес 5.10"
                9 -> res = "Мф 28.18; Деян 10.42"
                10 -> res = "Мф 7.1-2; 2 Кор 5.10"
                11 -> res = "Ис 45.23; Мф 26.64; Флп 2.10"
                12 -> res = "Мф 12.36"
                13 -> res = "Мф 18.7"
                14, 20 -> res = "Мф 15.11"
                15 -> res = "1 Кор 8.11"
                17 -> res = "1 Кор 8.8; Гал 5.22"
                22 -> res = "1 Ин 3.21"
                23 -> res = "Тит 1.15"
                24 -> res = "1 Кор 2.7"
                25 -> res = "Ис 42.16"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Рим 14.1; 1 Кор 9.22"
                2 -> res = "1 Кор 10.24"
                3 -> res = "Пс 68.10"
                4 -> res = "Рим 4.23-24"
                5 -> res = "1 Кор 1.10; Флп 2.2"
                7 -> res = "Ин 17.24"
                8 -> res = "Деян 3.25; Рим 3.30"
                9 -> res = "Пс 17.50; 2 Цар 22.50"
                10 -> res = "Втор 32.43"
                11 -> res = "Пс 116.1"
                12 -> res = "Ис 11.10; Откр 5.5"
                13 -> res = "Рим 12.12; 14.17"
                16 -> res = "Ис 66.19; Деян 9.15; Рим 12.2"
                20 -> res = "1 Кор 3.10; 2 Кор 10.15"
                21 -> res = "Ис 52.15"
                22 -> res = "Рим 1.13"
                23 -> res = "1 Фес 3.10"
                25 -> res = "Деян 24.17"
                26 -> res = "1 Кор 16.1; 2 Кор 8.4"
                27 -> res = "1 Кор 9.11"
                29 -> res = "Рим 1.11"
                30 -> res = "2 Кор 1.11"
                31 -> res = "Деян 20.23"
                32 -> res = "Рим 1.10"
                33 -> res = "Рим 16.20; 1 Кор 14.33"
            }
        }
        if (glava == 16) {
            when (stih) {
                3 -> res = "Деян 18.2"
                4 -> res = "Мф 18.20"
                16 -> res = "1 Пет 5.14; 1 Кор 16.20; 2 Кор 13.12"
                17 -> res = "Мф 18.17; Деян 15.24; 1 Кор 5.11; Гал 5.9; Флп 3.2; Кол 2.8"
                18 -> res = "Флп 3.18-19"
                20 -> res = "Откр 12.10"
                21 -> res = "Деян 16.1; Флп 2.19"
            }
        }
        return res
    }

    fun kniga64(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Деян 18.17; Рим 1.1"
                2 -> res = "Ин 17.19; Деян 15.9; 1 Фес 4.7; 2 Тим 2.19"
                3 -> res = "1 Пет 1.2"
                4 -> res = "2 Фес 1.3"
                5 -> res = "Кол 1.9"
                6 -> res = "1 Кор 2.2"
                7 -> res = "1 Кор 12.11; Флп 3.20; Тит 2.13"
                8 -> res = "1 Фес 3.13"
                9 -> res = "1 Фес 5.24"
                10 -> res = "Рим 15.5; Флп 2.2"
                12 -> res = "Деян 18.24"
                13 -> res = "Еф 4.5"
                14 -> res = "Деян 18.8"
                17 -> res = "2 Пет 1.16; 1 Кор 2.13"
                18 -> res = "Деян 17.18; Рим 1.16"
                19 -> res = "Ис 29.14"
                20 -> res = "Ис 33.18; 44.25"
                21 -> res = "Мф 11.25"
                22 -> res = "Мф 12.38; 16.1"
                23 -> res = "Ис 8.14; Деян 17.18; Рим 9.32"
                24 -> res = "Рим 1.16; Кол 2.3"
                26 -> res = "Ин 7.48; Иак 2.5"
                27 -> res = "2 Кор 10.5"
                29 -> res = "Рим 3.27; Еф 2.9"
                30 -> res = "Иер 23.5; Ин 17.19; 1 Пет 1.18; Кол 2.3"
                31 -> res = "Иер 9.24; 2 Кор 10.17"
            }
        }
        if (glava == 2) {
            when (stih) {
                1, 13 -> res = "1 Кор 1.17"
                2 -> res = "1 Кор 1.23; 15.3; Флп 3.8"
                3 -> res = "Деян 18.1"
                4 -> res = "2 Пет 1.16"
                5 -> res = "2 Кор 6.7"
                6 -> res = "Иак 3.15"
                7 -> res = "Рим 14.24; Еф 3.9"
                8 -> res = "Мф 11.25; Деян 13.27; 2 Кор 3.14"
                9 -> res = "Ис 64.4"
                10 -> res = "Мф 13.11; Мк 4.11; Ин 14.26"
                11 -> res = "Рим 11.33"
                12 -> res = "Рим 8.15"
                14 -> res = "Рим 8.5"
                15 -> res = "Притч 28.5"
                16 -> res = "Прем 9.13; Ис 40.13; Рим 11.34"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Еф 4.14"
                2 -> res = "1 Пет 2.2"
                4 -> res = "1 Кор 1.12"
                5 -> res = "Рим 12.6"
                6 -> res = "Мк 16.20; Деян 19.1"
                9 -> res = "Ис 5.1; 61.3"
                11 -> res = "Ис 28.16; Еф 2.22"
                13 -> res = "Ис 48.10; 1 Пет 1.7"
                16 -> res = "Ин 14.23; Рим 8.9; 1 Кор 6.19; 2 Кор 6.16; Гал 4.6; Евр 3.6"
                18 -> res = "Ис 5.21"
                19 -> res = "Иов 5.13"
                20 -> res = "Пс 93.11"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "2 Кор 6.4"
                2 -> res = "Мф 24.45; Лк 12.42"
                4 -> res = "Исх 34.7; Иов 9.2; Деян 23.1"
                5 -> res = "Мф 7.1; 25.21; Рим 2.1"
                6 -> res = "Притч 3.7; Рим 12.3"
                7 -> res = "Ин 3.27"
                9 -> res = "Пс 43.23; Рим 8.36; 2 Кор 4.11"
                12 -> res = "Мф 5.44; Лк 23.34; Деян 7.60; 20.34; 1 Фес 2.9; 2 Фес 3.8"
                15 -> res = "Гал 4.19; Флм 1.10"
                19 -> res = "Деян 18.21; Иак 4.15"
                20 -> res = "1 Кор 2.4"
                21 -> res = "2 Кор 13.10"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Лев 18.8"
                3 -> res = "Кол 2.5"
                5 -> res = "Пс 108.6; 1 Тим 1.20"
                6 -> res = "1 Кор 15.33; Гал 5.9; 2 Тим 2.17"
                7 -> res = "Ис 53.7"
                11 -> res = "Мф 18.17; Рим 16.17; 2 Фес 3.14"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Прем 3.8; Мф 19.28; Откр 20.4"
                7 -> res = "Мф 5.40; Лк 6.29; Рим 12.19; 1 Фес 5.15"
                9 -> res = "Гал 5.21; Еф 5.5"
                11 -> res = "Еф 2.2; Тит 3.3"
                12 -> res = "Сир 37.31; 1 Кор 10.23"
                13 -> res = "Мф 22.30; Рим 6.13, 19"
                14 -> res = "2 Кор 4.14; 1 Фес 4.14"
                15 -> res = "Еф 5.30"
                16 -> res = "Быт 2.24; Мф 19.5; Мк 10.7; Еф 5.31"
                19 -> res = "1 Пет 2.5; 1 Кор 3.16; 2 Кор 6.16"
                20 -> res = "Деян 20.28; 1 Пет 1.19; Гал 3.13"
            }
        }
        if (glava == 7) {
            when (stih) {
                3 -> res = "1 Пет 3.7"
                5 -> res = "Иоил 2.16"
                7 -> res = "Мф 19.12"
                9 -> res = "1 Тим 5.14"
                10 -> res = "Втор 24.1; Мф 5.32; 19.6; Мк 10.11; Лк 16.18"
                15 -> res = "Рим 12.18; 1 Кор 14.33"
                17 -> res = "Деян 15.28; Еф 4.1"
                18 -> res = "1 Мак 1.15"
                19 -> res = "Гал 5.6"
                20 -> res = "1 Фес 2.12"
                22 -> res = "Ин 8.36; Рим 6.22"
                23 -> res = "1 Кор 6.20"
                25 -> res = "2 Кор 2.17"
                29 -> res = "Иов 9.25; 14.1; Пс 102.15"
                31 -> res = "Ис 40.6; Иак 1.10; 4.14; 1 Пет 1.24; 1 Ин 2.17"
                39 -> res = "Рим 7.2"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "1 Кор 13.4"
                2 -> res = "1 Кор 13.12"
                3 -> res = "2 Тим 2.19"
                4 -> res = "Втор 4.39; 1 Тим 2.5"
                5 -> res = "Втор 10.17"
                6 -> res = "Мал 2.10; Ин 13.13"
                7 -> res = "Рим 14.23"
                8 -> res = "Рим 14.17"
                9 -> res = "Рим 14.13"
                11 -> res = "Рим 14.15"
                12 -> res = "Рим 14.1"
                13 -> res = "Рим 14.21"
            }
        }
        if (glava == 9) {
            when (stih) {
                1 -> res = "Деян 9.3; 22.18; 1 Кор 4.15; 15.8"
                2 -> res = "2 Кор 3.2"
                4 -> res = "Лк 10.7; 2 Фес 3.9"
                9 -> res = "Втор 25.4; 1 Тим 5.18"
                11 -> res = "Рим 15.27"
                12 -> res = "Деян 20.33; 2 Кор 11.8; 1 Фес 2.9"
                13 -> res = "Втор 18.8"
                14 -> res = "Мф 10.10"
                16 -> res = "Деян 9.6; 13.2"
                19 -> res = "1 Кор 10.33"
                21 -> res = "1 Кор 7.18"
                22 -> res = "Рим 15.1"
                24 -> res = "Флп 3.12; 2 Тим 4.7"
                25 -> res = "2 Тим 2.4; Откр 2.10"
                27 -> res = "Рим 6.18"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Исх 13.21; 14.22; Чис 9.18"
                3 -> res = "Исх 16.14; Пс 77.24; Прем 16.20"
                4 -> res = "Исх 17.6"
                5 -> res = "Чис 14.23; 26.65"
                6 -> res = "Чис 11.4"
                7 -> res = "Исх 32.6; Пс 105.19"
                8 -> res = "Чис 25.1, 9"
                9 -> res = "Чис 21.6; Пс 105.14"
                10 -> res = "Чис 14.37"
                11 -> res = "Рим 15.4"
                12 -> res = "Рим 11.20"
                13 -> res = "2 Пет 2.9; Евр 12.4"
                15 -> res = "1 Кор 1.5"
                16 -> res = "Мф 26.26; Деян 2.42, 46"
                17 -> res = "Ин 6.33"
                18 -> res = "Лев 7.15"
                19 -> res = "1 Кор 8.4"
                20 -> res = "Втор 32.17"
                21 -> res = "2 Кор 6.15"
                23 -> res = "1 Кор 6.12"
                24 -> res = "Рим 15.2"
                26 -> res = "Пс 23.1; Втор 10.14"
                28 -> res = "Пс 23.1"
                30 -> res = "Рим 14.6"
                31 -> res = "Кол 3.17"
                33 -> res = "Рим 15.2"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "1 Кор 4.16; Флп 3.17"
                2 -> res = "1 Кор 15.1"
                3 -> res = "Быт 3.16; Ин 14.28; Еф 5.23"
                7 -> res = "Быт 1.26; Кол 3.10"
                8 -> res = "Быт 2.21"
                18 -> res = "1 Кор 3.3"
                19 -> res = "Лк 17.1"
                23 -> res = "Мф 26.26; Мк 14.22; Лк 22.19; 1 Кор 10.16"
                27 -> res = "Евр 10.29"
                28 -> res = "2 Кор 13.5"
                31 -> res = "Пс 31.5"
            }
        }
        if (glava == 12) {
            when (stih) {
                2 -> res = "Еф 2.12"
                3 -> res = "Мф 16.17; Мк 9.39; Флп 2.11"
                4 -> res = "Еф 4.11"
                7 -> res = "Мф 25.15"
                9 -> res = "Мк 16.17-18"
                10 -> res = "Деян 2.4"
                12 -> res = "Рим 12.4"
                13 -> res = "Мк 1.8; Гал 3.28"
                27 -> res = "Еф 5.23"
                28 -> res = "Рим 12.6; Еф 4.11"
            }
        }
        if (glava == 13) {
            when (stih) {
                2 -> res = "Мф 7.22"
                3 -> res = "Мф 6.1"
                4 -> res = "Притч 10.12; 1 Пет 4.8; Флп 2.3"
                5 -> res = "Рим 15.1"
                7 -> res = "Гал 6.2"
                9 -> res = "2 Кор 5.7"
                12 -> res = "Флп 3.12; 2 Тим 2.19"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Чис 11.29"
                15 -> res = "Кол 3.16"
                20 -> res = "Мф 18.4; Мк 10.14; Рим 16.19"
                21 -> res = "Ис 28.11-12"
                25 -> res = "Ис 45.14"
                26 -> res = "1 Кор 12.8"
                33 -> res = "1 Кор 12.25; 1 Фес 5.23"
                34 -> res = "Быт 3.16; Кол 3.18; 1 Тим 2.11"
            }
        }
        if (glava == 15) {
            when (stih) {
                1 -> res = "Гал 1.11"
                2 -> res = "Рим 1.16"
                3 -> res = "Пс 21.7; Ис 53.5; Дан 9.24; Зах 13.7"
                4 -> res = "Пс 15.10; Ис 53.11; Ос 6.2-3; Иона 2.1"
                5 -> res = "Мф 28.17; Мк 16.14; Лк 24.34"
                8 -> res = "Деян 9.3"
                9 -> res = "Деян 8.3; Еф 3.8; 1 Тим 1.13"
                10 -> res = "Мф 10.20; Мк 16.20; Еф 3.7"
                12 -> res = "Деян 17.18; 2 Тим 2.18"
                13 -> res = "Ин 11.25; Рим 8.11"
                17 -> res = "Деян 13.38; Рим 4.25"
                20 -> res = "Деян 26.23; Кол 1.18; Откр 1.5"
                21 -> res = "Быт 2.17; 3.19; Ин 6.39"
                23 -> res = "1 Фес 4.15-16"
                24 -> res = "Дан 7.14; Мф 28.18; 1 Тим 6.15"
                25 -> res = "Пс 109.1; Деян 2.34; Евр 1.13"
                26 -> res = "Откр 20.14"
                27 -> res = "Пс 8.7; Евр 2.8"
                28 -> res = "1 Кор 11.3"
                30 -> res = "2 Кор 11.26"
                31 -> res = "Рим 8.36"
                32 -> res = "Прем 2.6; Ис 22.13; Лк 12.19"
                34 -> res = "Рим 13.11"
                36 -> res = "Ин 12.24"
                42 -> res = "Дан 12.3"
                44 -> res = "Мф 22.30"
                45 -> res = "Рим 5.18; Быт 2.7"
                47 -> res = "Быт 2.7; Ин 3.31"
                48 -> res = "Ин 3.6"
                49 -> res = "Быт 5.3; Рим 8.29"
                50 -> res = "Ин 1.13; 3.3"
                51 -> res = "1 Фес 4.17"
                52 -> res = "Мф 24.31; Ин 5.28; 1 Фес 4.16"
                54 -> res = "Ис 25.8"
                55 -> res = "Ос 13.14"
                56 -> res = "Рим 4.15"
                57 -> res = "1 Ин 5.4-5"
                58 -> res = "Кол 1.23"
            }
        }
        if (glava == 16) {
            when (stih) {
                1 -> res = "Рим 12.13"
                3 -> res = "2 Кор 8.19"
                7 -> res = "Иак 4.15; 1 Кор 4.19"
                13 -> res = "Мф 24.42; 1 Пет 5.8; Откр 3.11, 20"
                15 -> res = "1 Кор 1.16"
                19 -> res = "2 Тим 4.19"
                20 -> res = "1 Пет 5.14; Рим 16.16; 2 Кор 13.12"
            }
        }
        return res
    }

    fun kniga65(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                2 -> res = "1 Кор 1.3"
                3 -> res = "Исх 34.6; 1 Пет 1.3"
                4 -> res = "Пс 33.20"
                5 -> res = "Кол 1.24"
                11 -> res = "Рим 15.30; 2 Кор 4.15"
                12 -> res = "Деян 23.1; 2 Кор 2.17; 4.2; 7.14"
                15 -> res = "1 Кор 4.19"
                17 -> res = "Мф 5.37"
                20 -> res = "Чис 23.19"
                21 -> res = "1 Ин 2.20"
                22 -> res = "Рим 8.15; 2 Кор 5.5; Откр 2.17"
            }
        }
        if (glava == 2) {
            when (stih) {
                3 -> res = "2 Кор 1.14"
                4 -> res = "1 Кор 5.1"
                6 -> res = "1 Кор 5.5"
                11 -> res = "Лк 22.31; 1 Пет 5.8"
                15 -> res = "1 Кор 1.18; 2 Кор 4.3"
                16 -> res = "Лк 2.34; 2 Кор 3.5"
                17 -> res = "2 Кор 1.12; 4.2; 11.15; 1 Тим 6.5; Тит 1.11"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "2 Кор 1.12"
                2 -> res = "1 Кор 9.2"
                3 -> res = "Иез 11.19; Евр 8.10"
                5 -> res = "Ин 15.5; 1 Кор 15.10"
                6 -> res = "Иер 31.33; Ин 6.63"
                7 -> res = "Исх 34.30"
                13 -> res = "Рим 10.4"
                14 -> res = "Ис 6.10; 1 Кор 2.8"
                16 -> res = "Исх 34.34"
                17 -> res = "Ин 4.24"
                18 -> res = "1 Кор 15.49; 2 Кор 4.6"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "Деян 23.9; 2 Кор 2.17"
                3 -> res = "1 Кор 1.18"
                4 -> res = "Ин 14.9; Кол 1.15; Евр 1.3"
                5 -> res = "1 Кор 2.2; 3.5"
                6 -> res = "Быт 1.3; 1 Пет 2.9"
                7 -> res = "1 Кор 2.5; 2 Кор 3.5"
                9 -> res = "Пс 36.24"
                10 -> res = "Гал 6.17"
                11 -> res = "Рим 8.17"
                13 -> res = "Пс 115.1"
                14 -> res = "1 Кор 6.14; 1 Фес 1.10"
                16 -> res = "1 Пет 3.4; Еф 3.16"
                17 -> res = "Рим 8.18"
                18 -> res = "Евр 11.1"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Иов 4.19; Евр 9.11"
                2 -> res = "Рим 8.23"
                3 -> res = "Ис 61.10; Откр 16.15"
                4 -> res = "1 Кор 15.54"
                5 -> res = "2 Кор 1.22"
                7 -> res = "Рим 8.25"
                8 -> res = "Флп 1.23"
                10 -> res = "Иов 34.11; Мф 16.27; 25.32; Рим 14.10"
                13 -> res = "2 Кор 11.11"
                15 -> res = "Рим 14.9; Гал 2.20"
                17 -> res = "Ис 43.18-19; Рим 6.4; Откр 21.5"
                18 -> res = "Рим 5.11; Еф 2.16; Кол 1.20"
                21 -> res = "Ис 53.9; Ин 8.46; 1 Пет 2.22; 1 Ин 3.5"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Ис 49.8; Лк 4.19; Евр 3.7"
                4 -> res = "1 Кор 4.1; 2 Кор 12.10"
                10 -> res = "Притч 13.7"
                15 -> res = "3 Цар 18.21; Сир 13.21"
                16 -> res = "Лев 26.12; Иер 31.1; 1 Кор 3.16; 6.19"
                17 -> res = "Ис 52.11; Иер 50.8; Откр 18.4"
                18 -> res = "Иер 3.19; Ос 1.10"
            }
        }
        if (glava == 7) {
            when (stih) {
                6 -> res = "2 Кор 1.4"
                10 -> res = "1 Пет 2.19"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "Мк 12.44; Рим 12.8"
                9 -> res = "Мф 8.20; Лк 2.7; Ин 1.16; Флп 2.7"
                12 -> res = "Притч 3.28"
                15 -> res = "Исх 16.18"
                21 -> res = "Притч 3.4; Рим 12.17; Флп 4.8"
            }
        }
        if (glava == 9) {
            when (stih) {
                6 -> res = "Притч 19.7; 22.9"
                7 -> res = "Втор 15.7; Сир 35.8; 2 Кор 8.2"
                8 -> res = "1 Тим 6.6"
                9 -> res = "Пс 111.9"
                10 -> res = "Ис 55.10"
            }
        }
        if (glava == 10) {
            when (stih) {
                2 -> res = "2 Кор 2.17"
                3 -> res = "1 Тим 1.18"
                4 -> res = "Иер 1.10; 2 Кор 6.7; Еф 6.13"
                5 -> res = "1 Кор 1.19; 3.19"
                7 -> res = "Ин 7.24"
                8 -> res = "2 Кор 13.10"
                10 -> res = "2 Кор 11.6"
                13 -> res = "2 Кор 12.5"
                15 -> res = "Рим 15.20"
                17 -> res = "Иер 9.24; 1 Кор 1.31"
                18 -> res = "Притч 27.2; 1 Кор 4.5"
            }
        }
        if (glava == 11) {
            when (stih) {
                2 -> res = "Ис 62.5; Ос 2.19"
                3 -> res = "Быт 3.4; Ин 8.44; 2 Пет 3.17; 1 Тим 6.3"
                5 -> res = "1 Кор 15.10"
                6 -> res = "1 Кор 2.1; 2 Кор 10.10"
                8 -> res = "Деян 20.33; 2 Фес 3.8"
                10 -> res = "Рим 9.1"
                13 -> res = "Деян 15.24"
                15 -> res = "Мф 7.15"
                18 -> res = "Флп 3.4"
                22 -> res = "Деян 22.3; Флп 3.5"
                24 -> res = "Втор 25.3"
                25 -> res = "Деян 14.19; 16.22; 27.41"
                27 -> res = "1 Кор 4.11"
                29 -> res = "1 Кор 9.22"
                31 -> res = "Рим 9.1; Гал 1.20"
                32 -> res = "Деян 9.24"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "Гал 1.12; 2.2"
                9 -> res = "Рим 5.3; 2 Кор 4.8; 11.30"
                13 -> res = "1 Кор 1.5"
                14 -> res = "Деян 20.33"
                15 -> res = "Кол 1.24; 1 Фес 2.8; 2 Тим 2.10"
                17 -> res = "2 Кор 7.2"
                19 -> res = "1 Кор 10.33"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Втор 19.15; 17.6; Мф 18.16; Ин 8.16; Евр 10.28"
                2 -> res = "2 Кор 10.2"
                4 -> res = "Рим 6.4"
                5 -> res = "1 Кор 11.28; Еф 3.17"
                10 -> res = "2 Кор 10.8"
                11 -> res = "1 Пет 3.8; Рим 15.5; Флп 2.2"
                12 -> res = "1 Пет 5.14; Рим 16.16; 1 Кор 16.20"
            }
        }
        return res
    }

    fun kniga66(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1, 15 -> res = "Деян 9.15"
                4 -> res = "Мф 20.28; Лк 1.74"
                7 -> res = "Деян 15.24"
                10 -> res = "1 Фес 2.4"
                11 -> res = "1 Кор 15.1"
                12 -> res = "Деян 26.16"
                13 -> res = "Деян 9.21"
                16 -> res = "Еф 3.8"
                18 -> res = "Деян 9.26"
                19 -> res = "Мф 13.55"
                20 -> res = "2 Кор 11.31"
                21 -> res = "Деян 9.30"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Флп 2.16"
                3 -> res = "Деян 16.3"
                4 -> res = "Гал 4.3"
                6 -> res = "Втор 10.17; 2 Пар 19.7; Иов 34.19; Деян 10.34; Рим 2.11; Еф 6.9"
                7 -> res = "Деян 9.15"
                10 -> res = "Деян 24.17; Рим 15.26; 1 Кор 16.1; 2 Кор 9.1"
                12 -> res = "Деян 21.20"
                14 -> res = "Деян 10.28"
                16 -> res = "Деян 13.38; Гал 3.11; Тит 3.7"
                17 -> res = "Рим 3.19, 24"
                19 -> res = "1 Пет 4.2; Рим 7.6; 2 Кор 5.15"
                20 -> res = "Рим 6.6; Тит 2.14"
                21 -> res = "Гал 5.2; Евр 7.11"
            }
        }
        if (glava == 3) {
            when (stih) {
                2 -> res = "Деян 2.38; 10.43"
                3 -> res = "Гал 5.7"
                6 -> res = "Быт 15.6; Иак 2.23; Рим 4.3"
                7 -> res = "Ин 8.39"
                8 -> res = "Быт 12.3"
                10 -> res = "Втор 27.26; Иер 11.3"
                11 -> res = "Авв 2.4; Рим 1.17; Евр 10.38"
                12 -> res = "Лев 18.5"
                13 -> res = "Втор 21.23; 1 Пет 2.24; Рим 8.3"
                14 -> res = "Ис 44.5; Деян 3.25"
                15 -> res = "Евр 9.17"
                16 -> res = "Быт 12.7; 15.5"
                17 -> res = "Исх 12.40; Деян 7.6"
                18 -> res = "Рим 8.17; Гал 2.21"
                19 -> res = "Исх 19.3; Деян 7.38"
                22 -> res = "Рим 3.9"
                24 -> res = "Рим 10.4"
                26 -> res = "Ин 1.12; Рим 8.15"
                27 -> res = "Рим 6.3"
                28 -> res = "Ин 17.21; Рим 10.12"
                29 -> res = "Еф 3.6"
            }
        }
        if (glava == 4) {
            when (stih) {
                3 -> res = "Гал 5.1; Кол 2.20"
                4 -> res = "Ис 7.14; Лк 1.31"
                5, 24 -> res = "Рим 8.15"
                7, 31 -> res = "Гал 3.29"
                8 -> res = "Еф 2.12"
                9 -> res = "1 Кор 13.12; Евр 7.18; 10.1"
                10 -> res = "Кол 2.16"
                22 -> res = "Быт 16.15; 21.2-3"
                23, 28 -> res = "Рим 9.8"
                26 -> res = "Ис 60.1; Евр 12.22; Откр 21.2"
                27 -> res = "Ис 54.1"
                29 -> res = "Быт 21.9"
                30 -> res = "Быт 21.10"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Деян 15.10; 1 Пет 2.16"
                2 -> res = "Гал 2.21"
                5 -> res = "Рим 5.5"
                6 -> res = "Рим 2.29"
                9 -> res = "1 Кор 5.6"
                11 -> res = "1 Кор 1.23"
                13 -> res = "1 Пет 2.16; 1 Кор 8.9"
                14 -> res = "Лев 19.18; Мф 5.43; Мк 12.31; Иак 2.8; Рим 13.8"
                17 -> res = "1 Пет 2.11; Рим 7.23"
                18 -> res = "Рим 6.14"
                19 -> res = "1 Кор 6.9"
                22 -> res = "Кол 3.12"
                24 -> res = "Гал 2.20"
                26 -> res = "Флп 2.3"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "1 Кор 10.12"
                2 -> res = "Ин 13.34; 1 Фес 5.14"
                3 -> res = "1 Кор 8.2"
                5 -> res = "Рим 14.12; 1 Кор 3.8"
                6 -> res = "Рим 15.27; 1 Кор 9.7"
                7 -> res = "Рим 2.6"
                9 -> res = "Мф 24.13; 2 Фес 3.13"
                14 -> res = "Рим 6.6"
                15 -> res = "Гал 5.6; Кол 3.11"
                16 -> res = "Флп 3.16"
                17 -> res = "2 Кор 4.10"
            }
        }
        return res
    }

    fun kniga67(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "1 Кор 1.1; 2 Кор 1.1"
                3 -> res = "1 Пет 1.3; 2 Кор 1.3"
                4 -> res = "Рим 8.29; 2 Тим 1.9"
                6 -> res = "Мф 3.17; Рим 5.15"
                7 -> res = "Рим 3.25"
                9 -> res = "Еф 3.9"
                10 -> res = "Дан 9.24; Мк 1.15; Гал 4.4; Кол 1.20"
                11 -> res = "Лк 7.30; Деян 20.27"
                13 -> res = "Еф 4.30"
                14 -> res = "2 Кор 5.5"
                16 -> res = "Флп 1.3"
                17 -> res = "1 Кор 12.8"
                18 -> res = "Деян 26.18"
                20 -> res = "Пс 109.1; Мк 16.19"
                21 -> res = "Кол 2.10"
                22 -> res = "Пс 8.7; Мф 28.18; 1 Кор 15.27; Еф 5.23; Кол 1.18; 2.10"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Кол 2.13"
                2 -> res = "Ин 12.31; 1 Кор 6.11; Кол 3.7"
                4 -> res = "Рим 2.4"
                5 -> res = "Рим 8.11"
                7 -> res = "Еф 3.8"
                8 -> res = "Деян 15.11"
                9 -> res = "Рим 3.20"
                10 -> res = "Ис 44.21; Тит 2.14; Евр 13.21"
                12 -> res = "Неем 2.20; Иез 13.9; Рим 9.4; Кол 1.21"
                13 -> res = "Деян 2.39"
                14 -> res = "Ис 9.6; Ин 16.33"
                15 -> res = "2 Кор 5.17"
                17 -> res = "Ис 57.19; Зах 9.10"
                18 -> res = "Ин 14.6; Рим 5.2; Евр 10.19"
                20 -> res = "Ис 28.16; 1 Пет 2.4"
                21 -> res = "Кол 2.19"
                22 -> res = "2 Кор 6.16"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Деян 21.33"
                2 -> res = "Деян 9.15; Гал 1.16"
                3 -> res = "Еф 1.9"
                5, 10 -> res = "1 Пет 1.12"
                6 -> res = "Рим 15.12"
                7 -> res = "Деян 9.15"
                8 -> res = "Рим 15.19; 1 Кор 15.9; Гал 1.16"
                9 -> res = "1 Пет 1.20; Рим 14.24; 1 Кор 2.7; Кол 1.26"
                12 -> res = "Еф 2.18"
                13 -> res = "2 Тим 2.10"
                15 -> res = "Еф 1.10"
                16 -> res = "Еф 1.7"
                17 -> res = "Ин 14.23"
                19 -> res = "Ин 1.16; Кол 2.9"
                20 -> res = "Рим 14.24"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Флп 1.27; Кол 1.10; 1 Фес 2.12"
                4 -> res = "Рим 12.5; 1 Кор 12.12"
                6 -> res = "Мал 2.10; Мк 12.29"
                7 -> res = "Рим 12.3; 1 Кор 12.11; 2 Кор 10.13"
                8 -> res = "Пс 67.19; Ин 3.13"
                11 -> res = "1 Кор 12.28"
                13 -> res = "1 Кор 14.20"
                15 -> res = "Рим 12.9; Еф 1.22; Кол 1.18"
                19 -> res = "Рим 1.24"
                22 -> res = "Кол 3.9; Евр 12.1"
                23 -> res = "1 Пет 4.2; Рим 6.4"
                24 -> res = "Кол 3.10"
                25 -> res = "Зах 8.16"
                26 -> res = "Пс 4.5"
                27 -> res = "Иак 4.7"
                29 -> res = "Мф 12.36; Еф 5.4"
                30 -> res = "Ис 7.13; Еф 1.13"
                32 -> res = "Мф 6.14; Мк 11.25"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Мф 5.48"
                2 -> res = "Ин 13.34; 1 Ин 3.11"
                3 -> res = "1 Кор 6.15"
                4 -> res = "Мф 12.36; Еф 4.29"
                5 -> res = "1 Кор 6.10"
                6 -> res = "Мф 24.4; Мк 13.5; Лк 21.8; 2 Фес 2.3"
                8 -> res = "Ин 8.12; 12.36"
                9 -> res = "Гал 5.22"
                11 -> res = "2 Кор 6.14; 1 Тим 5.20"
                13 -> res = "Ин 3.20"
                14 -> res = "Ис 60.1; Рим 6.4"
                15 -> res = "Кол 4.5"
                17 -> res = "Рим 12.2; 1 Фес 4.3"
                18 -> res = "Ис 5.11; Лк 21.34"
                19 -> res = "Кол 3.16"
                20 -> res = "Ис 63.7; Кол 3.17; 1 Фес 5.18"
                22 -> res = "Кол 3.18; Тит 2.5"
                23 -> res = "1 Кор 11.3; Еф 1.22"
                25 -> res = "Гал 1.4; Кол 3.19"
                26 -> res = "1 Пет 3.21; Тит 3.5; Евр 9.14"
                27 -> res = "Песн 4.7; 2 Кор 11.2; Еф 1.4"
                31 -> res = "Быт 2.24; Мф 19.5; Мк 10.7; 1 Кор 6.16"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Втор 5.16; Притч 23.22; Мф 15.4; Мк 7.10; Кол 3.20"
                3 -> res = "Исх 20.12"
                4 -> res = "Притч 13.25"
                5 -> res = "1 Пет 2.18; Кол 3.22; Тит 2.9"
                8 -> res = "2 Кор 5.10"
                9 -> res = "Втор 10.17; 2 Пар 19.7; Иов 34.19; Прем 6.7; Сир 35.12; Гал 2.6"
                11 -> res = "Рим 13.12; 1 Фес 5.8"
                12 -> res = "Ин 12.31; 14.30; Еф 2.2"
                14 -> res = "Лк 12.35; 1 Пет 1.13"
                17 -> res = "Ис 59.17; 1 Фес 5.8; Евр 4.12"
                18 -> res = "Лк 18.1; Кол 4.2"
                19 -> res = "2 Фес 3.1"
                20 -> res = "Деян 21.11"
                21 -> res = "Деян 20.4; Кол 4.7"
            }
        }
        return res
    }

    fun kniga68(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                3 -> res = "1 Фес 1.2"
                6 -> res = "Ин 6.29; 1 Фес 1.3"
                10 -> res = "1 Фес 5.23"
                11 -> res = "Мф 5.16; Ин 15.8"
                13 -> res = "Деян 21.11"
                14 -> res = "Еф 3.13"
                15 -> res = "2 Кор 2.17"
                21 -> res = "Гал 2.20"
                23 -> res = "2 Кор 5.8"
                26 -> res = "2 Кор 1.14; Флп 2.16"
                27 -> res = "Еф 4.1; Кол 1.10; 1 Фес 2.12"
                28 -> res = "Лк 12.4"
                29 -> res = "Деян 5.41"
                30 -> res = "1 Фес 2.2"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Кол 3.12"
                2 -> res = "Рим 15.5; Флп 3.16"
                3 -> res = "Лк 14.11; Рим 12.10"
                4, 21 -> res = "1 Кор 10.24"
                5 -> res = "Мф 11.29"
                6 -> res = "2 Кор 4.4; Кол 1.15"
                7 -> res = "Пс 21.7; Ис 49.6; Мф 20.28"
                8 -> res = "Мф 26.39; Евр 2.17"
                9 -> res = "Мф 28.18; Евр 1.4"
                10 -> res = "Ис 45.23; Рим 14.11; Откр 5.14"
                11 -> res = "Ин 13.13; 1 Кор 8.6"
                13 -> res = "2 Кор 3.5; Евр 13.21"
                14 -> res = "1 Пет 4.9"
                15 -> res = "Притч 4.18; Мф 5.14"
                16 -> res = "Флп 4.1"
                17 -> res = "2 Тим 4.6"
                19 -> res = "Деян 16.1"
                22 -> res = "Деян 16.2"
                29 -> res = "1 Фес 5.12"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "2 Кор 13.11"
                2 -> res = "Ис 56.10; 2 Кор 11.13"
                3 -> res = "Иер 4.4; Рим 2.29"
                5 -> res = "Деян 23.6; 26.5"
                6 -> res = "Деян 8.3"
                8 -> res = "Прем 5.3; Ис 53.11; Иер 9.24; Ин 17.3; Кол 2.2"
                9 -> res = "Рим 3.22; Евр 4.3"
                10 -> res = "Рим 6.5; 8.17"
                12 -> res = "1 Кор 13.12; 1 Тим 6.12"
                13 -> res = "Лк 9.62"
                14 -> res = "1 Кор 9.24"
                15 -> res = "Евр 5.14"
                16 -> res = "Рим 12.16; 15.5; 1 Кор 1.10"
                17 -> res = "Флп 4.9; 2 Фес 3.9"
                19 -> res = "2 Пет 2.1; Рим 16.18"
                20 -> res = "Тит 2.13; Евр 13.14"
                21 -> res = "1 Ин 3.2; 1 Кор 15.42-44"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "2 Кор 1.14; 1 Фес 2.19"
                2 -> res = "Флп 2.2"
                3 -> res = "Исх 32.32; Лк 10.20; Откр 3.5"
                5 -> res = "Иак 5.9; 1 Пет 4.7"
                6 -> res = "Мф 6.25; 1 Тим 2.1"
                7 -> res = "Ин 14.27; Кол 3.15"
                8 -> res = "Мф 5.16; Рим 13.13"
                9 -> res = "Рим 15.33"
                11 -> res = "1 Тим 6.6"
                12 -> res = "2 Кор 6.10"
                13 -> res = "2 Кор 12.9"
                17 -> res = "2 Кор 12.14"
                19 -> res = "Пс 22.1; Еф 3.16"
            }
        }
        return res
    }

    fun kniga69(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                3 -> res = "Флп 1.3"
                4 -> res = "Евр 6.10"
                6 -> res = "Мф 13.8; Ин 15.16"
                9 -> res = "Рим 12.2"
                10 -> res = "Еф 4.1; Флп 1.27; 1 Фес 2.12"
                11 -> res = "Деян 5.41"
                12 -> res = "Деян 26.18"
                13 -> res = "Мф 3.17; Евр 2.15"
                14 -> res = "Рим 3.25"
                15 -> res = "Притч 8.22; Евр 1.3"
                16 -> res = "Ин 1.3; Еф 3.9; Евр 1.2"
                17 -> res = "Ин 1.1"
                18 -> res = "Рим 8.29; 1 Кор 15.20; Еф 1.22"
                19 -> res = "Кол 2.9"
                20 -> res = "Ис 9.6; Лк 2.14"
                22 -> res = "Лк 1.75; Рим 5.10; 1 Кор 1.2; Еф 1.4; Тит 2.14"
                24 -> res = "Рим 5.3"
                25 -> res = "1 Кор 4.1; 9.17"
                26 -> res = "Рим 14.24; Еф 3.9"
                27 -> res = "Рим 9.23; Еф 3.17"
                28 -> res = "2 Кор 11.2"
                29 -> res = "1 Кор 15.10; Флп 2.13"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Флп 3.8"
                3 -> res = "1 Кор 1.30"
                5 -> res = "1 Кор 5.3"
                7 -> res = "1 Кор 1.5; Еф 3.17"
                8 -> res = "Еф 5.6; Евр 13.9"
                9 -> res = "Ин 1.14; Кол 1.19"
                10 -> res = "Еф 1.22"
                11 -> res = "Рим 2.29; Гал 3.27"
                12 -> res = "Рим 6.4; Еф 1.19"
                13 -> res = "Еф 2.1"
                14 -> res = "Еф 2.15"
                15 -> res = "Еф 4.8; Евр 2.14"
                16 -> res = "Рим 14.6"
                17 -> res = "Евр 10.1"
                18 -> res = "2 Кор 11.14"
                19 -> res = "Еф 4.15"
                20 -> res = "Рим 7.4"
                22 -> res = "Ис 29.13; Мф 15.9"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Мк 16.19; Рим 8.34"
                2 -> res = "Флп 3.20"
                3 -> res = "Рим 8.24; Гал 2.20"
                4 -> res = "1 Ин 3.2; Флп 3.21"
                5 -> res = "Еф 5.3"
                6 -> res = "1 Кор 6.9"
                8 -> res = "Рим 6.4; Еф 4.22; Евр 12.1"
                9 -> res = "Лев 19.11; Еф 4.25"
                10 -> res = "Быт 1.27; 5.1; 9.6; Еф 4.24"
                11 -> res = "Гал 6.15"
                12 -> res = "Еф 4.32"
                13 -> res = "Мф 6.14; Рим 13.8; 15.1"
                15 -> res = "Еф 4.3; Флп 4.7"
                16 -> res = "Еф 5.19"
                17 -> res = "Евр 13.15"
                18 -> res = "Еф 5.22"
                19 -> res = "1 Пет 3.7"
                20 -> res = "Еф 6.1"
                22 -> res = "1 Пет 2.18; Еф 6.5; Тит 2.9"
                25 -> res = "Деян 10.34; Еф 6.9"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "Лк 18.1; Еф 6.18"
                3 -> res = "1 Кор 16.9"
                5 -> res = "Еф 5.15"
                6 -> res = "Еккл 10.12"
            }
        }
        return res
    }

    fun kniga70(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Деян 16.1; Гал 1.3"
                2 -> res = "Флп 1.3; 2 Фес 1.3"
                3 -> res = "Деян 17.4"
                5 -> res = "Рим 15.19"
                6 -> res = "Флп 3.17"
                10 -> res = "Ос 13.14"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Деян 16.22"
                3 -> res = "2 Кор 2.17"
                4 -> res = "Иер 17.10"
                7 -> res = "2 Тим 2.24"
                9 -> res = "Деян 18.3; 1 Кор 4.12; 2 Фес 3.8"
                12 -> res = "Еф 4.1; Флп 1.27; Кол 1.10"
                14 -> res = "Евр 10.34"
                15 -> res = "Мф 23.34"
                19 -> res = "2 Кор 1.14"
                20 -> res = "Флп 4.1"
            }
        }
        if (glava == 3) {
            when (stih) {
                2 -> res = "Деян 16.1"
                3 -> res = "2 Тим 3.12"
                10 -> res = "Рим 1.10"
                13 -> res = "1 Кор 1.8; Флп 1.10; 1 Фес 5.23"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Флп 1.27"
                3 -> res = "Рим 6.22; 12.2"
                4 -> res = "1 Кор 6.18"
                6 -> res = "1 Тим 6.10"
                7 -> res = "1 Кор 1.2; Еф 1.4"
                8 -> res = "Лк 10.16; 1 Кор 2.10"
                9 -> res = "Ин 13.34; 15.12; 1 Ин 3.11"
                11 -> res = "Еф 4.28; 2 Фес 3.10"
                12 -> res = "Рим 13.13"
                14 -> res = "1 Кор 15.20"
                15 -> res = "1 Кор 15.51"
                16 -> res = "Мф 24.31; 2 Фес 1.7"
                17 -> res = "Ин 14.3; 17.24"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Деян 1.7"
                2 -> res = "Мф 24.43; 2 Пет 3.10; Откр 3.3; 16.15"
                3 -> res = "Лк 21.35"
                5 -> res = "Рим 13.12"
                6 -> res = "Мф 24.42"
                8 -> res = "Ис 59.17; Еф 6.14"
                9 -> res = "2 Фес 2.14"
                10 -> res = "Рим 14.9"
                14 -> res = "Гал 6.2"
                15 -> res = "Притч 17.13; Мф 5.39; 1 Пет 3.9; Рим 12.17"
                17 -> res = "Лк 18.1; Кол 4.2"
                20 -> res = "1 Кор 14.1"
                21 -> res = "1 Ин 4.1"
                23 -> res = "1 Фес 3.13"
                24 -> res = "1 Кор 1.9"
                25 -> res = "Кол 4.3"
            }
        }
        return res
    }

    fun kniga71(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                3 -> res = "1 Фес 1.2"
                5 -> res = "Рим 8.17"
                6 -> res = "Рим 2.8"
                8 -> res = "Евр 12.29"
            }
        }
        if (glava == 2) {
            when (stih) {
                3 -> res = "Мф 24.4; Мк 13.5; Лк 21.8; Еф 5.6"
                4 -> res = "Дан 11.36; Откр 13.1"
                7 -> res = "Деян 20.29"
                8 -> res = "Ис 11.4; 1 Ин 2.18; Откр 19.15"
                11 -> res = "3 Цар 22.22; Мф 24.24"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Еф 6.19"
                3 -> res = "Ин 17.15"
                7 -> res = "1 Кор 11.1; 1 Фес 4.12"
                8 -> res = "Деян 20.34; 1 Кор 4.12; 1 Фес 2.9"
                9 -> res = "1 Кор 4.16"
                10 -> res = "Быт 3.19"
                13 -> res = "Гал 6.9"
                14 -> res = "Мф 18.17"
                16 -> res = "Флп 4.9; 1 Фес 5.23"
            }
        }
        return res
    }

    fun kniga72(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Кол 1.27"
                2 -> res = "Деян 16.1; Откр 1.4"
                4 -> res = "1 Тим 4.7; Тит 1.14"
                5 -> res = "Рим 13.8"
                8 -> res = "Рим 7.12"
                9 -> res = "Гал 5.23"
                11 -> res = "1 Фес 2.4"
                12 -> res = "Деян 9.15"
                13 -> res = "Гал 1.13"
                14 -> res = "1 Кор 15.10"
                15 -> res = "Мф 9.13; Мк 2.17; Лк 5.32"
                17 -> res = "Дан 7.14"
                18 -> res = "1 Тим 6.13"
                19 -> res = "1 Тим 3.9"
                20 -> res = "1 Кор 5.5"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Иер 29.7"
                4 -> res = "Иез 18.32; 33.11; 2 Пет 3.9"
                6 -> res = "Мф 20.28; Гал 1.4"
                7 -> res = "Деян 22.21; 2 Тим 1.11"
                8 -> res = "Мф 6.14; Иак 1.6"
                9 -> res = "1 Пет 3.3"
                11 -> res = "Быт 3.16"
                12 -> res = "1 Кор 14.34"
                13 -> res = "Быт 1.27"
                14 -> res = "Быт 3.6"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Деян 20.28"
                2 -> res = "Тит 1.7"
                3 -> res = "Лев 10.9; 1 Пет 5.2"
                9 -> res = "1 Тим 1.19"
                16 -> res = "Ин 1.14; 1 Пет 1.12; Рим 1.4; 10.18; Еф 3.10"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "2 Пет 3.3; 2 Тим 3.1"
                8 -> res = "Лев 26.3"
                16 -> res = "Иез 33.9; Дан 12.3"
            }
        }
        if (glava == 5) {
            when (stih) {
                5 -> res = "Лк 2.37"
                8 -> res = "Ис 58.7; Гал 6.10"
                10 -> res = "Быт 18.4"
                18 -> res = "Втор 25.4; Мф 10.10; Лк 10.7; 1 Кор 9.9"
                21 -> res = "1 Тим 6.13"
                23 -> res = "Пс 103.15"
            }
        }
        if (glava == 6) {
            when (stih) {
                1 -> res = "Иез 36.23; Тит 2.9"
                3 -> res = "1 Кор 2.2"
                6 -> res = "Притч 15.17"
                7 -> res = "Иов 1.21; Пс 48.18"
                8 -> res = "Быт 28.20"
                9, 17 -> res = "Мк 4.19; Лк 12.15"
                13 -> res = "Мф 27.11; Мк 15.2; Лк 23.3; Ин 18.37; 1 Тим 5.21"
                15 -> res = "1 Тим 1.11; Откр 17.14"
                16 -> res = "Ин 1.18; 1 Ин 4.12"
                19 -> res = "Мф 6.20; Лк 12.33"
                20 -> res = "1 Тим 1.4; 4.1"
            }
        }
        return res
    }

    fun kniga73(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                3 -> res = "Флп 3.3"
                6 -> res = "Деян 6.6"
                7 -> res = "Рим 8.15; Евр 2.15"
                8 -> res = "Мф 10.33"
                9 -> res = "Еф 1.4; Тит 3.5"
                10 -> res = "1 Пет 1.20; Рим 14.25; Еф 3.9; Кол 1.26; Тит 1.2"
                11 -> res = "1 Тим 2.7"
                13 -> res = "1 Ин 2.24; Рим 6.17"
                14 -> res = "1 Тим 6.20; Откр 3.11"
                16 -> res = "2 Тим 4.19"
                18 -> res = "Мф 25.34"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "2 Кор 10.4; Еф 6.10"
                2 -> res = "1 Тим 6.20"
                4 -> res = "1 Кор 9.25"
                8 -> res = "1 Кор 15.4"
                9 -> res = "Деян 21.11; 1 Кор 4.9"
                11 -> res = "Рим 6.4"
                12 -> res = "Мф 10.33; Мк 8.38; Лк 9.26"
                13 -> res = "Рим 3.3"
                16 -> res = "1 Тим 4.7; 6.20; Тит 1.14; 3.9"
                17 -> res = "1 Тим 1.20"
                19 -> res = "Чис 16.5, 26; Наум 1.7; Ин 10.14"
                20 -> res = "Рим 9.21"
                21 -> res = "Ис 52.11; 2 Тим 3.17"
                22 -> res = "Гал 5.16; 1 Тим 6.11"
                24 -> res = "Тит 3.2"
                25 -> res = "Деян 8.22"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "2 Пет 3.3; Иуд 1.18; 1 Тим 4.1"
                8 -> res = "Исх 7.11"
                12 -> res = "Мф 16.24; Деян 14.22; Рим 8.17"
                13 -> res = "Мф 7.16"
                15 -> res = "Ин 5.39; 1 Тим 4.8"
                16 -> res = "2 Пет 1.21"
            }
        }
        if (glava == 4) {
            when (stih) {
                1 -> res = "Ин 5.22; Деян 10.42"
                2 -> res = "2 Тим 2.24; 3.16"
                6 -> res = "Флп 2.17"
                7 -> res = "Флп 3.14; 1 Тим 6.12"
                8 -> res = "1 Кор 9.25; Откр 2.10"
                10 -> res = "Кол 4.14"
                12 -> res = "Деян 20.4"
                14 -> res = "1 Тим 1.20"
                17 -> res = "Деян 23.11; 1 Тим 1.12"
                18 -> res = "Рим 14.26; 1 Тим 6.16"
                19 -> res = "2 Тим 1.16"
                22 -> res = "Флм 1.25"
            }
        }
        return res
    }

    fun kniga74(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "1 Тим 3.16"
                2 -> res = "Чис 23.19; Рим 14.24"
                3 -> res = "Гал 1.15; Еф 3.8; Кол 1.28; 2 Тим 1.11"
                6 -> res = "1 Тим 3.4"
                7 -> res = "Лев 10.9; 1 Тим 3.3"
                9 -> res = "1 Тим 6.3"
                10 -> res = "Рим 16.17"
                14 -> res = "Мф 15.9; Мк 7.7; 1 Тим 1.4"
                15 -> res = "Мф 15.11; Рим 14.14"
                16 -> res = "2 Тим 3.5"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Тит 1.9"
                3 -> res = "1 Тим 2.9"
                5 -> res = "Быт 3.16; Еф 5.22"
                7 -> res = "1 Пет 5.3; 1 Тим 4.12"
                8 -> res = "1 Пет 2.12"
                9 -> res = "1 Пет 2.18; Еф 6.5; Кол 3.22"
                11 -> res = "Лк 1.47; 2.30; 3.6; Тит 3.4"
                12 -> res = "1 Ин 2.15; Еф 1.4"
                13 -> res = "Деян 24.25; 1 Ин 3.2"
                14 -> res = "Исх 19.6; Гал 1.4; Еф 2.10; Евр 9.14"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "1 Пет 2.13; Рим 13.1"
                2 -> res = "Кол 3.12"
                3 -> res = "1 Кор 6.11; Еф 2.1"
                4 -> res = "1 Тим 4.10; Тит 2.11"
                5 -> res = "Ин 3.5; Рим 3.28; 2 Тим 1.9"
                6 -> res = "Рим 5.5"
                8 -> res = "Еф 2.10"
                9 -> res = "1 Тим 1.4; 4.7; 2 Тим 2.23"
                13 -> res = "Деян 18.24"
                14 -> res = "Тит 2.14"
            }
        }
        return res
    }

    fun kniga75(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                4 -> res = "Еф 1.16; 1 Фес 1.2; 2 Фес 1.3"
                6 -> res = "Флп 1.11; Тит 2.14"
                10 -> res = "1 Кор 4.15; Кол 4.9"
                16 -> res = "Мф 12.49"
                22 -> res = "Флп 1.25"
            }
        }
        return res
    }

    fun kniga76(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                1 -> res = "Чис 12.6; 1 Пет 1.10"
                2 -> res = "Пс 2.8; Ис 9.6; Ин 1.3; 8.26; 15.15; Гал 4.4; Еф 1.10"
                3 -> res = "Пс 109.1; Прем 7.26; 2 Кор 4.4; Еф 1.7; Кол 1.15"
                4 -> res = "Флп 2.9"
                5 -> res = "Пс 2.7; 2 Цар 7.14; 1 Пар 17.13; Евр 5.5"
                6 -> res = "Пс 96.7"
                7 -> res = "Пс 103.4"
                8 -> res = "Лк 1.32"
                9 -> res = "Пс 44.7-8; Ис 61.1; Ин 3.34; Деян 4.27"
                11 -> res = "Ис 34.4; 51.6; Мф 24.35"
                12 -> res = "Пс 101.26-28"
                13 -> res = "Пс 109.1; Мк 12.36; 16.19; Еф 1.20"
                14 -> res = "Быт 19.16; Пс 33.8; 90.11; 102.21; Дан 7.10; Деян 5.19"
            }
        }
        if (glava == 2) {
            when (stih) {
                2 -> res = "Исх 20.1; Деян 7.38, 53; Гал 3.19; Евр 10.28"
                3 -> res = "Мф 4.17; Лк 1.2"
                4 -> res = "Мк 16.20"
                5 -> res = "Мф 28.18"
                6 -> res = "Пс 143.3"
                7 -> res = "Мф 27.46"
                8 -> res = "Пс 8.5-7; Мф 28.18; 1 Кор 15.27"
                9 -> res = "Ин 3.16; Флп 2.7, 11; Откр 5.9"
                10 -> res = "Притч 16.4; Лк 24.26; Ин 1.3"
                11 -> res = "Мф 28.10; Ин 20.17"
                12 -> res = "Пс 21.23"
                13 -> res = "Ис 8.17-18; 2 Цар 22.3"
                14 -> res = "Ин 1.14; Рим 8.3; 1 Кор 15.54; 2 Тим 1.10"
                15 -> res = "Лк 1.74; Рим 8.15"
                17 -> res = "Флп 2.7; Евр 5.2"
                18 -> res = "Евр 4.15"
            }
        }
        if (glava == 3) {
            when (stih) {
                1 -> res = "Евр 2.11"
                2 -> res = "Чис 12.7; Евр 2.17"
                3 -> res = "Агг 2.9; Зах 6.13"
                6 -> res = "Пс 2.7; 1 Кор 3.16; Еф 5.23; Кол 1.23; 1 Тим 3.15"
                8 -> res = "Исх 17.2; Пс 77.19"
                11 -> res = "Пс 94.7-11; Чис 14.23; Евр 4.11"
                13 -> res = "1 Фес 5.11"
                14 -> res = "2 Пет 1.4; Рим 8.17; Еф 5.30"
                15 -> res = "Евр 4.7"
                16 -> res = "Чис 14.4, 22"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "1 Пет 1.12"
                3 -> res = "Евр 3.11"
                4 -> res = "Быт 2.2; Исх 20.11"
                5 -> res = "Пс 94.11"
                7 -> res = "Евр 3.7-8"
                9 -> res = "Откр 7.14; 14.13"
                12 -> res = "Ис 49.2; 1 Пет 1.23; 2 Кор 10.4; Еф 6.17; Откр 1.16"
                13 -> res = "Пс 32.15; Иер 23.24"
                14 -> res = "Евр 6.20"
                15 -> res = "Ис 53.3, 9; Евр 2.17"
                16 -> res = "Рим 3.25; Еф 3.2"
            }
        }
        if (glava == 5) {
            when (stih) {
                4 -> res = "Чис 16.5, 40"
                5 -> res = "Пс 2.7; Ин 8.54; Евр 1.5"
                6 -> res = "Пс 109.4; Евр 7.17"
                7 -> res = "Мф 26.39; Мк 14.35-36; Лк 22.44; Ин 12.27"
                8 -> res = "Флп 2.7-8; Евр 1.5"
                11 -> res = "Мф 13.15; Ин 16.12"
                12 -> res = "Ин 3.10; 1 Пет 2.2; 1 Кор 3.1"
                13 -> res = "1 Кор 13.11; 14.20"
                14 -> res = "Еф 4.11-13; Флп 3.15"
            }
        }
        if (glava == 6) {
            when (stih) {
                4 -> res = "Мф 12.45"
                6 -> res = "2 Пет 2.20; 1 Ин 5.16; Евр 10.29"
                8 -> res = "Иер 26.6; 44.22; Мк 11.21"
                10 -> res = "Мф 10.42; 25.40"
                13 -> res = "Быт 22.16; Пс 104.9; Лк 1.73"
                14 -> res = "Быт 22.17"
                15 -> res = "Рим 4.17"
                16 -> res = "Исх 22.11"
                17 -> res = "Пс 32.11; Притч 19.21"
                19 -> res = "Лев 16.15"
                20 -> res = "Ин 14.2; Евр 4.14"
            }
        }
        if (glava == 7) {
            when (stih) {
                1 -> res = "Быт 14.18"
                5 -> res = "Чис 18.21; Втор 18.1; Нав 14.4"
                6 -> res = "Быт 12.2; 14.20"
                11 -> res = "Гал 2.21; Евр 8.7"
                14 -> res = "Быт 49.8; Мф 2.6; Откр 5.5"
                17 -> res = "Пс 109.4; Евр 5.6"
                18 -> res = "Ис 1.11; Рим 8.3; Гал 4.9"
                19 -> res = "Ин 1.17; Деян 13.39; Рим 5.2"
                21 -> res = "Пс 109.4"
                22 -> res = "Евр 8.6"
                25 -> res = "1 Ин 1.2; Рим 8.34; 1 Тим 2.5"
                26 -> res = "Исх 28.38; Лк 1.35; 1 Пет 2.22"
                27 -> res = "Лев 16.11"
                28 -> res = "Евр 7.20"
            }
        }
        if (glava == 8) {
            when (stih) {
                1 -> res = "Евр 1.3; 3.1; 4.14; 7.26"
                2 -> res = "Евр 10.21"
                3 -> res = "Еф 5.2"
                5 -> res = "Исх 25.40; Деян 7.44; Кол 2.17; Евр 10.1"
                6 -> res = "Евр 7.16; 9.13"
                8 -> res = "Иер 31.31-34; 32.37; Рим 11.27; Евр 10.16"
                10 -> res = "Иер 24.7; 32.38; Иез 11.20; Зах 8.8; 2 Кор 6.16"
                11 -> res = "Ис 54.13; 1 Ин 2.27"
                12 -> res = "Иер 31.31-34; Евр 10.17"
            }
        }
        if (glava == 9) {
            when (stih) {
                2 -> res = "Исх 40.1-4"
                4 -> res = "Исх 16.33; Чис 17.10; Втор 10.1; 3 Цар 8.9; 2 Пар 5.10"
                5 -> res = "Исх 25.18"
                7 -> res = "Исх 30.10; Лев 16.2"
                9 -> res = "Евр 7.19; 10.1"
                10 -> res = "Лев 11.2; Чис 19.7; Рим 14.17"
                11 -> res = "Евр 10.1"
                12 -> res = "Евр 10.12"
                13 -> res = "Лев 16.14; Чис 19.4"
                14 -> res = "Лк 1.74; Ин 17.19; 1 Ин 1.7; Тит 2.14; Откр 1.5"
                15, 28 -> res = "1 Пет 3.18; Рим 5.6"
                17 -> res = "Гал 3.15"
                19 -> res = "Исх 12.22; Лев 16.14"
                20 -> res = "Исх 24.8"
                27 -> res = "3 Езд 14.35"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Кол 2.17"
                2 -> res = "Лев 16.34"
                4 -> res = "Мих 6.7; Евр 9.12"
                6 -> res = "1 Цар 15.22"
                7 -> res = "Пс 39.7-9; Ин 5.46"
                10 -> res = "Евр 9.28"
                11 -> res = "Евр 9.9"
                12 -> res = "Евр 1.3"
                13 -> res = "Пс 109.1; 2.8; 1 Кор 15.25; Евр 1.13"
                16 -> res = "Рим 11.27; Евр 8.8"
                17 -> res = "Иер 31.33-34"
                19 -> res = "Ин 10.9; 14.6"
                20 -> res = "Мф 27.51"
                21 -> res = "1 Тим 3.15"
                22 -> res = "Лев 16.4; Иез 36.25; 2 Кор 7.1; Еф 5.26"
                25 -> res = "2 Пет 3.8"
                26 -> res = "Евр 6.4"
                27 -> res = "Соф 1.18"
                28 -> res = "Втор 17.6; 19.15; Мф 18.16; Ин 8.17; 2 Кор 13.1"
                30 -> res = "Втор 32.35-36; Рим 12.19"
                31 -> res = "Лк 12.5"
                34 -> res = "Деян 21.11"
                35 -> res = "Мф 5.12"
                38 -> res = "Авв 2.3-4; Рим 1.17; Гал 3.11"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Рим 8.24"
                3 -> res = "Быт 1.1; Пс 32.6"
                4 -> res = "Быт 4.4; Мф 23.35"
                5 -> res = "Быт 5.24; Сир 44.15; 49.16"
                7 -> res = "Быт 6.22; Сир 44.17; Иез 14.14"
                8 -> res = "Быт 12.4"
                10 -> res = "Евр 12.22"
                11 -> res = "Быт 17.19; 21.2; Рим 4.19"
                12 -> res = "Быт 15.5; 22.17"
                13 -> res = "Быт 23.4; 47.9"
                16 -> res = "Исх 3.15; Мф 22.32"
                17 -> res = "Быт 22.9"
                18 -> res = "Быт 21.12; Рим 9.7"
                20 -> res = "Быт 27.27"
                21 -> res = "Быт 47.31; 48.14"
                22 -> res = "Быт 50.24"
                23 -> res = "Исх 2.2; Деян 7.20"
                24 -> res = "Исх 2.11"
                27 -> res = "Исх 10.29; 13.17"
                28 -> res = "Исх 12.3, 7"
                29 -> res = "Исх 14.21"
                30 -> res = "Нав 6.19"
                31 -> res = "Нав 2.1; 6.24"
                32 -> res = "Суд 4.6; 7.15; 11.11; 13.24; 1 Цар 7.10; 17.45"
                33 -> res = "Дан 6.22"
                34 -> res = "1 Цар 14.6; 3 Цар 19.3; Ис 38.9; Дан 3.25"
                35 -> res = "3 Цар 17.22-23; 4 Цар 4.36"
                36 -> res = "Быт 39.20; Суд 16.25; Иер 20.2"
                37 -> res = "3 Цар 21.13; 2 Пар 24.21; Иер 26.23"
                38 -> res = "1 Цар 22.1; 3 Цар 17.3"
                39 -> res = "Лк 10.24"
            }
        }
        if (glava == 12) {
            when (stih) {
                1 -> res = "1 Пет 2.1; Рим 6.12; Еф 4.22; Кол 3.8"
                2 -> res = "Лк 23.46; Флп 2.8"
                3 -> res = "Лк 2.34; Деян 28.22; Гал 6.9"
                4 -> res = "1 Кор 10.13"
                5 -> res = "Откр 3.19"
                6 -> res = "Притч 3.11-12; Иов 5.17; Пс 93.12"
                9 -> res = "Чис 16.22; Иов 12.10; Еккл 12.7; Зах 12.1"
                10 -> res = "Мф 7.11; Тит 2.12"
                12 -> res = "Ис 35.3"
                14 -> res = "Рим 12.18; 2 Кор 7.1; 1 Фес 4.3"
                15 -> res = "Втор 29.18; Гал 5.9; 2 Тим 2.17"
                16 -> res = "Быт 25.33; 1 Кор 6.15"
                17 -> res = "Быт 27.34"
                18 -> res = "Исх 19.12"
                19 -> res = "Исх 20.19"
                20 -> res = "Исх 19.13"
                21 -> res = "Втор 33.2; Пс 67.18"
                22 -> res = "Гал 4.26; Откр 3.12"
                23 -> res = "Иер 31.9; Лк 10.20; Откр 13.8"
                24 -> res = "Быт 4.10; 1 Тим 2.5"
                25 -> res = "Евр 1.2; 2.1; 3.17"
                26 -> res = "Агг 2.6-7; Исх 19.18"
                27 -> res = "Пс 101.27; Мф 24.35"
                28 -> res = "Лк 1.33"
                29 -> res = "Втор 4.24; Чис 11.1; Пс 49.3; Дан 7.9"
            }
        }
        if (glava == 13) {
            when (stih) {
                2 -> res = "Быт 18.3; 19.2; Мф 25.35; Рим 12.13"
                4 -> res = "1 Кор 6.15"
                5 -> res = "Нав 1.5; Быт 28.15; Мф 6.3"
                6 -> res = "Пс 117.6"
                7 -> res = "1 Фес 5.12"
                8 -> res = "1 Кор 3.11; Откр 1.4"
                9 -> res = "Ин 6.27; Еф 4.14"
                10 -> res = "1 Кор 9.13"
                11 -> res = "Лев 16.27"
                12 -> res = "Мф 21.39; 27.33; Откр 1.5"
                13 -> res = "1 Пет 4.14; Евр 11.26; 12.2"
                14 -> res = "Флп 3.20; Евр 12.22"
                15 -> res = "Пс 49.14; 50.19; Ос 14.3"
                16 -> res = "2 Кор 9.12; Флп 4.18"
                17 -> res = "Иез 33.7; Мф 25.13; Деян 20.31; 1 Кор 4.1"
                18 -> res = "Деян 23.1; Рим 15.30"
                20 -> res = "Ис 40.11; Зах 9.16; Ин 10.11; Деян 2.24; 1 Фес 1.10"
                21 -> res = "1 Пет 5.10; 2 Кор 3.5; 1 Фес 5.23"
            }
        }
        return res
    }

    fun kniga77(glava: Int, stih: Int): String {
        if (glava == 1) {
            when (stih) {
                3 -> res = "Лк 11.28"
                4 -> res = "Исх 3.14; Откр 4.5"
                5 -> res = "Пс 88.38; 1 Пет 1.19; 1 Ин 1.7; 1 Кор 15.20; Кол 1.18; Евр 9.14"
                6 -> res = "Исх 19.6; 1 Пет 2.9"
                7 -> res = "Ис 3.14; Зах 12.10; Мф 24.30; Иуд 1.14"
                8 -> res = "Ис 41.4; Откр 2.8"
                9 -> res = "Рим 8.17"
                10 -> res = "Ис 44.6; 48.12"
                12 -> res = "Исх 25.37; Зах 4.2"
                13 -> res = "Иез 1.26; Дан 10.5, 16; Мф 28.18"
                14 -> res = "Дан 7.9"
                15 -> res = "Иез 43.2; Дан 10.6"
                16 -> res = "Ис 49.2; Мф 28.18; Еф 6.17; Откр 2.16"
                17 -> res = "Дан 8.18"
                18 -> res = "Иов 12.14; Ис 22.22; Откр 3.7"
                20 -> res = "Мал 2.7"
            }
        }
        if (glava == 2) {
            when (stih) {
                1 -> res = "Откр 1.16"
                2 -> res = "1 Ин 4.1; 2 Кор 11.13; 2 Тим 2.19"
                3 -> res = "Гал 6.9"
                5 -> res = "Иез 18.24; Откр 3.3"
                7 -> res = "Быт 2.9; 3 Езд 7.58"
                8 -> res = "Ис 41.4; 44.6; 48.12"
                9 -> res = "Лк 6.20; Иак 2.5; Рим 2.29"
                10 -> res = "Мф 10.21"
                11 -> res = "Откр 21.8"
                12 -> res = "Откр 1.16; 19.21"
                14 -> res = "Чис 25.1; 31.16"
                16 -> res = "Ис 11.4; 2 Фес 2.8; Откр 1.16"
                17 -> res = "Ис 65.15; Ин 6.33"
                18 -> res = "Откр 1.14-15"
                19 -> res = "2 Кор 9.12"
                20 -> res = "Исх 34.15; 1 Кор 10.19"
                23 -> res = "1 Цар 16.7; Пс 7.10; Иер 11.20; 17.10"
                26 -> res = "Дан 7.22; Ин 6.29; 1 Кор 6.3"
                27 -> res = "Пс 2.9"
                28 -> res = "2 Пет 1.19; Откр 22.16"
            }
        }
        if (glava == 3) {
            when (stih) {
                2 -> res = "Иез 33.7; Мф 24.42"
                3 -> res = "2 Пет 3.10; 1 Фес 5.2; Откр 16.15"
                4 -> res = "Откр 6.11; 7.9; 19.8"
                5 -> res = "Лк 10.20; Флп 4.3"
                7 -> res = "Иов 12.14; Ис 22.22; Лк 1.32; Откр 1.18"
                8 -> res = "1 Кор 16.9; Кол 4.3"
                9 -> res = "Ис 49.23; 60.14"
                10 -> res = "2 Пет 2.9; 1 Кор 10.13"
                11 -> res = "Откр 2.10"
                12 -> res = "Евр 12.22; Откр 2.17; 14.1"
                14 -> res = "Кол 1.15"
                17 -> res = "Ос 12.8; 1 Кор 4.8"
                18 -> res = "Откр 7.13; 16.15; 19.8"
                19 -> res = "Притч 3.12; Евр 12.5"
                20 -> res = "Песн 5.2; Ин 14.23"
                21 -> res = "Мф 19.28; Откр 1.6; 2.27"
            }
        }
        if (glava == 4) {
            when (stih) {
                2 -> res = "Ис 6.1; Иез 1.26; Дан 7.9"
                4 -> res = "Откр 1.6; 2.26; 3.4; 6.11; 7.13"
                5 -> res = "Зах 4.10; Откр 1.4; 5.6; 8.5"
                8 -> res = "Ис 6.2-3; Откр 1.8"
            }
        }
        if (glava == 5) {
            when (stih) {
                1 -> res = "Ис 29.11"
                5 -> res = "Быт 49.9; Ис 11.1, 10; Рим 15.12"
                6 -> res = "Ис 53.7; 1 Пет 1.1"
                9 -> res = "Деян 20.28"
                10 -> res = "Исх 19.6; 1 Пет 2.9"
                11 -> res = "Дан 7.10; Евр 12.22"
                13 -> res = "Флп 2.10; Откр 7.10"
            }
        }
        if (glava == 6) {
            when (stih) {
                2 -> res = "Откр 19.11"
                5 -> res = "Откр 5.9"
                8 -> res = "Иез 14.21"
                10 -> res = "Лк 18.7; Откр 19.2"
                11 -> res = "Откр 3.5; 7.9"
                12 -> res = "Мф 24.29"
                14 -> res = "Ис 34.4; Евр 1.11-12"
                16 -> res = "Ис 2.19; Ос 10.8; Лк 23.30; Откр 9.6"
            }
        }
        if (glava == 7) {
            when (stih) {
                3 -> res = "Иез 9.4; Откр 14.1"
                9 -> res = "Откр 3.5; 6.11"
                10 -> res = "Иер 3.23; Ос 13.4; Откр 19.1"
                14 -> res = "Ис 1.18; Евр 9.14"
                15 -> res = "Ис 4.2; Откр 21.3"
                16 -> res = "Пс 120.6; Ис 49.10"
                17 -> res = "Пс 22.1; 35.8-10; Ис 25.8; Откр 21.4"
            }
        }
        if (glava == 8) {
            when (stih) {
                2 -> res = "Тов 12.15; Мф 18.10"
                3 -> res = "Откр 5.8; 6.9"
                4 -> res = "Пс 140.2"
                5 -> res = "Откр 11.19; 16.18"
            }
        }
        if (glava == 9) {
            when (stih) {
                4 -> res = "Исх 12.23; Иез 9.4; Откр 7.3"
                6 -> res = "Иов 3.21; Ис 2.19; Ос 10.8; Лк 23.30"
                8 -> res = "Иоил 1.6"
                9 -> res = "Иоил 2.5"
            }
        }
        if (glava == 10) {
            when (stih) {
                1 -> res = "Иез 1.27; Мф 17.2; Откр 1.15"
                4 -> res = "Дан 12.4, 9"
                5 -> res = "Дан 12.7"
                6 -> res = "Неем 9.6"
                7 -> res = "Откр 11.15"
                9 -> res = "Иез 2.8; 3.1, 3"
            }
        }
        if (glava == 11) {
            when (stih) {
                1 -> res = "Откр 21.15"
                2 -> res = "Откр 13.5"
                4 -> res = "Зах 4.3, 11, 14"
                5 -> res = "Ис 11.4; Иер 5.14; Ос 6.5; 2 Фес 2.8"
                6 -> res = "Исх 7.19; 3 Цар 17.1"
                7 -> res = "Откр 17.8"
                14 -> res = "Откр 8.13; 9.12"
                15 -> res = "Откр 10.7"
                16 -> res = "Откр 4.4"
            }
        }
        if (glava == 12) {
            when (stih) {
                3 -> res = "Откр 13.1; 17.3; 20.2"
                5 -> res = "Пс 2.9; 1 Кор 15.25; Откр 2.27"
                6 -> res = "Откр 11.3"
                7 -> res = "Дан 10.13; 12."
                9 -> res = "Лк 10.18"
                10 -> res = "Зах 3.1"
                11 -> res = "Рим 8.37"
                12 -> res = "Ис 49.13"
                14 -> res = "Дан 7.25; 12.7"
            }
        }
        if (glava == 13) {
            when (stih) {
                1 -> res = "Дан 7.7; Откр 12.3; 17.3"
                5 -> res = "Дан 7.8; 11.36"
                7 -> res = "Дан 7.21; Откр 11.7"
                8 -> res = "Дан 12.1; Флп 4.3; Откр 17.8; 21.27"
                10 -> res = "Быт 9.6; Ис 33.1; Мф 26.52; Откр 14.12"
                13 -> res = "Втор 13.2; Мф 24.24; Откр 16.14"
                16 -> res = "Откр 14.11"
                18 -> res = "Откр 17.9"
            }
        }
        if (glava == 14) {
            when (stih) {
                1 -> res = "Иез 9.4; Откр 7.3"
                2 -> res = "Откр 5.8; 19.6"
                4 -> res = "1 Кор 6.20; 2 Кор 7.1; 11.2"
                5 -> res = "Соф 3.13; Еф 5.27"
                7 -> res = "Пс 32.6; 145.6; Деян 14.15"
                8 -> res = "Ис 21.9; Иер 51.8-9; Иез 16.35; Откр 16.19"
                10 -> res = "Пс 74.9; Ис 66.24; Иер 25.9; Откр 16.19"
                11 -> res = "Ис 34.10; Мф 25.41; Ин 5.29; Откр 19.3"
                13 -> res = "Прем 4.7; 1 Фес 4.14"
                14 -> res = "Дан 7.13"
                15 -> res = "Иоил 3.13; Мф 13.39"
                18 -> res = "Откр 8.5"
                19 -> res = "Откр 19.15"
                20 -> res = "Ис 63.3"
            }
        }
        if (glava == 15) {
            when (stih) {
                2 -> res = "Откр 4.6"
                3 -> res = "Исх 15.1; 6.13; Втор 32.4; Пс 144.17; Ос 14.10"
                4 -> res = "Иер 10.7"
                8 -> res = "Ис 6.4"
            }
        }
        if (glava == 16) {
            when (stih) {
                2 -> res = "Исх 9.9; Откр 13.17"
                5 -> res = "Откр 4.8"
                6 -> res = "Ис 49.26; Мф 23.34"
                12 -> res = "Иер 50.38"
                13 -> res = "Откр 12.9; 19.20; 20.10"
                14 -> res = "Мф 24.24"
                15 -> res = "Мф 24.46; Лк 12.39; 2 Кор 5.3; 1 Фес 5.2; Откр 3.3"
                18 -> res = "Откр 4.5; 8.5; 11.13"
                19 -> res = "Иер 25.15; Откр 14.8"
            }
        }
        if (glava == 17) {
            when (stih) {
                1 -> res = "Наум 3.4"
                2 -> res = "Иер 51.7; Откр 14.8; 18.3"
                3 -> res = "2 Фес 2.3-4, 7; Откр 13.1"
                5 -> res = "Откр 16.19; 18.2"
                8 -> res = "Дан 12.1; Откр 11.7; 13.1; 20.12"
                12 -> res = "Дан 7.20; Откр 13.1"
                14 -> res = "Дан 7.27; Мф 28.18; 1 Тим 6.15; Откр 18.8; 19.16"
                15 -> res = "Ис 8.7"
                16 -> res = "Откр 18.8"
                18 -> res = "Откр 16.19"
            }
        }
        if (glava == 18) {
            when (stih) {
                1 -> res = "Иез 43.2"
                2 -> res = "Ис 13.19; 21.9; Иер 50.1; 51.8; Вар 4.35"
                3 -> res = "Откр 17.2"
                4 -> res = "Ис 48.20; 52.11; Зах 2.7"
                5 -> res = "Иер 51.49"
                7 -> res = "Соф 2.15"
                10 -> res = "Иез 27.27, 30; Откр 14.8"
                17 -> res = "Иер 50.23; 51.13"
                20 -> res = "Ис 44.23; 49.13; Иер 51.48"
                21 -> res = "Иер 51.63-64"
                22 -> res = "Иез 26.13"
                23 -> res = "Иер 7.34; Откр 17.2"
                24 -> res = "Откр 17.6"
            }
        }
        if (glava == 19) {
            when (stih) {
                1 -> res = "Втор 32.43; Откр 7.10; 12.10"
                3 -> res = "Ис 34.10; Откр 14.11"
                4 -> res = "Откр 4.4; 5.14; 15.3"
                6 -> res = "Иез 1.24; 43.2; Откр 11.15"
                7 -> res = "Пс 44.14; Притч 9.1; Мф 22.2; Лк 14.16; 2 Кор 11.2; Откр 21.2"
                8 -> res = "Откр 3.18"
                11 -> res = "Откр 6.2"
                12 -> res = "Откр 1.14; 2.18"
                13 -> res = "Ис 63.2; Ин 1.1"
                14 -> res = "Откр 7.9"
                15 -> res = "Пс 2.9; Ис 11.4; 63.3"
                16 -> res = "Откр 17.14; 19.12"
                17 -> res = "Иер 12.9; Иез 39.17"
                20 -> res = "Откр 20.10"
            }
        }
        if (glava == 20) {
            when (stih) {
                1 -> res = "Лк 8.31; Откр 1.18"
                2 -> res = "2 Пет 2.4; Иуд 1.6; Откр 12.9"
                4 -> res = "Дан 7.9, 22; 8.17; Мф 19.28; 1 Кор 6.2; 2 Тим 2.12; Откр 6.11"
                6 -> res = "Ис 61.6; Откр 1.6; 21.7"
                7 -> res = "Иез 38.2; 39.1; Откр 16.14"
                9 -> res = "Ис 66.24; Откр 14.10"
                10 -> res = "Дан 7.11; Откр 19.20"
                11 -> res = "2 Пет 3.10"
                12 -> res = "Откр 2.23; 3.5; 13.8; 21.27"
                14 -> res = "1 Кор 15.26; Откр 2.11"
            }
        }
        if (glava == 21) {
            when (stih) {
                1 -> res = "Ис 65.17; 2 Пет 3.13"
                2 -> res = "Ис 52.1; 54.5; 2 Кор 11.2; Гал 4.26; Евр 12.22; Откр 3.12"
                3 -> res = "Лев 26.12; Иез 43.7"
                4 -> res = "Ис 25.8; 35.10; Откр 7.17"
                5 -> res = "Ис 43.19; 2 Кор 5.17"
                6 -> res = "Откр 1.8, 10; 22.13"
                7 -> res = "Евр 8.10"
                8 -> res = "1 Кор 6.9; Гал 5.19-21"
                9 -> res = "Откр 15.1; 19.7"
                12 -> res = "Иез 48.31"
                14 -> res = "Мф 16.18; Гал 2.9; Еф 2.20"
                15 -> res = "Иез 40.3"
                19 -> res = "Исх 28.17; Ис 54.11"
                23 -> res = "Ис 60.19; Откр 22.5"
                24 -> res = "Ис 60.3, 5"
                25 -> res = "Ис 60.11, 20; Откр 22.5"
                27 -> res = "Ис 35.8; Откр 20.12"
            }
        }
        if (glava == 22) {
            when (stih) {
                1 -> res = "Иез 47.1; Зах 14.8; Откр 4.6"
                2 -> res = "Иез 47.12; Откр 2.7"
                4 -> res = "Мф 5.8; 1 Ин 3.2; 1 Кор 13.12"
                5 -> res = "Ис 60.19; Откр 21.23"
                6 -> res = "Откр 1.1; 19.9; 21.5"
                7 -> res = "Откр 1.3; 3.11"
                9 -> res = "Откр 19.10"
                10 -> res = "Откр 1.3"
                11 -> res = "Иез 3.27; Дан 12.10; 2 Тим 3.13"
                12 -> res = "Откр 20.12"
                13 -> res = "Откр 1.8"
                14 -> res = "Откр 2.7"
                15 -> res = "Еф 5.5; Флп 3.2; Откр 21.8"
                16 -> res = "Чис 24.17; 2 Пет 1.19; Рим 15.12; Откр 2.28"
                17 -> res = "Ис 55.1; Ин 7.37; Откр 21.6"
                18 -> res = "Втор 4.2; 12.32; Притч 30.6"
            }
        }
        return res
    }
}